CREATE OR REPLACE PROCEDURE UBRR_XXI5."UBRR_BNKSERV" ( portion_date1 in date
                                                        ,portion_date2 in date
                                                        ,dtran         in date
                                                        ,ls            in varchar2 default null)
IS
/*************************************************** HISTORY *****************************************************\
   Дата          Автор          id        Описание
----------  ---------------  --------- ------------------------------------------------------------------------------
18.05.2011  Корольков Д.А.              ТП "Туристический" https://redmine.lan.ubrr.ru/issues/2793
23.11.2011  Корольков Д.А.              Новые тарифы ( 112/35 - Стартовый;
                                                       112/36 - Пакетный 30;
                                                       112/37 - Пакетный 60;
                                                       112/38 - Все включено;
                                                       112/39 - Торговый;
                                                       112/40 - Все включено(оплачена годовая комиссия) )
                                                       https://redmine.lan.ubrr.ru/issues/3905
28.12.2011  Бездворный А.В.             Исключаем счета КРС, категория/группа - 333/2
16.05.2012  Корольков Д.А.              ТП "Экспресс 100" https://redmine.lan.ubrr.ru/issues/4849
08.06.2012  Корольков Д.А.              Изменения тарифов 01.06.2012 https://redmine.lan.ubrr.ru/issues/4936
27.06.2012  Корольков Д.А.              Убраны блоки по расчёту комиссий:
                                            Межбанковский платеж на бумажном носителе для ТП "Пакетный 30"
                                            Межбанковский платеж на бумажном носителе для ТП "Экспресс 100"
                                            Межбанковский платеж на бумажном носителе для ТП <Пакетный 60>
                                            Межбанковский платеж на бумажном носителе для ТП <Торговый>
                                            Внутрибанковский платеж на бумажном носителе для тарифов: 112/35 - Стартовый,
                                                                                                      112/35 - Тест-драйв - новый UBRR Pashevich A. #12-1224 условие срочно Эконом
                                                                                                      112/36 - Пакетный 30,
                                                                                                      112/37 - Пакетный 60,
                                                                                                      112/38 - Все включено,
                                                                                                      112/39 - Торговый,
                                                                                                      112/40 - Все включено
                                            Внутрибанковский платеж на бумажном носителе для тарифа "Экспресс 100"
                                            Проведение платежей текущей датой: с 17-00 ч до 18-00 ч внутрибанковский платеж
                                                                               с 18-00 ч до 20-00 ч внутрибанковский платеж
                                                                               с 20-00 ч до 22-00 ч внутрибанковский платеж
                                            --
                                            Исходную версию искать в Y:\#For_Update
12.07.2012  Корольков Д.А.              Изменение тарифов с 01.07.2012 https://redmine.lan.ubrr.ru/issues/5118
23.08.2012  Корольков Д.А.              Новый пакет "Бизнес-комплект", тарифы для НТК https://redmine.lan.ubrr.ru/issues/5420
25.03.2013  Пашевич А.О.                Изменены тарифы Континенталь
04.04.2013  Пашевич А.О.                Добавлены расчеты , аналогичные прежним, по счетам из справочника
                                            "Настройка индивидуальных комиссий для крупных клиентов"
                                            Самоинкассация считается в отдельной процедуре ubrr_xxi5.ubrr_unq_comms
08.05.2013  Пашевич А.О.                Курпные клиенты RKO тариф по справочнику
19.08.2013  Пашевич А.О.                Тариф Муниципальный
24.05.2013  Галиева Н.А.                Изменение тарифов на 01.07.2013 г.
11.10.2013  Пашевич А.О.                https://redmine.lan.ubrr.ru/issues/8201
                                            Тарифный план "Туристический"
                                            Добавить в тарифный план "Туристический" (валютный пакет) лимит
                                            бесплатных межбанковских платежей - 4000 шт., т.е. за 4000 платежей комиссия не взымается,
                                            начиная с 4001 платежа-комиссия за межбанковский платеж по стандарту.
14.11.2013  Галиева Н.А.                Добавление новых ТП 6474,6471,6473 на 01.11.2013 г.
25.10.2013  Корольков Д.А.  12-1657     (#9707) Тарифный план "Аккредитивы в иностранной валюте"(112/59)
11.12.2013  y.metalnikov@i-sys.ruf
                            12-2172     АБС Иизменения по формированию комиссий за ведение счета и за подтверждение платежей.(112/40)
                                            https://redmine.lan.ubrr.ru/issues/11232
20.12.2013  Корольков Д.А.  12-2288     (#11418) Изменение очередности списания денежных средств, ст 855 ГК (комиссия за платежки)
29.01.2014  Галиева Н.А.                Изменение тарифов на 01.01.2014 г. Распоряжение № 7006-4596 от 11.12.2013
20.03.2014  Галиева Н.А.                Добавление новых ТП 6480,6490,6491,6481,6482,6484,6486,6487 на 17.03.2014 г.
12.03.2014  Пашевич А.О.                Добавляем счета 42309 https://redmine.lan.ubrr.ru/issues/11596
06.05.2014  Пашевич А.О.    14-406      Тарифный план "Все просто"
09.06.2014  Галиева Н.А. Добавление новой ТП 6488,6497.
                            14-992      АБС: Автоматизация формирования комиссии по пакету "Тест-драйв Премиум"
                            14-959      AБС: Стоимость платежей в зависимости от времени их проведения
30.10.2014  Pashevich AO                добавление аудита по кт/группы  + нотариус
21.01.2015  Галиева Н.А.                Изменение тарифов на 01.01.2014 г. Распоряжение № 7006-4289 от 09.12.2014 г.
16.12.2014  Pashevich           14-1344 AO АБС: Настройка комиссии по ТП Яблоко за каждый операционный день
18.02.2015  Новолодский А. Ю.   12-2313 Тарифный план "Эквайринг" https://redmine.lan.ubrr.ru/issues/11831
02.02.2015  Новолодский А. Ю.   12-2313 Тарифный план "Эквайринг" https://redmine.lan.ubrr.ru/issues/11831, доработки
06.04.2015  ubrr Макарова Л.Ю.  15-42   Доп. комиссия за ведение счета Ибанк-Pro Online
07.04.2015  ubrr Макарова Л.Ю.  15-231  ТП "Онлайн бесплатно"
08.04.2015  ubrr Макарова Л.Ю.  15-223  ТП "Все в дом", ТП "Все в дом премиум"
09.04.2015  ubrr Макарова Л.Ю.  15-279  ТП "Зарплатный"
06.05.2015  ubrr Макарова Л.Ю.  15-42   доп.треб. https://redmine.lan.ubrr.ru/issues/19917#note-36
26.05.2015  ubrr korolkov       15-453  Бизнес-комплект 3,6,12
30.04.2015  Новолодский А.Ю.    [15-44] АБС: Введение платы за смс-информирование
29.06.2015  Макарова Л.Ю.       [15-613] ТП Муниципальный-1 https://redmine.lan.ubrr.ru/issues/23046
07.07.2015  Галиева Н.А.          Добавление новой ТП 6483 на 01.07.2015 г.
20.07.2015  Галиева Н.А.           Изменение тарифов на 01.07.2015 г. Распоряжение № 7006-1990 от от 08.06.2015 г.
27.07.2015  Макарова Л.Ю.        15-830 АБС: ТП Все просто в НТК
04.08.2015  Галиева Н.А.         Испраление ошибки  по тарифам  Чебоксары ,Белгород -Комиссия за ведение р/с в режиме <Эконом> с использованием системы удаленного доступа без предоставления выписок и документов в бумажном виде
22.08.2015  Макарова Л.Ю.        [15-841] АБС: Взимание комиссий. Тарифы НТК с 03.08.15
01.09.2015  Макарова Л.Ю.        [15-921] АБС: Ведение счета бесплатно
30.09.2015  Ubrr Маkarova L.U. [15-1101] АБС: ТП Эквайринг для НТК
09.11.2015  Ubrr Pinaev  сортировка по  ITRNNUM https://redmine.lan.ubrr.ru/issues/25034
22.01.2016 Ubrr Маkarova L.U. [15-1644] АБС: Доработка ТП "Эквайринг", "Эквайринг-Все просто!"
25.01.2016  Галиева Н.А.           Изменение тарифов на 01.01.2016 г. Распоряжение № 7006-3351 от 10.12.2015 г.
03.02.2016  Галиева Н.А.          Исправление замечаний после предварительного расчета  6491,6483,6250,6245,6204,6242
15.02.2016  Галиева Н.А.         Исправление замечаний после окончательного  расчета  6245,6204,6242
11.03.2016 Макарова Л.Ю.         15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313
06.04.2016 Галиева Н.А        Распоряжение от 19.02.2016 № 7006-222 (тарифы НТК )
19.04.2016 Галиева Н.А        Распоряжение от 15.03.2016 № 7006-355 с 01.04.2016 тарифы SMS-рассылки
05.05.2016 Арсланов Д.Ф.   [16-1808.2.3.5.4.3.2]  #29736  ВУЗ РКО
10.07.2016 Арсланов Д.Ф.   16-2143.2 "Тест-драйв+"
18.07.2016 Галиева Н.А        Распоряжение  от  16.06.2016  № 7006-936 Изменение тарифов на 01.07.2016 г
21.07.2016 ubrr Maкарова Л.Ю. 16-2340 Бизнес-комплект БТП
07.09.2016 ubrr Maкарова Л.Ю. 16-2451 АБС: Пакет услуг Светофор в БТП и НТК
24.09.2016 ubrr Maкарова Л.Ю. 16-2653 АБС: Кат/гр 112/94 для пакета услуг "Бизнес-комплект"
19.10.2016 ubrr Maкарова Л.Ю. 16-2790 АБС: Удаление категории/группы 112/93 по пакету "Тест-драйв+", бюджет IB-Pro
25.10.2016 Галиева Н.А   Добавление новых ТП 6489-тарифы как 6472, ТП 6265- тарифы как у 6253 (письмо от ДРКК)
03.12.2016 Макарова Л.Ю.      16-2817 АБС Бухгалтерия: Корректное взимание комиссии (#38446)
17.01.2017 Галиева Н.А  Распоряжение  от  19.12.2016  № 7006-2097 Изменение тарифов на 01.01.2017 г , от 19.12.2016 № 7006-2096 (НТК)
09.02.2017 Галиева Н.А   Добавление  ТП 6257 - тарифы как 6237 (исправление ошибки)
18.04.2017 Галиева Н.А   Добавление  ТП 6485 Кунгурский фил.Пермский.Распоряжение  от 27.03.2017 № 7006-466
24.05.2017 Макарова Л.Ю. [14-985.18] Некорректное списание комиссии за проведение платежей ЮЛ и ИП
25.05.2017 Галиева Н.А  Распоряжения № 7006-574 от 13.04.2017  Изменение тарифов на 01.05.2017 г  ЦФК =0
13.06.2017 Макарова Л.Ю.  Восстановление процедуры расчета по всем типам комиссий, после решения иницдента  https://redmine.lan.ubrr.ru/issues/43726
30.06.2017 Макарова Л.Ю.  14-985.9 Вынос комиссий И-Банк-Pro и платное смс-информирование в отдельное ПО
04.07.2017 Галиева Н.А   Добавление  ТП 6490
21.07.2017 Галиева Н.А  Распоряжения № № 7006-931 от 09.06.2017  Изменение тарифов на 01.07.2017 г
03.08.2017 Галиева Н.А  исправление ошибок в тарифах по 6478,(PP6,017,018,PES6) 6254 (PP9)
01.09.2017 Макарова Л.Ю. [17-847] АБС: Некорректное списание комиссии за налоговые платежи # 46295
25.09.2017 Галиева Н.А  Распоряжения № 7006-1290 от 01.08.2017  Изменение тарифов на 01.09.2017 г
20.09.2017 ubrr korolkov [15-1436] АБС: Комиссия за ведение р/с и проведение п/п
07.11.2017 ubrr korolkov [17-1071] АБС: Ежедневные комиссии за платежи
19.01.2018 Галиева Н.А  Распоряжение № 7006-2358 от 15.12.2017 Изменение тарифов на 01.01.2018 г, Распоряжение № 7006-2360 от 15.12.2017 (НТК)
22.06.2018 Пинаев Д.Е.      [18-464]     Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)
03.07.2018 Ризанов Р.Т.  [18-465] Комиссия за ведение счета КРС
04.09.18 Макарова Л.Ю. Копейск 550 по тарифам от 01.07.18 (ошибка при вводе тарифов вместе с задачей 18-464)
04.09.2018 Баязитов М.Э. Исправление https://redmine.lan.ubrr.ru/issues/55147
05.09.2018 Баязитов М.Э. Исправление https://redmine.lan.ubrr.ru/issues/55147#note-6
24.09.2018 Баязитов М.Э. Исправление https://redmine.lan.ubrr.ru/issues/55147#note-9
22.10.2018 Баязитов      [18-56613]  ТП "Сбрось лишнее" (по типу ТП "Экспресс") для НТК с 01.11.18
11.12.2018 Баязитов      [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей
25.01.2019 г. Карачев А.А.  Служебная записка № 1122-05/002983 от 17.01.2019
01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
04.02.2019 Карачев А.А  исправление ошибок в тарифах по 6487
07.02.2019 Ризанов Р.Т.  [18-58411]   АБС: ТП "Промо" в режиме "Эконом"
31.05.2019 Ризанов Р.Т.  [19-59153] АБС. Лимит платежей в пакеты услуг "Бизнес-Класс 3,6,12"
11.07.2019 г. Карачев А.А.  Служебная записка № 1122-05/065172 от 10.07.2019 (НТК)
24.07.2019 Ризанов Р.Т. [19-62974] III ЭТАП УБРИР. Распространение Пакетов услуг УБРиР на ВУЗ
19.09.2019 Ризанов Р.Т. [19-62974] III ЭТАП УБРИР. Распространение Пакетов услуг УБРиР на ВУЗ
01.10.2019 Ризанов Р.Т             Исправление ошибки неначисления комиссии RKO по ГО по причине одновременной комиссии RKO, REB_PE в SBS
02.10.2019 Баязитов     [#67293]   Исправление ошибки https://redmine.lan.ubrr.ru/issues/67293
22.10.2019 Карачев А.А. СЗ, № 1122-05/113814 от 21.10.2019
22.10.2019 Баязитов    [19-67950]  Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
18.10.2019 Баязитов     [19-62184] Ежемесячные комиссии
10.12.2019 Баязитов     [19-69749] Доработка АБС. ежемесячные комиссии (РКО) по обращению ДКБ
13.12.2019 Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
16.12.2019 Карачев А.А. План мероприятий по переводу в ВСП филиалов от 16.12.2019
09.01.2020 Баязитов     [19-70025] АБС: Тарифный план "Промо Online"
22.01.2019 Баязитов     [19-64846]  АБС: Уведомление об окончании пакета в ИБ + искл услуги "Эксплуатация ИБ-про" из пакетов услуг
03.02.2020 Баязитов     [19-69558.2] Двойное взимание комиссий по светофору
06.02.2020 Баязитов [19-69558.2] Ошибка #71284. Откат доработки https://redmine.lan.ubrr.ru/issues/71284#note-3
07.02.2020 Баязитов     [20-71580]   Перенос старых комиссий до 01.02.2018 в процедуру UBRR_BNKSERV. Удаление комментариев содержащие старый код.  https://redmine.lan.ubrr.ru/issues/71582#note-5
10.01.2020 Карачев А.А. СЗ, № 1122-05/006804 от 28.01.2020
20.02.2020 Карачев А.А. План мероприятий по переводу НТК Воронеж, Санкт-Петербург
04.03.2020 Карачев А.А. IM2425985 Исправление ошибок по настройкам тарифных планов
11.03.2020 Ризанов Р.Т. [20-72291] Ошибка при взимании комиссии за ведение счёта со счетов НТК
23.03.2020 Карачев А.А. План мероприятий по переподчинению НТК Филиала "Московский","Новосибирский", "Пермский" и "Уфимский" головному банку
03.04.2020 Карачев А.А. План мероприятий по переводу Воронежский , Московский и Санкт-Петербургский в ВСП
06.04.2020 исправление ошибок по IM2451128, реорганизация Филиалов по Воронежскому , Московскому и Санкт-Петербургскому в ВСП
23.04.2020 Карачев А.А. План мероприятий по переводу Новосибирский, Южно-Уральский в ВСП
23.04.2020 Карачев А.А.  Служебная записка № 1122-05/034066 от 20.04.2020 (НТК)
12.05.2020 Карачев А.А. План мероприятий по переводу Пермский, Уфимский в ВСП
13.08.2020 Карачев А.А. План мероприятий по переводу Кировский в ВСП
13.08.2020 Карачев А.А. План мероприятий по переподчинению НТК Филиала "Кировский" головному банку
31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ 
08.09.2020 Карачев А.А. СЗ, № 1122-05/078009 от 27.08.2020 Об изменении тарифов по ежемесячным комиссияим, по пакетам услуг
09.09.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)
01.10.2020 Карачев А.А. IM2598357 исправление суммы комиссий
\*************************************************** HISTORY *****************************************************/

    gc_calc constant boolean := portion_date1 < to_date('01.02.2018', 'dd.mm.yyyy'); -- 07.11.2017 ubrr korolkov 17-1071

    d1       date := portion_date1; -- Пришедшие даты с вызова процедуры
    d2       date := portion_date2;
    d3          date := dtran;
    acc_1       varchar2(25) := NVL(ls,'40___810%');
    ivTime      number;
    cg_112_59   varchar2(6) := '112/59';
    v_autab     number(3)   := 304;
    cg_112_70   varchar2(6) := '112/70';-- UBRR Pashevich AO 14-959
    -- UBRR Pashevich AO 14-992
    cg_112_72   varchar2(6) := '112/72';
    cg_112_35   varchar2(6) := '112/35';
    -->> UBRR Макарова Л.Ю. 15-279
    cg_112_75   varchar2(6) := '112/75';
    --<< UBRR Макарова Л.Ю. 15-279
    -- UBRR Pashevich AO 14-992
    -- >> 24.07.2019 Ризанов Р.Т. [19-62974] III ЭТАП УБРИР. Распространение Пакетов услуг УБРиР на ВУЗ
    l_cnt_rko number;
    l_cnt_rec number;
    lc_idsmr  constant varchar2(3) := sys_context ('B21', 'IDSmr');
    -->>28.01.2020 Баязитов [19-64846]
    dg_date_start constant date := to_date('01.01.1990', 'dd.mm.rrrr');
    dg_date_end   constant date := to_date('01.01.4000', 'dd.mm.rrrr');
    --<<28.01.2020 Баязитов [19-64846]
     -----------------------------------------------------
     procedure write_det_log( p_str in varchar2 )
     is
     begin
         ubrr_bnkserv_calc_new_lib.WriteProtocol( p_str||chr(10)||
                                                  '(UBRR_BNKSERV) '   ||chr(10)||'('||
                                                  'portion_date1='    ||to_char(portion_date1,'DD.MM.YYYY') ||';'||chr(10)||
                                                  'portion_date2='    ||to_char(portion_date2,'DD.MM.YYYY') ||';'||chr(10)||
                                                  'dtran='            ||to_char(dtran,'DD.MM.YYYY')         ||';'||chr(10)||
                                                  'ls='               ||ls                                  ||';'||
                                                  ')'
                                                );
     end write_det_log;
    -- << 24.07.2019 Ризанов Р.Т. [19-62974] III ЭТАП УБРИР. Распространение Пакетов услуг УБРиР на ВУЗ
BEGIN  -------------------------------------------UBRR_BNKSERV-----------------------------------------------
   write_det_log('Начало заполнения SBS для ежемесячных комиссий УБРиР');
-->>30.06.2017 Макарова Л.Ю.  14-985.9 Вынос комиссий И-Банк-Pro и платное смс-информирование в отдельное ПО
   DELETE FROM SBS where (csbsdo  not like 'R_SMS%') and  (csbsdo  <> 'R_IB')
   and (csbsdo  <> 'SEN');  -->><<-- 05.04.2018 Пинаев Д.Е. [17-895] АБС: Взимание комиссии за самоинкассацию по ККК
--<<30.06.2017 Макарова Л.Ю.  14-985.9 Вынос комиссий И-Банк-Pro и платное смс-информирование в отдельное ПО
    DBMS_TRANSACTION.COMMIT;
/*     where csbsdo in ('UAB','PP9','PE9','PP6','PE6','PP3','PP1',
                      'RKO','REO','RKB','REB','RKS','016','017',
                      '018','045','INF')*/

    select -1*ismrtimeshift/60
      into ivTime
      from smr;

-->>> ubrr rizanov 03.07.2018 18-465 Комиссия за ведение счета КРС
 -- Заполняем структуру-связку ubrr_data.ubrr_sbs_ext_krc для всех филиалов только под 1 филиалом
 -- Дальнейшее заполнение xxi.sbs и регистрация плат_документов филиалы делают сами
   ubrr_bnkserv_krc.fill_sbs_ext_krc( p_portion_date1 => d1
                                               ,p_portion_date2 => d2
                                               ,p_dtran         => d3
                                               ,p_ls            => acc_1
                                               ,p_idsmr         => sys_context ('B21', 'IDSmr') );
--<<< ubrr rizanov 03.07.2018 18-465 Комиссия за ведение счета КРС

----------------------------------------------------------------------------------------------------------------------------
-- (нач.) UBRR Новолодский А. Ю. 18.02.2015   12-2313  Тарифный план "Эквайринг" https://redmine.lan.ubrr.ru/issues/11831
/*
По тарифу "Эквайринг", счёт с категорией/группой 112/62-90
Ведение расчетного счета с использованием системы удаленного доступа
*/
   INSERT INTO SBS
   ( cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, cSBSdo ,iSBSdebdoc,mSBSdebob,iSBScreddoc,mSBScredob)
   (select to_char(sysdate,'HH24:MI:SS'), acc, ctrncur,
            /*decode(
                ubrr_rko.IsEqrExistsCatGrList(acc, ctrncur, d1, d2),
                 '112/62', 1600,
                 '112/63', 2100,
                 '112/64', 2600,
                 '112/65', 3100,
                 '112/66', 3600,
                 0
            ),*/
            decode(
                caccmail,DECODE(caccmail, 'K', 'K', 'P'), ubrr_rko.F_GetComSum (p_com => 'R_EKV'||substr(ubrr_rko.IsEqrExistsCatGrList(acc, ctrncur, d1, d2), 5,2),p_otd => iaccotd)
            ),
           'R_EKV'||substr(ubrr_rko.IsEqrExistsCatGrList(acc, ctrncur, d1, d2), 5,2), sum(cd), sum(md), sum(cc), sum(mc)
      from (select ctrnaccd acc, ctrncur, count(1) c, iaccotd, count(1) cd, sum(mtrnsum) md , 0 cc, 0 mc, caccmail
              from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v trn, acc a -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
             where
                   a.caccacc LIKE acc_1
                and a.cacccur = 'RUR'
                -->> Ubrr Маkarova L.U. Торговый,условия отбора док-тов, для взимания комиссии
               and a.caccprizn <> 'З'
-->>15-1221          , согласно п.2 https://redmine.lan.ubrr.ru/issues/24921#note-5, для оптимизации времени расчета
 and   exists (select 1
                          from gac g
                           where     cgacacc = cACCacc
                                 and cgaccur = cACCcur
                                 and igaccat = 112
                                 and igacnum  IN (62, 63, 64, 65,66, 81,82,83,84,85,86,87,88,89,90)
                                 and exists (select 1
                                              from xxi.au_attach_obg au
                                               where     au.caccacc = cACCacc
                                                     and au.cacccur = cACCcur
                                                     and i_table = 304
                                                     and d_create<=d2
                                                     and au.c_newdata  IN ('112/62', '112/63', '112/64', '112/65','112/66', '112/81','112/82','112/83',
                                                     '112/84','112/85','112/86','112/87','112/88','112/89','112/90')))
--<<15-1221      , согласно п.2 https://redmine.lan.ubrr.ru/issues/24921#note-5   , для оптимизации времени расчета
               and a.iaccbs2 NOT IN (40813, 40817, 40818, 40820
                                      -- UBRR Pashevich A. 12-101
                                      ,42309,40810,40811,40812,40823,40824 -->><<-- ubrr 12.07.2016 Арсланов Д.Ф. #30780
                                      -- UBRR Pashevich A. 12-101
                                      )
               and SUBSTR (a.caccacc, 1, 3) NOT IN ('401', '402', '403', '404', '409')
               AND a.caccacc NOT LIKE '40821________7%' -- 29/12/2011 Бездворный А.В. комиссии по 40821 (контрагенты) по РКО не считаем
               -- ubrr katyuhin <<<
               and trn.ctrnaccd = a.cACCacc
               and trn.ctrncur = a.cACCcur
               and dtrntran between d1 and d2+86399/86400
               -->> 20.09.2017 ubrr korolkov 15-1436
               and substr(case when iTrnType in (5, 50, 53, 52, 55, 17, 41, 42, 43, 44) then nvl(cTrnClient_Acc, cTrnAccC) when cTrnMfoA is null then nvl(cTrnAccA, cTrnAccC) else cTrnAccA end, 1, 5) not in ('60309', '60322')
               --<< 20.09.2017 ubrr korolkov 15-1436
               and (  (    itrntype in (2,3,4,11,14,15,21,22,23,25,28)
                       and (   substr(itrnba2c,1,3) in (111,301,302,303,401,402,403,404,405,406,407,423,426)
                            or itrnba2c in (10000,40802,40807,40817,40818,40820,40911))
                -- Зуев А.А. раньше это условие распространялось и на кассу
 -->> Ubrr Маkarova L.U. [15-1101] АБС: ТП Эквайринг для НТК
           and exists (select 1
                     from gac
                    where cgacacc = a.cACCacc
                      and cgaccur = a.cACCcur
                      and igaccat = 131
                      and exists (select 1
                                    from xxi.au_attach_obg au
                                   where au.caccacc = a.cACCacc
                                     and au.cacccur = a.cACCcur
                                     and i_table = 304
                                     and d_create <= d2
                                     and au.c_newdata like '131%'))
-->>22.01.2016 Ubrr Маkarova L.U. [15-1644]
                       /* and exists (select /*+ index( t I_TRN_ACCD_CUR_DTRN_TYPE )
                                           1
                                      from xxi.V_TRN_PART_CURRENT t
                                     where t.ctrnaccd = trn.ctrnaccd
                                       and t.ctrncur = trn.ctrncur
                                       and dtrntran between d1 and d2+86399/86400
                                       and itrnsop=4)*/
 -->>22.01.2016 Ubrr Маkarova L.U. [15-1644]
)
                    or (    itrntype in (9,13)
                        and exists (select 1
                                      from gac
                                     where cgacacc = cTRNaccd
                                       and cgaccur = ctrncur
                                       and igaccat=105
                                       and igacnum in (1,2,8,9,
-- Ubrr Pashevich A. 12-1531
                                                       11
-- Ubrr Pashevich A. 12-1531
))))
  -->> ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
         and not (itrntype = 22 and regexp_like(ctrnpurp, '^ *(|! *)0406')
                  and exists (select 1 from xxi."smr" where csmrmfo8 = ctrnmfoa))
         --<< ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
  and not exists (select 1
                                 from sbs
                                where csbsdo like 'RK%'
                                  and csbsacc = a.caccacc)
-->> 11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю.
 and  not exists (select 1
                          from gac g
                           where     cgacacc = a.cACCacc
                                 and cgaccur = a.cACCcur
                                 and igaccat = 112
                                 and igacnum = 92
                                 and exists (select 1
                                              from xxi.au_attach_obg au
                                               where     au.caccacc = a.cACCacc
                                                     and au.cacccur = a.cACCcur
                                                     and i_table = 304
                                                     and d_create<=d2 and au.c_newdata = '112/92'))

--<<- 11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю.
 -->> Ubrr Маkarova L.U. Торговый,условия отбора док-тов, для взимания комиссии
               --and a.iaccotd in ()
               --and a.iaccotd in (select iotdnum from "otd" where idsmr = ...)
               and not exists (select 1
                                 from gac
                                where cgacacc = a.cACCacc
                                  and igaccat = 333
                                  and igacnum = 2)
               and ubrr_rko.IsEqrExistsCatGrList(ctrnaccd, ctrncur, d1, d2) is not null
---<<<UBRR Pashevich A. #12-508
       -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
       and not exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                     UBRR_UNIQUE_ACC_COMMS uuac 
                               where caccacc = uutc.cacc 
                                 and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF 
                                 and lc_idsmr = uutc.idsmr 
                                 and uutc.status = 'N'
                                 and uutc.uuta_id = uuac.uuta_id
                                 and uuac.com_type in ('RKBP','RKBK','RKO')
                       )  
       --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
--->>>UBRR Pashevich A. #12-508
            group by ctrnaccd,ctrncur,iACCotd, caccmail
UNION all
            select /*+ index( trn I_TRN_OLD_NEW_ACDT )*/ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                   ctrnaccc acc, ctrncur, count(1) c, iaccotd, 0 cd, 0 md, count(1) cc, sum(mtrnsum) mc, caccmail
            from acc,
                 ubrr_trn_old_new_v trn --xxi.V_TRN_PART_CURRENT -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
            where
            -- ubrr katyuhin >>>
                  acc.caccacc LIKE acc_1
              and acc.cacccur = 'RUR'
              and acc.caccprizn <> 'З'
              and acc.iaccbs2 NOT IN (40813,40817,40818,40820
                                     -- UBRR Pashevich A. 12-101
                                     ,42309,40810,40811,40812,40823,40824 -->><<-- ubrr 12.07.2016 Арсланов Д.Ф. #30780
                                     -- UBRR Pashevich A. 12-101
                                     )
              and substr(acc.caccacc,14,1) <> '4'
              and substr(acc.caccacc,1,3) not in ('401','402','403','404','409')
              and acc.caccacc like '40___810%'
              AND acc.caccacc NOT LIKE '40821________7%' -- 29/12/2011 Бездворный А.В. комиссии по 40821 (контрагенты) по РКО не считаем
              and substr(trn.ctrnaccd,1,5) not in ('47426', '70606')
-->> Ubrr Маkarova L.U. [15-1101] АБС: ТП Эквайринг для НТК ТОЛЬКО СУД! -утратил силу
       -->>22.01.2016 Ubrr Маkarova L.U. [15-1644]
             /* and exists    (select /*+ index( t I_TRN_ACCD_CUR_DTRN_TYPE )
                                           1
                                      from xxi.V_TRN_PART_CURRENT t
                                     where t.ctrnaccd = trn.ctrnaccd
                                       and t.ctrncur = trn.ctrncur
                                       and dtrntran between d1 and d2+86399/86400
                                       and itrnsop=4)    */
 -->>22.01.2016 Ubrr Маkarova L.U. [15-1644]
            -- ubrr katyuhin <<<
              and trn.ctrnaccc = acc.caccacc
              and trn.ctrncurc = acc.cacccur
              and trn.dtrntran between d1 and d2+86399/86400
              and trn.itrntype in (-7, 2, 5, 10, 12, 51, 53, 55)
              and not (trn.itrntype=4 and trn.itrnsop=51 and trn.ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
              -->> 20.09.2017 ubrr korolkov 15-1436
              and not (ctrnaccd like '30232%' and lower(replace(ctrnpurp, ' ')) like 'возм%термин%')
              --<< 20.09.2017 ubrr korolkov 15-1436
              and substr(nvl(trn.ctrnacca,0),1,5) not in ('47426', '70606')
-- Ubrr Pashevich A. 12-1531
              and not exists (select 1
                                from sbs
                               where csbsdo like 'RK%'
                                 and csbsacc=acc.caccacc)
              and not exists (select 1
                                from sbs
                               where csbsdo like 'R_Onl%'
                                 and csbsacc=acc.caccacc)
-->> 11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю.
 and  not exists (select 1
                          from gac g
                           where     cgacacc = acc.cACCacc
                                 and cgaccur = acc.cACCcur
                                 and igaccat = 112
                                 and igacnum = 92
                                 and exists (select 1
                                              from xxi.au_attach_obg au
                                               where     au.caccacc = acc.cACCacc
                                                     and au.cacccur = acc.cACCcur
                                                     and i_table = 304
                                                     and d_create<=d2 and au.c_newdata = '112/92'))

--<< 11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю.
 -->> Ubrr Маkarova L.U. [15-1101] АБС: ТП Эквайринг для НТК
           and exists (select 1
                     from gac
                    where cgacacc = acc.cACCacc
                      and cgaccur = acc.cACCcur
                      and igaccat = 131
                      and exists (select 1
                                    from xxi.au_attach_obg au
                                   where au.caccacc = acc.cACCacc
                                     and au.cacccur = acc.cACCcur
                                     and i_table = 304
                                     and d_create <= d2
                                     and au.c_newdata like '131%'))
 -->> Ubrr Маkarova L.U. [15-1101] АБС: ТП Эквайринг для НТК
              and exists (select 1
                            from gac
                           where cgacacc = acc.caccacc
                             and cgaccur = acc.cacccur
                             and igaccat = 105
                             and igacnum in (1,2,8,9,
-- Ubrr Pashevich A. 12-1530
                                             11
-- Ubrr Pashevich A. 12-1530
))
   and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and igaccat = 333
                                  and igacnum = 2)
               and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and igaccat = 333
                                  and igacnum = 2)
               and ubrr_rko.IsEqrExistsCatGrList(ctrnaccc, ctrncur, d1, d2) is not null
---<<<UBRR Pashevich A. #12-508
              -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
              and not exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                            UBRR_UNIQUE_ACC_COMMS uuac 
                               where caccacc = uutc.cacc 
                                 and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF 
                                 and lc_idsmr = uutc.idsmr 
                                 and uutc.status = 'N'
                                 and uutc.uuta_id = uuac.uuta_id
                                 and uuac.com_type in ('RKBP','RKBK','RKO')
                       )  
               --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
          group by ctrnaccc,ctrncur,iACCotd, caccmail)
     group by acc,ctrncur,iaccotd, caccmail);
-->> Ubrr Маkarova L.U. Торговый,условия отбора док-тов, для взимания комиссии
    DBMS_TRANSACTION.COMMIT;
-- (кон.) UBRR Новолодский А. Ю. 18.02.2015 12-2313  Тарифный план "Эквайринг" https://redmine.lan.ubrr.ru/issues/11831

----------------------------------------------------------------------------------------------------------------------------
-->>--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю.
   INSERT INTO SBS
/*   ( cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, cSBSdo ,iSBSdebdoc,mSBSdebob,iSBScreddoc,mSBScredob)
   (select to_char(sysdate,'HH24:MI:SS'), acc,ctrncur,300,'R_IB', sum(cd),sum(md),sum(cc),sum(mc)
      from (
             select /*+ index( trn I_TRN_ACCD_CUR_DTRN_TYPE )
                    ctrnaccd acc,ctrncur,count(1) c,iaccotd,count(1) cd,sum(mtrnsum) md ,0 cc,0 mc, caccmail*/

 ( cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, cSBSdo,iSBSdebdoc,mSBSdebob,iSBScreddoc,mSBScredob )
   (select to_char(sysdate,'HH24:MI:SS'), acc,ctrncur,
         /*DECODE(iACCotd,6201,1150,6248,1150,6261,1150,6204,1150,6242,1150,6245,1150,6205,1100,6212,1100,6246,1100,6237,1100,6257,1100,6222,1100,6264,1100,6231,1050,6250,1150, --- 09.02.2017 Галиева Н.А   Добавление  ТП 6257 - тарифы как 6237
                  6253,1100,6265,1100,6255,1000,6254,1100,6102,1100,6402,1100,6404,1100,6104,1050,6411,1050,6414,1050,6103,900,6921,900,6405,900,6922,900,6421,800,6923,800,6107,1100,
                  6401,1100,6403,1100,6406,1100,6408,1100,6416,1100,6409,1000,6427,1050,6474,1000,6105,1200,6112,1100,6473,1100,6486,1100,6440,1100,6106,1100,
                  6412,1100,6480,1000,6109,1100,6413,1100,6429,1100,6431,1100,6453,1000,6488,1100,6418,1100,6417,1050,6463,1050,6442,1050,6454,1050,6452,1050,
                  6110,1100,6410,1100,6422,1100,6460,1100,6428,1100,6471,1000,6445,1100,6493,1100,6115,1100,6483,1100,6464,1100,6487,1000,6478,1150,6479,1150,
                  6482,1150,6469,1000,6470,1000,6114,1100,6472,1000,6489,1000,6116,1200,1600), -- 22.10.2019 Карачев А.А. СЗ, № 1122-05/113814 от 21.10.2019 */
           DECODE(iACCotd,6201,1150,6248,1150,6261,1150,6204,1150,6242,1150,6245,1150,6205,1100,6212,1100,6246,1100,6237,1100,6257,1100,6222,1100,6264,1100,6231,1050,6250,1150, --- 09.02.2017 Галиева Н.А   Добавление  ТП 6257 - тарифы как 6237
                  6253,1100,6265,1100,6255,1000,6254,1100,6102,1100,6925,1100,6402,1100,6926,1100,6404,1100,6927,1100,6104,1050,6930,1050,6411,1050,6931,1050,6414,1050,6932,1050,
                  6103,900,6921,900,6405,900,6922,900,6421,800,6923,800,6107,1100,6401,1100,6403,1100,6406,1100,6408,1100,6416,1100,6409,1000,6427,1050,6474,1000,6105,1200,6112,1100,
                  6473,1100,6486,1100,6440,1100,6106,1100,6412,1100,6480,1000,6109,1100,6413,1100,6429,1100,6431,1100,6453,1000,6488,1100,6418,1100,6417,1050,6463,1050,6442,1050,
                  6454,1050,6452,1050,6110,1100,6410,1100,6422,1100,6460,1100,6428,1100,6471,1000,6445,1100,6493,1100,6935,1100,6115,1100,6483,1100,6464,1100,6487,1000,6478,1150,
                  6479,1150,6482,1150,6469,1000,6470,1000,6114,1100,6933,1100,6472,1000,6489,1000,6116,1200,6937,1100,6938,1100,6939,1100,6941,1100,6948,1200,6963,1200,6950,1100,
                  6951,1100,6952,1150,6953,1150,6954,1150,6955,1100,6956,1000,6968,1100,6969,1100,6970,1100,6971,1100,6973,1100,6974,1000,6975,1100,6976,1050,6981,1000,6982,1100,
                  6983,1100,6984,1100,6985,1100,6986,1100,6988,1100,6989,1000,6990,1000,6991,1000,6993,1100,6994,1100,6995,1050,6996,1100,6997,1100,6998,1100,6915,1000,6905,1050,
                  6907,1000,6908,1050,6910,1050,6912,1000,6913,1000,6914,1100,
                  6942,1100,6944,1100,6106,1100,
                  1600), -- 13.08.2020 Карачев А.А. План мероприятий по переводу Кировский в ВСП
           'R_Onl_Base', sum(cd), sum(md), sum(cc), sum(mc)
      from (
             select /*+ index(trn I_TRN_OLD_NEW_ADT)*/ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                    ctrnaccd acc,ctrncur,count(1) c,iaccotd,count(1) cd,sum(mtrnsum) md ,0 cc,0 mc
             from acc a,
                  ubrr_trn_old_new_v trn --xxi.V_TRN_PART_CURRENT -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
             where
                a.caccacc LIKE acc_1
                and a.cacccur = 'RUR'
                -->> Ubrr Маkarova L.U. Торговый,условия отбора док-тов, для взимания комиссии
               and a.caccprizn <> 'З'
               and a.iaccbs2 NOT IN (40813, 40817, 40818, 40820
                                      -- UBRR Pashevich A. 12-101
                                      ,42309,40810,40811,40812,40823,40824 -->><<-- ubrr 12.07.2016 Арсланов Д.Ф. #30780
                                      -- UBRR Pashevich A. 12-101
                                      )
               and SUBSTR (a.caccacc, 1, 3) NOT IN ('401', '402', '403', '404', '409')
               AND a.caccacc NOT LIKE '40821________7%' -- 29/12/2011 Бездворный А.В. комиссии по 40821 (контрагенты) по РКО не считаем
               -- ubrr katyuhin <<<
               and trn.ctrnaccd = a.cACCacc
               and trn.ctrncur = a.cACCcur
               and dtrntran between d1 and d2+86399/86400
               -->> 20.09.2017 ubrr korolkov 15-1436
               and substr(case when iTrnType in (5, 50, 53, 52, 55, 17, 41, 42, 43, 44) then nvl(cTrnClient_Acc, cTrnAccC) when cTrnMfoA is null then nvl(cTrnAccA, cTrnAccC) else cTrnAccA end, 1, 5) not in ('60309', '60322')
               --<< 20.09.2017 ubrr korolkov 15-1436
 and   exists (select 1
                          from gac g
                           where     cgacacc = a.cACCacc
                                 and cgaccur = a.cACCcur
                                 and igaccat = 112
                                 and igacnum = 92
                                 and exists (select 1
                                              from xxi.au_attach_obg au
                                               where     au.caccacc = a.cACCacc
                                                     and au.cacccur = a.cACCcur
                                                     and i_table = 304
                                                     and d_create<=d2 and au.c_newdata = '112/92'))
 -- АБС: ТП Онлайн + только для БТП
  -->> ubrr 22.06.2016 Арсланов Д.Ф. 16-2014 #31081 Закомментарил. Для НТК тоже расчитываем. Потом поменяем суммы. Так быстрее, чем 2 раза делать выборки
  /*and not exists (select 1
                     from gac
                    where cgacacc = a.cACCacc
                      and cgaccur = a.cACCcur
                      and igaccat = 131
                      and exists (select 1
                                    from xxi.au_attach_obg au
                                   where au.caccacc = a.cACCacc
                                     and au.cacccur = a.cACCcur
                                     and i_table = 304
                                     and d_create <= d2
                                   and au.c_newdata like '131%'))*/
  --<< ubrr 22.06.2016 Арсланов Д.Ф. 16-2014 #31081 Закомментарил.

              and not (itrntype=4 and itrnsop=51 and ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
              and (  (itrntype in (2,3,4,11,14,15,21,22,23,25,28)
                       and (   substr(itrnba2c,1,3) in (111,301,302,303,401,402,403,404,405,406,407,423,426)
                            or itrnba2c in (10000,40802,40807,40817,40818,40820,40911))
                -- Зуев А.А. раньше это условие распространялось и на кассу


)
                    or (    itrntype in (9,13)
                        and exists (select 1
                                      from gac
                                     where cgacacc = cTRNaccd
                                       and cgaccur = ctrncur
                                       and igaccat=105
                                       and igacnum in (1,2,8,9,
-- Ubrr Pashevich A. 12-1531
                                                       11
-- Ubrr Pashevich A. 12-1531
))))
  -->> ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
         and not (itrntype = 22 and regexp_like(ctrnpurp, '^ *(|! *)0406')
                  and exists (select 1 from xxi."smr" where csmrmfo8 = ctrnmfoa))
         --<< ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
  and not exists (select 1
                                 from sbs
                                where csbsdo like 'RK%'
                                  and csbsacc = a.caccacc)
 and not exists (select 1
                                 from sbs
                                where csbsdo like 'R_Onl_Min%'
                                  and csbsacc = a.caccacc)
 and not exists (select 1
                                 from sbs
                                where csbsdo like 'R_EKV%'
                                  and csbsacc = a.caccacc)
                -->> 25.06.2018 Пинаев Д.Е. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)
                and not exists (select 1
                             from gac
                            where cgacacc = a.cACCacc
                              and cgaccur = a.cACCcur
                              and igaccat = 112
                              and igacnum = 97
                              and exists (select 1
                                            from xxi.au_attach_obg au
                                           where au.caccacc = a.caccacc
                                             and au.CACCCUR = a.cacccur
                                             and au.i_table = 304
                                             and trunc(d_create) <= d2
                                              and c_newdata ='112/97'))
                --<< 25.06.2018 Пинаев Д.Е. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)

 -->> Ubrr Маkarova L.U. Торговый,условия отбора док-тов, для взимания комиссии
               --and a.iaccotd in ()
               --and a.iaccotd in (select iotdnum from "otd" where idsmr = ...)
               and not exists (select 1
                                 from gac
                                where cgacacc = a.cACCacc
                                  and igaccat = 333
                                  and igacnum = 2)
              ---<<<UBRR Pashevich A. #12-508
       -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
       and not exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                     UBRR_UNIQUE_ACC_COMMS uuac 
                               where caccacc = uutc.cacc 
                                 and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF 
                                 and lc_idsmr = uutc.idsmr 
                                 and uutc.status = 'N'
                                 and uutc.uuta_id = uuac.uuta_id
                                 and uuac.com_type in ('RKBP','RKBK','RKO')
                       )       
       --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
           group by ctrnaccd,ctrncur,iACCotd
UNION all
            /*select /*+ index( trn I_TRN_ACCC_CURC_DTRN_TYPE )*/
                  -- ctrnaccc acc, ctrncur, count(1) c, iaccotd, 0 cd, 0 md, count(1) cc, sum(mtrnsum) mc, caccmail
                      select /*+ index( trn I_TRN_OLD_NEW_ACDT )*/ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                   ctrnaccc acc,ctrncur,count(1) c,iaccotd,0 cd,0 md,count(1) cc,sum(mtrnsum) mc
         from acc a,
                 ubrr_trn_old_new_v trn --xxi.V_TRN_PART_CURRENT -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
            where
            -- ubrr katyuhin >>>
                  a.caccacc LIKE acc_1
              and a.cacccur = 'RUR'
              and a.caccprizn <> 'З'
              and a.iaccbs2 NOT IN (40813,40817,40818,40820
                                     -- UBRR Pashevich A. 12-101
                                     ,42309,40810,40811,40812,40823,40824 -->><<-- ubrr 12.07.2016 Арсланов Д.Ф. #30780
                                     -- UBRR Pashevich A. 12-101
                                     )
              and substr(a.caccacc,14,1) <> '4'
              and substr(a.caccacc,1,3) not in ('401','402','403','404','409')
              and a.caccacc like acc_1 -->><<-- ubrr 22.06.2016 Арсланов Д.Ф. 16-2014 #31081 Здесь было почему-то без учета возможной заданной маски
              AND a.caccacc NOT LIKE '40821________7%' -- 29/12/2011 Бездворный А.В. комиссии по 40821 (контрагенты) по РКО не считаем
              and substr(trn.ctrnaccd,1,5) not in ('47426', '70606')
-->> Ubrr Маkarova L.U. [15-1101] АБС: ТП Эквайринг для НТК ТОЛЬКО СУД! -утратил силу
       -->>22.01.2016 Ubrr Маkarova L.U. [15-1644]
             /* and exists    (select /*+ index( t I_TRN_ACCD_CUR_DTRN_TYPE )
                                           1
                                      from xxi.V_TRN_PART_CURRENT t
                                     where t.ctrnaccd = trn.ctrnaccd
                                       and t.ctrncur = trn.ctrncur
                                       and dtrntran between d1 and d2+86399/86400
                                       and itrnsop=4)    */
 -->>22.01.2016 Ubrr Маkarova L.U. [15-1644]
            -- ubrr katyuhin <<<
              and trn.ctrnaccc = a.caccacc
              and trn.ctrncurc = a.cacccur
              and trn.dtrntran between d1 and d2+86399/86400
              -->> 20.09.2017 ubrr korolkov 15-1436
              and not (ctrnaccd like '30232%' and lower(replace(ctrnpurp, ' ')) like 'возм%термин%')
              --<< 20.09.2017 ubrr korolkov 15-1436
              and trn.itrntype in (-7, 2, 5, 10, 12, 51, 53, 55)
              and not (trn.itrntype=4 and trn.itrnsop=51 and trn.ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
              and substr(nvl(trn.ctrnacca,0),1,5) not in ('47426', '70606')
                -->> 25.06.2018 Пинаев Д.Е. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)
                and not exists (select 1
                             from gac
                            where cgacacc = a.cACCacc
                              and cgaccur = a.cACCcur
                              and igaccat = 112
                              and igacnum = 97
                              and exists (select 1
                                            from xxi.au_attach_obg au
                                           where au.caccacc = a.caccacc
                                             and au.CACCCUR = a.cacccur
                                             and au.i_table = 304
                                             and trunc(d_create) <= d2
                                              and c_newdata ='112/97'))
                --<< 25.06.2018 Пинаев Д.Е. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)

-- Ubrr Pashevich A. 12-1531
              and not exists (select 1
                                from sbs
                               where csbsdo like 'RK%'
                                 and csbsacc=a.caccacc)
 and not exists (select 1
                                 from sbs
                                where csbsdo like 'R_Onl_Min%'
                                  and csbsacc = a.caccacc)
 and not exists (select 1
                                 from sbs
                                where csbsdo like 'R_EKV%'
                                  and csbsacc = a.caccacc)
 and   exists (select 1
                          from gac g
                           where     cgacacc = a.cACCacc
                                 and cgaccur = a.cACCcur
                                 and igaccat = 112
                                 and igacnum = 92
                                 and exists (select 1
                                              from xxi.au_attach_obg au
                                               where     au.caccacc = a.cACCacc
                                                     and au.cacccur = a.cACCcur
                                                     and i_table = 304
                                                     and d_create<=d2 and au.c_newdata = '112/92'))
 -- АБС: ТП Онлайн + только для БТП
  -->> ubrr 22.06.2016 Арсланов Д.Ф. 16-2014 #31081 Закомментарил. Для НТК тоже расчитываем. Потом поменяем суммы. Так быстрее, чем 2 раза делать выборки
    /*and not exists (select 1
                     from gac
                    where cgacacc = a.cACCacc
                      and cgaccur = a.cACCcur
                      and igaccat = 131
                      and exists (select 1
                                    from xxi.au_attach_obg au
                                   where au.caccacc = a.cACCacc
                                     and au.cacccur = a.cACCcur
                                     and i_table = 304
                                     and d_create <= d2
                                   and au.c_newdata like '131%'))*/
  --<< ubrr 22.06.2016 Арсланов Д.Ф. 16-2014 #31081 Закомментарил.

              and exists (select 1
                            from gac
                           where cgacacc = a.caccacc
                             and cgaccur = a.cacccur
                             and igaccat = 105
                             and igacnum in (1,2,8,9,
-- Ubrr Pashevich A. 12-1530
                                             11
-- Ubrr Pashevich A. 12-1530
))
   and not exists (select 1
                                 from gac
                                where cgacacc = a.cACCacc
                                  and igaccat = 333
                                  and igacnum = 2)

            -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ 
            and not exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                          UBRR_UNIQUE_ACC_COMMS uuac 
                               where a.caccacc = uutc.cacc 
                                 and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF 
                                 and lc_idsmr = uutc.idsmr 
                                 and uutc.status = 'N'
                                 and uutc.uuta_id = uuac.uuta_id
                                 and uuac.com_type in ('RKBP','RKBK','RKO')
                             )  
            --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
    group by ctrnaccc,ctrncur,iACCotd
)
group by acc,ctrncur,iaccotd);
-->> ubrr 22.06.2016 Арсланов Д.Ф. 16-2014 #31081 Для НТК поменяем сумму
update sbs
  -- set mSBStoll_sum = 800
   set mSBStoll_sum = 850  ---  17.01.2017 Галиева Н.А распоряжение  от 19.12.2016 № 7006-2096
 where cSBSdo = 'R_Onl_Base'
   and exists (select 1
                 from gac
                where cgacacc = cSBSacc
                  and cgaccur = cSBScur
                  and igaccat = 131
                  and exists (select 1
                                from xxi.au_attach_obg au
                               where au.caccacc = cSBSacc
                                 and au.cacccur = cSBScur
                                 and i_table = 304
                                 and d_create <= d2
                                 and au.c_newdata like '131%')
   -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
   and not exists ( select 1
                      from gac
                     where cgacacc = cSBSacc
                       and cgaccur = cSBScur
                       and igaccat = 112
                       and igacnum = 107
                       and exists (select 1
                                     from xxi.au_attach_obg au
                                    where au.caccacc = cSBSacc
                                      and au.cacccur = cSBScur
                                      and au.i_table = 304
                                      and d_create <= d2
                                      and au.c_newdata = '112/107'
                                  )
                  )
   --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
              );
--<< ubrr 22.06.2016 Арсланов Д.Ф. 16-2014 #31081 Для НТК поменяем сумму
DBMS_TRANSACTION.COMMIT;

----------------------------------------------------------------------------------------------------------------------------
-->> 07.09.2016 ubrr Maкарова Л.Ю. 16-2451 АБС: Пакет услуг Светофор в БТП и НТК, БЕЗ ОБОРОТОВ
INSERT INTO SBS
   ( cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, cSBSdo ,iSBSdebdoc,mSBSdebob,iSBScreddoc,mSBScredob)
   (select to_char(sysdate,'HH24:MI:SS'), caccacc, cacccur, 500,'R_Traf', 0,0,0,0 from acc
   where
   acc.caccacc LIKE acc_1
   and acc.cacccur = 'RUR'
   and acc.caccprizn <> 'З'
and acc.iaccbs2 NOT IN (40813, 40817, 40818, 40820
                                      -- UBRR Pashevich A. 12-101
                                      ,42309,40810,40811,40812,40823,40824 -->><<-- ubrr 12.07.2016 Арсланов Д.Ф. #30780
                                      -- UBRR Pashevich A. 12-101
                                      )
 and exists (SELECT 1
                      FROM gac
                     WHERE cgacacc = caccacc
                           AND cgaccur = cacccur
                           AND igaccat = 105
                           AND igacnum = 11 --только ИБ-light
                           )
   and   exists (select 1
                          from gac g
                           where     cgacacc = acc.cACCacc
                                 and cgaccur = acc.cACCcur
                                 and igaccat = 114
                                 and igacnum = 12
                                 and exists (select 1
                                              from xxi.au_attach_obg au
                                               where     au.caccacc = acc.cACCacc
                                                     and au.cacccur = acc.cACCcur
                                                     and i_table = 304
                                                     and d_create<=d2 and au.c_newdata = '114/12'))
             -- АБС: ТП Онлайн + только для БТП
  -->> ubrr 22.06.2016 Арсланов Д.Ф. 16-2014 #31081 Закомментарил. Для НТК тоже расчитываем. Потом поменяем суммы. Так быстрее, чем 2 раза делать выборки
  /*and not exists (select 1
                     from gac
                    where cgacacc = cACCacc
                      and cgaccur = cACCcur
                      and igaccat = 131
                      and exists (select 1
                                    from xxi.au_attach_obg au
                                   where au.caccacc = acc.cACCacc
                                     and au.cacccur = acc.cACCcur
                                     and i_table = 304
                                     and d_create <= d2
                                   and au.c_newdata like '131%'))*/
  --<< ubrr 22.06.2016 Арсланов Д.Ф. 16-2014 #31081 Закомментарил.
  and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 333
                                  and igacnum = 2)
  -->>03.02.2020 Баязитов [19-69558.2] Двойное взимание комиссий по светофору
  -->><<--06.02.2020 Баязитов [19-69558.2] Ошибка #71284. Откат доработки https://redmine.lan.ubrr.ru/issues/71284#note-3
  /*AND      exists(
             select \*+ index( trn I_TRN_OLD_NEW_ADT )*\ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                    \*ctrnaccd acc,ctrncur,count(1) c,iaccotd,count(1) cd,sum(mtrnsum) md ,0 cc,0 mc, caccmail*\
                    1
             from acc,
                  ubrr_trn_old_new_v trn --xxi.V_TRN_PART_CURRENT  -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
             where
               -- ubrr katyuhin >>>
                   acc.caccacc LIKE acc_1
               and acc.cacccur = 'RUR'
               and acc.caccprizn <> 'З'
               and exists (SELECT 1
                      FROM gac
                     WHERE cgacacc = cTRNaccd
                           AND cgaccur = ctrncur
                           AND igaccat = 105
                           AND igacnum = 11
                           )
   and   exists (select 1
                          from gac g
                           where     cgacacc = acc.cACCacc
                                 and cgaccur = acc.cACCcur
                                 and igaccat = 114
                                 and igacnum = 12
                                 and exists (select 1
                                              from xxi.au_attach_obg au
                                               where     au.caccacc = acc.cACCacc
                                                     and au.cacccur = acc.cACCcur
                                                     and i_table = 304
                                                     and d_create<=d2 and au.c_newdata = '114/12'))
               and acc.iaccbs2 NOT IN (40813, 40817, 40818, 40820
                                      -- UBRR Pashevich A. 12-101
                                      ,42309,40810,40811,40812,40823,40824 -->><<-- ubrr 12.07.2016 Арсланов Д.Ф. #30780
                                      -- UBRR Pashevich A. 12-101
                                      )

           \*    and  not exists
                 (select 1 from xxi.V_TRN_PART_CURRENT trn where
                    (
                       (trn.ctrnaccD = acc.cACCacc  and     substr(nvl(trn.ctrnacca,0),1,2) not like '70%')
                          or  ((trn.ctrnaccC = acc.cACCacc) and substr(trn.ctrnaccd,1,5) not in ('47426', '70606'))

                    )
                        and trn.ctrncur = acc.cACCcur
                    and dtrntran between d1 and d2+86399/86400
                  )*\

              and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 333
                                  and igacnum = 2)
   group by ctrnaccd,ctrncur,iACCotd, caccmail
)*/
--<<03.02.2020 Баязитов [19-69558.2] Двойное взимание комиссий по светофору
);
DBMS_TRANSACTION.COMMIT;
--<<07.09.2016 ubrr Maкарова Л.Ю. 16-2451 АБС: Пакет услуг Светофор в БТП и НТК

----------------------------------------------------------------------------------------------------------------------------
--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. R_ONL_MIN --БЕЗ ОБОРОТОВ
INSERT INTO SBS
   ( cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, cSBSdo ,iSBSdebdoc,mSBSdebob,iSBScreddoc,mSBScredob)
   (select to_char(sysdate,'HH24:MI:SS'), caccacc, cacccur, 400,'R_Onl_Min', 0,0,0,0 from acc
   where
   acc.caccacc LIKE acc_1
   and acc.cacccur = 'RUR'
   and acc.caccprizn <> 'З'
and acc.iaccbs2 NOT IN (40813, 40817, 40818, 40820
                                      -- UBRR Pashevich A. 12-101
                                      ,42309,40810,40811,40812,40823,40824 -->><<-- ubrr 12.07.2016 Арсланов Д.Ф. #30780
                                      -- UBRR Pashevich A. 12-101
                                      )
 and exists (SELECT 1
                      FROM gac
                     WHERE cgacacc = caccacc
                           AND cgaccur = cacccur
                           AND igaccat = 105
                           --AND igacnum = 2
                           )
   and   exists (select 1
                          from gac g
                           where     cgacacc = acc.cACCacc
                                 and cgaccur = acc.cACCcur
                                 and igaccat = 112
                                 and igacnum = 92
                                 and exists (select 1
                                              from xxi.au_attach_obg au
                                               where     au.caccacc = acc.cACCacc
                                                     and au.cacccur = acc.cACCcur
                                                     and i_table = 304
                                                     and d_create<=d2 and au.c_newdata = '112/92'))
             -- АБС: ТП Онлайн + только для БТП
  -->> ubrr 22.06.2016 Арсланов Д.Ф. 16-2014 #31081 Закомментарил. Для НТК тоже расчитываем. Потом поменяем суммы. Так быстрее, чем 2 раза делать выборки
  /*and not exists (select 1
                     from gac
                    where cgacacc = cACCacc
                      and cgaccur = cACCcur
                      and igaccat = 131
                      and exists (select 1
                                    from xxi.au_attach_obg au
                                   where au.caccacc = acc.cACCacc
                                     and au.cacccur = acc.cACCcur
                                     and i_table = 304
                                     and d_create <= d2
                                   and au.c_newdata like '131%'))*/
  --<< ubrr 22.06.2016 Арсланов Д.Ф. 16-2014 #31081 Закомментарил.
                -->> 25.06.2018 Пинаев Д.Е. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)
                and not exists (select 1
                             from gac
                            where cgacacc = acc.cACCacc
                              and cgaccur = acc.cACCcur
                              and igaccat = 112
                              and igacnum = 97
                              and exists (select 1
                                            from xxi.au_attach_obg au
                                           where au.caccacc = acc.caccacc
                                             and au.CACCCUR = acc.cacccur
                                             and au.i_table = 304
                                             and trunc(d_create) <= d2
                                              and c_newdata ='112/97'))
                --<< 25.06.2018 Пинаев Д.Е. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)

and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 333
                                  and igacnum = 2)
  and not exists (select 1
                                 from sbs
                                where csbsdo like 'RK%'
                                  and csbsacc = acc.caccacc)
 and not exists (select 1
                                 from sbs
                                where csbsdo like 'R_Onl_Base%'
                                  and csbsacc = acc.caccacc)
 and not exists (select 1
                                 from sbs
                                where csbsdo like 'R_EKV%'
                                  and csbsacc = acc.caccacc)
AND      exists(
             select /*+ index( trn I_TRN_OLD_NEW_ADT )*/ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                    /*ctrnaccd acc,ctrncur,count(1) c,iaccotd,count(1) cd,sum(mtrnsum) md ,0 cc,0 mc, caccmail*/
                    1
             from acc,
                  ubrr_trn_old_new_v trn --xxi.V_TRN_PART_CURRENT -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
             where
               -- ubrr katyuhin >>>
                   acc.caccacc LIKE acc_1
               and acc.cacccur = 'RUR'
               and acc.caccprizn <> 'З'
               and not (itrntype=4 and itrnsop=51 and ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
               and exists (SELECT 1
                      FROM gac
                     WHERE cgacacc = cTRNaccd
                           AND cgaccur = ctrncur
                           AND igaccat = 105
                           --AND igacnum = 2
                           )

                 and   exists (select 1
                          from gac g
                           where     cgacacc = acc.cACCacc
                                 and cgaccur = acc.cACCcur
                                 and igaccat = 112
                                 and igacnum = 92
                                 and exists (select 1
                                              from xxi.au_attach_obg au
                                               where     au.caccacc = acc.cACCacc
                                                     and au.cacccur = acc.cACCcur
                                                     and i_table = 304
                                                     and d_create<=d2 and au.c_newdata = '112/92'))
               and acc.iaccbs2 NOT IN (40813, 40817, 40818, 40820
                                      -- UBRR Pashevich A. 12-101
                                      ,42309,40810,40811,40812,40823,40824 -->><<-- ubrr 12.07.2016 Арсланов Д.Ф. #30780
                                      -- UBRR Pashevich A. 12-101
                                      )

               and  not exists
                 (select 1 from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v trn where -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                    (
                       (trn.ctrnaccD = acc.cACCacc  and     substr(nvl(trn.ctrnacca,0),1,2) not like '70%')
                          or  ((trn.ctrnaccC = acc.cACCacc) and substr(trn.ctrnaccd,1,5) not in ('47426', '70606'))

                    )
                        and trn.ctrncur = acc.cACCcur
                    and dtrntran between d1 and d2+86399/86400
                  )

              and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 333
                                  and igacnum = 2)

                and not exists (select 1
                                from gac
                                where cgacacc = acc.cACCacc
                                and cgaccur = acc.cACCcur
                                and igaccat = 112
                                and igacnum in (78,79,80,
                                99,100,101,102,103, --27.12.2018 Баязитов [15-43]
                                104,105,106,        -- Бизнес  Премиум  3, 6, 12  -- ubrr 31.05.2019 Ризанов Р.Т. [19-59153] АБС. Лимит платежей в пакеты услуг "Бизнес-Класс 3,6,12"
                                94, -- 24.09.2016 ubrr Maкарова Л.Ю. 16-2653 АБС: Кат/гр 112/94 для пакета услуг "Бизнес-комплект"
                                57,71)--29.06.2015  Макарова Л.Ю.       [15-613] ТП Муниципальный-1
                                and exists (select 1
                                            from xxi.au_attach_obg au
                                            where au.caccacc = acc.cACCacc
                                            and au.cacccur = acc.cACCcur
                                            and i_table = 304
                                            and trunc(d_create) <= d2
                                            and au.c_newdata like '112/'||to_char(gac.igacnum)))
-->> 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
                and not exists (select 1
                                 from gac
                                 where cgacacc = acc.cACCacc
                                   and cgaccur = acc.cACCcur
                                   and igaccat = 114
                                   and igacnum = 16)
--<< 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
  -->> ubrr 22.06.2016 Арсланов Д.Ф. 16-2014 #31081 Закомментарил. Для НТК тоже расчитываем. Потом поменяем суммы. Так быстрее, чем 2 раза делать выборки
  /*and not exists (select 1
                          from gac
                         where cgacacc = acc.cACCacc
                           and cgaccur = acc.cACCcur
                           and igaccat = 131
                           and exists (select 1
                                         from xxi.au_attach_obg au
                                        where au.caccacc = acc.cACCacc
                                          and au.cacccur = acc.cACCcur
                                          and i_table = 304
                                          and d_create <= d2
                                          and au.c_newdata like '131%'))*/
  --<< ubrr 22.06.2016 Арсланов Д.Ф. 16-2014 #31081 Закомментарил.
-->> UBRR Макарова Л.Ю. 15-42 доп.треб. https://redmine.lan.ubrr.ru/issues/19917#note-36
-->> UBRR Макарова Л.Ю. 15-279
    and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =acc.CACCACC  and cacccur = acc.CACCCUR
                                  and c_newdata = cg_112_75
                                  and d1 between trunc(d_create,'mm') and last_day(add_months (d_create,5))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum =75
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = cg_112_75
                                                        and a2.d_create>last_day(add_months (a1.d_create,5))
                                                )
                         )

               and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum in (6,8,67,1018) -- 07.02.2019 Ризанов Р.Т. [18-58411] АБС: ТП "Промо" в режиме "Эконом"
                                  and exists (select 1
                                                from xxi.au_attach_obg au
                                               where au.caccacc = acc.caccacc --cgacacc
                                                 and au.cacccur = acc.cacccur --cgaccur
                                                 and trunc(au.d_create) <= d2
                                                 and ( c_newdata ='112/6' or c_newdata ='112/8' or c_newdata ='112/67' or c_newdata ='112/1018') -- 07.02.2019 Ризанов Р.Т. [18-58411] АБС: ТП "Промо" в режиме "Эконом"
                                             ))
  and not exists (select 1
                                 from sbs
                                where csbsdo like 'RK%'
                                  and csbsacc = acc.caccacc)
 and not exists (select 1
                                 from sbs
                                where csbsdo like 'R_Onl_Base%'
                                  and csbsacc = acc.caccacc)
 and not exists (select 1
                                 from sbs
                                where csbsdo like 'R_EKV%'
                                  and csbsacc = acc.caccacc)

            group by ctrnaccd,ctrncur,iACCotd, caccmail

)
);
/*group by acc,ctrncur,iaccotd, caccmail);*/
-->> ubrr 22.06.2016 Арсланов Д.Ф. 16-2014 #31081 Для НТК поменяем сумму. Пока сумма та же, что и была, но код вставим на будущее
update sbs
   set mSBStoll_sum = 400
 where cSBSdo = 'R_Onl_Min'
   and exists (select 1
                 from gac
                where cgacacc = cSBSacc
                  and cgaccur = cSBScur
                  and igaccat = 131
                  and exists (select 1
                                from xxi.au_attach_obg au
                               where au.caccacc = cSBSacc
                                 and au.cacccur = cSBScur
                                 and i_table = 304
                                 and d_create <= d2
                                 and au.c_newdata like '131%')
   -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
   and not exists ( select 1
                      from gac
                     where cgacacc = cSBSacc
                       and cgaccur = cSBScur
                       and igaccat = 112
                       and igacnum = 107
                       and exists (select 1
                                     from xxi.au_attach_obg au
                                    where au.caccacc = cSBSacc
                                      and au.cacccur = cSBScur
                                      and au.i_table = 304
                                      and d_create <= d2
                                      and au.c_newdata = '112/107'
                                  )
                  )
   --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
              );
--<< ubrr 22.06.2016 Арсланов Д.Ф. 16-2014 #31081 Для НТК поменяем сумму
DBMS_TRANSACTION.COMMIT;
--<<--ubrr 11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю.


----------------------------------------------------------------------------------------------------------------------------
/* UBRR Pashevich A. #12-508
   Межбанковский платеж -- на бумажном носителе
                        -- крупные клиенты
*/
  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif := 'Y';          --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)
  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif_id_check := 'N'; --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)

  INSERT INTO SBS
  (cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, cSBSdo, mSBScomm ,iSBSdebdoc,msbsdebob)
  (select to_char(sysdate,'HH24:MI:SS'), ctrnaccd , ctrncur,
          count(1) * ubrr_xxi5.UBRR_UNIQ_ACC_SUM(ctrnaccd,ctrncur,iaccotd,d1,'PP9',sum(mtrnsum),0), -- 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ 
          'PP9',
          ubrr_xxi5.UBRR_UNIQ_ACC_SUM(ctrnaccd,ctrncur,iaccotd,d1,'PP9',sum(mtrnsum),0), -- 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ 
          count(1),
          sum(mtrnsum) --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)
     from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v, acc a -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
    where ctrnaccd like acc_1
      and ctrncur = 'RUR'
      and dtrntran between d1 and d2 + 86399/86400
      and (   (    itrntype in (4,11,15,21,22,23)
                and not (   -->> 20.12.2013 ubrr korolkov 12-2288 (#11418)
--                            itrnpriority in (3,4,5) and -- 01.09.2017 Макарова Л.Ю. [17-847] АБС: Некорректное списание комиссии за налоговые платежи # 46295
                            --<< 20.12.2013 ubrr korolkov 12-2288 (#11418)
                          substr(ctrnacca,1,3) in ('401', '402', '403', '404')
                         and exists (select 1
                                       from trn_dept_info
                                      where inum = itrnnum
                                        and ianum = itrnanum
                                        and ccreatstatus is not null))
               )
           /*or (    itrntype = 23
               and itrnpriority not in (3,4,5))*/ -- 20.12.2013 ubrr korolkov 12-2288 (#11418)
            )
  -->> ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
         and not (itrntype = 22 and regexp_like(ctrnpurp, '^ *(|! *)0406')
                  and exists (select 1 from xxi."smr" where csmrmfo8 = ctrnmfoa))
         --<< ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
        and not (itrntype=4 and itrnsop=51 and ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
        and nvl(iTRNsop,0) <> 4
        and ctrnmfoa not in (select cfilmfo from xxi."fil" where idsmr = ubrr_xxi5.ubrr_util.GetBankIdSmr) -- наши филиалы -> внутрибанк  -->><<-- ubrr Арсланов Д.Ф. #29736 Доработки по РКО для ВУЗ
        and iTRNba2d not in (40813,40817,40818,40820
                            -- UBRR Pashevich A. 12-101
                            ,42309,40810,40811,40812,40823,40824 -->><<-- ubrr 12.07.2016 Арсланов Д.Ф. #30780
                            -- UBRR Pashevich A. 12-101
                            )
        and cACCacc = cTRNaccd
        and cACCcur = cTRNcur
        and cACCprizn <> 'З'
        and substr(caccacc,1,3) not in ('401','402','403','404','409')
        and substr(to_char(itrnbatnum),3) not in ('10','13')
        -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
        and exists (select 1
                      from UBRR_UNIQUE_TARIF_ACC uutc,
                           UBRR_UNIQUE_ACC_COMMS uuac
                     where ctrnaccd = uutc.cacc
                       and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF
                       and lc_idsmr = uutc.idsmr
                       and uutc.status = 'N'
                       and uutc.uuta_id = uuac.uuta_id
                       and uuac.daily = 'N'
                       and uuac.com_type = 'PP9') 
        --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
        -->> 26.05.2015 ubrr korolkov 15-453
        and not exists (select 1
                        from gac
                        where cgacacc = a.cACCacc
                        and cgaccur = a.cACCcur
                        and igaccat = 112
                        and igacnum in (78,79,80,
                        99,100,101,102,103, --27.12.2018 Баязитов [15-43]
                        104,105,106,        -- Бизнес  Премиум  3, 6, 12  -- ubrr 31.05.2019 Ризанов Р.Т. [19-59153] АБС. Лимит платежей в пакеты услуг "Бизнес-Класс 3,6,12"
                        94)--24.09.2016 ubrr Maкарова Л.Ю. 16-2653 АБС: Кат/гр 112/94 для пакета услуг "Бизнес-комплект"
                        and exists (select 1
                                    from xxi.au_attach_obg au
                                    where au.caccacc = a.cACCacc
                                    and au.cacccur = a.cACCcur
                                    and i_table = 304
                                    and trunc(d_create) <= d2
                                    and au.c_newdata like '112/'||to_char(gac.igacnum)))
        --<< 26.05.2015 ubrr korolkov 15-453
-->> 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
               and not exists (select 1
                                 from gac
                                 where cgacacc = a.cACCacc
                                   and cgaccur = a.cACCcur
                                   and igaccat = 114
                                   and igacnum = 16)
--<< 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
      group by ctrnaccd,ctrncur,iACCotd
);

  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif := 'N';          --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)
  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif_id_check := 'Y'; --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)

DBMS_TRANSACTION.COMMIT;



----------------------------------------------------------------------------------------------------------------------------
-- UBRR Pashevich AO 14-959
--межбанк для пользователей Клиент-Банка (платеж проведен по Клиент-Банку)
/*
Межбанковский платеж
-в электронном виде
 */
   Insert Into SBS
   ( cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, cSBSdo, mSBScomm ,iSBSdebdoc)
   -->> UBRR Pashevich AO 14-1344 переходим на лимиты за день
    Select to_char(sysdate,'HH24:MI:SS'), ctrnaccd,ctrncur, sum(mSBStoll_sum),csbsdo  , sum(msbscomm)  , sum(iSBSdebdoc)
    From
    (
    select ctrnaccd ,ctrncur,
           ubrr_rko.F_GetComSum( p_com => 'PP6_App',
                                 p_otd => iACCotd,
                                 p_countpay => sum(case when (quickly_pay=1 and substr (ctrnpurp,1,1)='!') or (quickly_pay=0 and substr (ctrnpurp,1,1)<>'!') or quickly_pay=3 then 1 else 0 end),
                                 p_quickly_pay=>quickly_pay) mSBStoll_sum,
           'PP6_App_'||substr(quickly_pay,1,1) cSBSdo,
           ubrr_rko.F_GetComSum( p_com      => 'PP6_App' ,
                                 p_otd      => iACCotd   ,
                                 p_countpay => sum(case when (quickly_pay=1 and substr (ctrnpurp,1,1)='!') or (quickly_pay=0 and substr (ctrnpurp,1,1)<>'!') or quickly_pay=3 then 1 else 0 end ),
                                 p_quickly_pay=>quickly_pay) mSBScomm,
            sum(case when (quickly_pay=1 and substr (ctrnpurp,1,1)='!') or (quickly_pay=0 and substr (ctrnpurp,1,1)<>'!') or quickly_pay=3 then 1 else 0 end ) iSBSdebdoc
      from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v, acc a, ubrr_rko_comms c -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
      where ctrnaccd like acc_1
       and ctrncur = 'RUR'
       and dtrntran between d1 and d2+86399/86400
       and (   (    itrntype in (4,11,15,21,22,23)
                and not (  -- itrnpriority in (3,4,5)and -- 01.09.2017 Макарова Л.Ю. [17-847] АБС: Некорректное списание комиссии за налоговые платежи # 46295
                          substr(ctrnacca,1,3) in ('401', '402', '403', '404')
                         and exists (select 1
                                       from trn_dept_info
                                      where inum = itrnnum
                                        and ianum = itrnanum
                                        and ccreatstatus is not null))
               )
            )
        and not (itrntype=4 and itrnsop=51 and ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
  -->> ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
         and not (itrntype = 22 and regexp_like(ctrnpurp, '^ *(|! *)0406')
                  and exists (select 1 from xxi."smr" where csmrmfo8 = ctrnmfoa))
         --<< ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
        and itrnsop = 4
        and ctrnmfoa not in (select cfilmfo from xxi."fil" where idsmr = ubrr_xxi5.ubrr_util.GetBankIdSmr) -- наши филиалы -> внутрибанк  -->><<-- ubrr Арсланов Д.Ф. #29736 Доработки по РКО для ВУЗ
        and iTRNba2d not in (40813,40817,40818,40820,42309
                            ,40810,40811,40812,40823,40824 -->><<-- ubrr 12.07.2016 Арсланов Д.Ф. #30780
                            )
        and cACCacc = cTRNaccd
        and cACCcur = cTRNcur
        and cACCprizn <>'З'
        and substr(caccacc,1,3) not in ('401','402','403','404','409')
        and substr(to_char(itrnbatnum),3) not in ('10','13')
-- >>MakarovaLU 14-959 аудит уст. кат. Яблоко
       and exists (select 1
                          from gac
                         where cgacacc = cACCacc
                           and cgaccur = cACCcur
                           and igaccat = 112
                           and igacnum = 70
                           and exists (select 1
                                        from xxi.au_attach_obg au
                                       where au.caccacc = gac.CGACACC
                                         and au.cacccur = gac.CGACCUR
                                         and i_table = 304
                                         and d_create <= d2
                                         and au.c_newdata like '112/70'))
-- >>MakarovaLU 14-959 аудит уст. кат. Яблоко
        and not exists (select 1
                          from gac
                         where cgacacc = a.cACCacc
                           and cgaccur = a.cACCcur
                           and igaccat = 131
                           and exists (select 1
                                        from xxi.au_attach_obg au
                                       where au.caccacc = a.cACCacc
                                         and au.cacccur = a.cACCcur
                                         and i_table = 304
                                         and d_create <= d2
                                         and au.c_newdata like '131%'))
        -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
        and not exists (select 1
                        from UBRR_UNIQUE_TARIF_ACC uutc,
                             UBRR_UNIQUE_ACC_COMMS uuac
                        where ctrnaccd = uutc.cacc
                        and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF
                        and lc_idsmr = uutc.idsmr
                        and uutc.status = 'N'
                        and uutc.uuta_id = uuac.uuta_id
                        and uuac.daily = 'N'
                        and uuac.com_type ='PP6'
                        )  
        --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
        -->> 26.05.2015 ubrr korolkov 15-453
        and not exists (select 1
                        from gac
                        where cgacacc = a.cACCacc
                        and cgaccur = a.cACCcur
                        and igaccat = 112
                        and igacnum in (78,79,80,
                                        99,100,101,102,103, --27.12.2018 Баязитов [15-43]
                                        104,105,106,        -- Бизнес  Премиум  3, 6, 12  -- ubrr 31.05.2019 Ризанов Р.Т. [19-59153] АБС. Лимит платежей в пакеты услуг "Бизнес-Класс 3,6,12"
                                        94)--24.09.2016 ubrr Maкарова Л.Ю. 16-2653 АБС: Кат/гр 112/94 для пакета услуг "Бизнес-комплект"
                        and exists (select 1
                                    from xxi.au_attach_obg au
                                    where au.caccacc = a.cACCacc
                                    and au.cacccur = a.cACCcur
                                    and i_table = 304
                                    and trunc(d_create) <= d2
                                    and au.c_newdata like '112/'||to_char(gac.igacnum)))
        --<< 26.05.2015 ubrr korolkov 15-453
-->> 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
               and not exists (select 1
                                 from gac
                                 where cgacacc = a.cACCacc
                                   and cgaccur = a.cACCcur
                                   and igaccat = 114
                                   and igacnum = 16)
--<< 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
       and c.com_code like 'PP6_App%' and c.count_pay=999999
group by ctrnaccd,ctrncur,iACCotd,quickly_pay,
         DTRNCREATE
 having sum(case when (quickly_pay=1 and substr (ctrnpurp,1,1)='!') or (quickly_pay=0 and substr (ctrnpurp,1,1)<>'!') or quickly_pay=3 then 1 else 0 end )>0
--<< UBRR Pashevich AO 14-1344
 )
group By ctrnaccd,ctrncur, csbsdo ;
DBMS_TRANSACTION.COMMIT;
-- UBRR Pashevich AO 14-959



----------------------------------------------------------------------------------------------------------------------------
/* UBRR Pashevich A. №12-508
   Межбанковский платеж
   - в электронном виде
   - крупные клиенты
*/

  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif := 'Y';          --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)
  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif_id_check := 'N'; --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)

    INSERT INTO SBS
        (cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, cSBSdo, mSBScomm ,iSBSdebdoc,msbsdebob)
    (select to_char(sysdate,'HH24:MI:SS'), ctrnaccd ,ctrncur,
            count(1)*ubrr_xxi5.UBRR_UNIQ_ACC_SUM(ctrnaccd,ctrncur,iaccotd,d1,'PP6',sum(mtrnsum),0),  -- 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
            'PP6',ubrr_xxi5.UBRR_UNIQ_ACC_SUM(ctrnaccd,ctrncur,iaccotd,d1,'PP6',sum(mtrnsum),0),  -- 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
            count(1),
            sum(mtrnsum) --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)
     from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v, acc a -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
     where ctrnaccd like acc_1
     and ctrncur = 'RUR'
     and dtrntran between d1 and d2+86399/86400
     and (   (    itrntype in (4,11,15,21,22,23)
                and not (   -->> 20.12.2013 ubrr korolkov 12-2288 (#11418)
                          --  itrnpriority in (3,4,5) and -- 01.09.2017 Макарова Л.Ю. [17-847] АБС: Некорректное списание комиссии за налоговые платежи # 46295
                            --<< 20.12.2013 ubrr korolkov 12-2288 (#11418)
                          substr(ctrnacca,1,3) in ('401', '402', '403', '404')
                         and exists (select 1
                                       from trn_dept_info
                                      where inum = itrnnum
                                        and ianum = itrnanum
                                        and ccreatstatus is not null))
               )
            /*or (    itrntype = 23
                and itrnpriority not in (3,4,5))*/ -- 20.12.2013 ubrr korolkov 12-2288 (#11418)
            )
  -->> ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
         and not (itrntype = 22 and regexp_like(ctrnpurp, '^ *(|! *)0406')
                  and exists (select 1 from xxi."smr" where csmrmfo8 = ctrnmfoa))
         --<< ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
        and not (itrntype=4 and itrnsop=51 and ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
        and itrnsop = 4
        and ctrnmfoa not in (select cfilmfo from xxi."fil" where idsmr = ubrr_xxi5.ubrr_util.GetBankIdSmr) -- наши филиалы -> внутрибанк  -->><<-- ubrr Арсланов Д.Ф. #29736 Доработки по РКО для ВУЗ
        and iTRNba2d not in (40813,40817,40818,40820
                            -- UBRR Pashevich A. 12-101
                             ,42309,40810,40811,40812,40823,40824 -->><<-- ubrr 12.07.2016 Арсланов Д.Ф. #30780
                             -- UBRR Pashevich A. 12-101
                            )
        and cACCacc = cTRNaccd
        and cACCcur = cTRNcur
        and cACCprizn <> 'З'
        and substr(caccacc,1,3) not in ('401','402','403','404','409')
        and substr(to_char(itrnbatnum),3) not in ('10','13')
        -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
        and exists (select 1
                      from UBRR_UNIQUE_TARIF_ACC uutc,
                           UBRR_UNIQUE_ACC_COMMS uuac
                     where ctrnaccd = uutc.cacc
                       and dtrntran between uutc.DOPENTARIF and uutc.DCANCELTARIF
                       and lc_idsmr = uutc.idsmr
                       and uutc.status = 'N'
                       and uutc.uuta_id = uuac.uuta_id
                       and uuac.daily = 'N'
                       and uuac.com_type = 'PP6')  
        --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
        -->> 26.05.2015 ubrr korolkov 15-453
        and not exists (select 1
                        from gac
                        where cgacacc = a.cACCacc
                        and cgaccur = a.cACCcur
                        and igaccat = 112
                        and igacnum in (78,79,80,
                        99,100,101,102,103, --27.12.2018 Баязитов [15-43]
                        104,105,106,        -- Бизнес  Премиум  3, 6, 12  -- ubrr 31.05.2019 Ризанов Р.Т. [19-59153] АБС. Лимит платежей в пакеты услуг "Бизнес-Класс 3,6,12"
                        94)--24.09.2016 ubrr Maкарова Л.Ю. 16-2653 АБС: Кат/гр 112/94 для пакета услуг "Бизнес-комплект"
                        and exists (select 1
                                    from xxi.au_attach_obg au
                                    where au.caccacc = a.cACCacc
                                    and au.cacccur = a.cACCcur
                                    and i_table = 304
                                    and trunc(d_create) <= d2
                                    and au.c_newdata like '112/'||to_char(gac.igacnum)))
        --<< 26.05.2015 ubrr korolkov 15-453
-->> 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
               and not exists (select 1
                                 from gac
                                 where cgacacc = a.cACCacc
                                   and cgaccur = a.cACCcur
                                   and igaccat = 114
                                   and igacnum = 16)
--<< 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
               -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
               and not exists ( select 1
                                        from gac g
                                            ,ubrr_rko_exinc_catgr e
                                       where g.igaccat   = e.icat
                                         and g.igacnum   = e.igrp
                                         and e.ccom_type = 'PP6'
                                         and e.exinc     = 0
                                         and g.cgacacc   = a.caccacc
                                         and g.cgaccur   = a.cACCcur
                                         and exists (select 1
                                                       from xxi.au_attach_obg au
                                                      where au.caccacc = a.caccacc
                                                        and au.cacccur = a.cacccur
                                                        and au.i_table = 304
                                                        and trunc(au.d_create) <= d2
                                                        and au.c_newdata = e.icat||'/'||e.igrp
                                                        and trunc(au.d_create) between nvl(e.date_start, dg_date_start) and nvl(e.date_end, dg_date_end) --<<22.01.2020 Баязитов [19-64846]
                                                    )
                              )
               --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
group by ctrnaccd,ctrncur,iACCotd
);

  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif := 'N';          --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)
  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif_id_check := 'Y'; --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)

DBMS_TRANSACTION.COMMIT;



------------------------------------------------------------------------------------------------------------------------------
-- плата за расчетное обслуживание --
-- 1)для не пользователей банк-клиента - RKO
/*
Ведение расчетного счета
- с использованием бумажной технологии
*/
   INSERT INTO SBS
   ( cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, cSBSdo,iSBSdebdoc,mSBSdebob,iSBScreddoc,mSBScredob )
   (select to_char(sysdate,'HH24:MI:SS'), acc,ctrncur,
          /*
           DECODE(iACCotd, 6264,1400,6452,1400,6487,1450,6440,1450,6245,1400,6204,1400,6935,1450,6112,1450,6473,1450,6301,1700,6303,1700,6302,1700,
                        6213,1700,6210,1700,6216,1700,6232,1700,6240,1700,6224,1700,6208,1700,6239,1700,6220,1700,6219,1700,6217,1700,6263,1700,
                        6269,1700,6932,1400,6428,1450,6472,1450,6489,1450,6237,1400,6257,1400,6205,1400,6482,1450,6106,1450,6412,1450,6409,1400,
                        6933,1450,6931,1400,6485,1400,6255,1450,6254,1400,6923,1400,6927,1400,6486,1450,6427,1450,6474,1400,6105,1500,6471,1450,
                        6253,1450,6445,1450,6201,1450,6248,1450,6250,1400,6115,1450,6464,1450,6483,1450,6925,1400,6926,1400,6921,1400,6479,1450,
                        6417,1450,6463,1400,6246,1400,6110,1450,6422,1450,6410,1450,6460,1450,6212,1400,6453,1400,6469,1450,6116,1500,6904,1500,
                        6442,1450,6930,1400,6922,1400,6242,1400,6418,1400,6265,1450,6222,1400,6231,1400,6470,1450,6478,1450,6261,1450,6480,1450,
                        6109,1450,6429,1450,6413,1450,6431,1450,6488,1450,6490,1450,6107,1450,6408,1450,6406,1450,6401,1450,6403,1450,6416,1450,
                        6937,1450,6938,1450,6939,1450,6941,1450,6948,1500,6963,1500,6967,1500,6950,1450,6951,1450,6952,1450,6953,1450,6954,1450,
                        6955,1450,6956,1450,6968,1450,6969,1450,6970,1450,6971,1450,6973,1450,6974,1400,6975,1450,6976,1450,6981,1400,6982,1450,
                        6983,1450,6984,1450,6985,1450,6986,1450,6988,1450,6989,1450,6990,1450,6991,1450,6992,1400,6993,1450,6994,1450,6995,1450,
                        6996,1400,6997,1450,6998,1450,6915,1450,6905,1450,6907,1400,6910,1400,6912,1450,6913,1450,6914,1450,6942,1450,6944,1450,                
                       1700  -- 11.03.2020 Ризанов Р.Т. [20-72291] Ошибка при взимании комиссии за ведение счёта со счетов НТК
                 ),  -- 13.08.2020 Карачев А.А. План мероприятий по переводу Кировский в ВСП*/
           DECODE(iACCotd, 6948,1700,6963,1700,6967,1700,6301,1900,6303,1900,6302,1900,6213,1900,6210,1900,6216,1900,6232,1900,6240,1900,6224,1900,6208,1900,
                        6239,1900,6220,1900,6219,1900,6217,1900,6263,1900,6269,1900,6913,1500,6915,1500,6933,1500,6986,1500,6950,1500,6951,1500,6955,1500,
                        6953,1500,6982,1500,6984,1500,6983,1500,6988,1500,6989,1500,6993,1500,6997,1500,6994,1500,6998,1500,6914,1500,6968,1500,6973,1500,
                        6971,1500,6969,1500,6970,1500,6975,1500,6937,1500,6939,1500,6935,1500,6956,1500,6938,1500,6985,1500,6942,1500,6201,1500,6248,1500,
                        6995,1500,6905,1500,6990,1500,6952,1500,6261,1500,6954,1500,6255,1500,6976,1500,6912,1500,6253,1500,6265,1500,6991,1500,6490,1500,
                        6941,1500,6925,1500,6926,1500,6264,1500,6910,1500,6932,1500,6237,1500,6257,1500,6205,1500,6974,1500,6931,1500,6254,1500,6927,1500,
                        6981,1500,6250,1500,6463,1500,6212,1500,6907,1500,6930,1500,6996,1500,6222,1500,6231,1500,6245,1500,6204,1500,6246,1500,6242,1500,
                        6992,1500,6923,1500,6921,1500,6922,1500,6106,1500,
                       1700  -- 11.03.2020 Ризанов Р.Т. [20-72291] Ошибка при взимании комиссии за ведение счёта со счетов НТК
                 ),  -- 08.09.2020 Карачев А.А. СЗ, № 1122-05/078009 от 27.08.2020 Об изменении тарифов по ежемесячным комиссияим, по пакетам услуг
           'RKO', sum(cd), sum(md), sum(cc), sum(mc)
      from (
             select /*+ index(trn I_TRN_OLD_NEW_DAC)*/ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                    ctrnaccd acc,ctrncur,count(1) c,iaccotd,count(1) cd,sum(mtrnsum) md ,0 cc,0 mc
             from acc,
                  ubrr_trn_old_new_v trn --xxi.V_TRN_PART_CURRENT -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
             where
               -- ubrr katyuhin >>>
                   acc.caccacc like acc_1
               and acc.cacccur = 'RUR'
               and acc.cACCprizn <> 'З'
               and acc.iaccbs2 not in (40813,40817,40818,40820
                                       ,40826 -->><< 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
                                       -- UBRR Pashevich A. 12-101
                                       ,42309,40810,40811,40812,40823,40824 -->><<-- ubrr 12.07.2016 Арсланов Д.Ф. #30780
                                       -- UBRR Pashevich A. 12-101
                                      )
               and substr(acc.caccacc,1,3) not in ('401','402','403','404','409')
               AND acc.caccacc NOT LIKE '40821________7%' -- 29/12/2011 Бездворный А.В. комиссии по 40821 (контрагенты) по РКО не считаем
               -- ubrr katyuhin <<<
               and trn.ctrnaccd = acc.caccacc
               and trn.ctrncur = acc.cacccur
               and trn.dtrntran between d1 and d2+86399/86400
               -->> 20.09.2017 ubrr korolkov 15-1436
               and substr(case when iTrnType in (5, 50, 53, 52, 55, 17, 41, 42, 43, 44) then nvl(cTrnClient_Acc, cTrnAccC) when cTrnMfoA is null then nvl(cTrnAccA, cTrnAccC) else cTrnAccA end, 1, 5) not in ('60309', '60322')
               --<< 20.09.2017 ubrr korolkov 15-1436
               and not (itrntype=4 and itrnsop=51 and ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
               and (  (    trn.itrntype in (2,3,4,11,14,15,21,22,23,25,28)
                       and (   substr(trn.itrnba2c,1,3) in (111,301,302,303,401,402,403,404,405,406,407,423,426)
                            or trn.itrnba2c in (10000,40802,40807,40817,40818,40820)))
                    or (     trn.itrntype in (9,13)
                        and not exists (select 1
                                          from gac
                                         where cgacacc = trn.ctrnaccd
                                           and cgaccur = trn.ctrncur
                                           and igaccat=105
                                           and igacnum in (1,2,8,9,
-- Ubrr Pashevich A. 12-1531
                                                           11
-- Ubrr  Pashevich A. 12-1531
                                                           ))))
  -->> ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
         and not (itrntype in (22,25) and regexp_like(ctrnpurp, '^ *(|! *)0406')   -->> ubrr 24.05.2017 Макарова Л.Ю. [14-985.18] Некорректное списание комиссии за проведение платежей ЮЛ и ИП
                  and exists (select 1 from xxi."smr" where csmrmfo8 = ctrnmfoa))
         --<< ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
               and not exists (select 1
                                 from gac
                                where cgacacc = acc.caccacc
                                  and cgaccur = acc.cacccur
                                  and igaccat = 112
                                  and igacnum in (1,3,4,5,7,9,10,13,15,16,17,19,20,21,22,23,25,31,
                                                  -- 35, UBRR Pashevich AO 14-992
                                                  36,37,38,
                                                  --39, -->> Ubrr Маkarova L.U. Торговый,условия отбора док-тов, для взимания комиссии
                                                  40,
                                                  57 -- UBRR  Pashevich A. 12-1750
                                                  ,98 --10.12.2019 Баязитов [19-69749] Доработка АБС. ежемесячные комиссии (РКО) по обращению ДКБ
                                  ))
               and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum = 45
                                  and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata like '112/45'))
-->> 11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю.
/* and  not exists (select 1
                          from gac g
                           where     cgacacc = cACCacc
                                 and cgaccur = cACCcur
                                 and igaccat = 112
                                 and igacnum = 92
                                 and exists (select 1
                                              from xxi.au_attach_obg au
                                               where     au.caccacc = cACCacc
                                                     and au.cacccur = cACCcur
                                                     and i_table = 304
                                                     and d_create<=d2 and au.c_newdata = '112/92'))*/--чтобы считалось по НТК, если стоит 112/92

--<< 11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю.
-->>01.09.2015  Макарова Л.Ю.        [15-921] АБС: Ведение счета бесплатно
               and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 114
                                  and igacnum = 10
                                  and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2+86399/86400--15-1101 MakarovaLU
                                                and au.c_newdata = '114/10'))
--<<01.09.2015  Макарова Л.Ю.        [15-921] АБС: Ведение счета бесплатно
-->> ubrr Макарова Л.Ю. 15-223 ТП "Все в дом", ТП "Все в дом премиум"
and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum = 73
                            and exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 333
                                  and igacnum = 4)
and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2+86399/86400--15-1101 MakarovaLU
                                                and au.c_newdata = '112/73')
                             and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2+86399/86400--15-1101 MakarovaLU
                                                and au.c_newdata = '333/4'))
and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum = 74
                            and exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 333
                                  and igacnum = 4)
                             and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2+86399/86400--15-1101 MakarovaLU
                                                and au.c_newdata = '112/74')
                             and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2+86399/86400--15-1101 MakarovaLU
                                                and au.c_newdata = '333/4'))
--<< ubrr Макарова Л.Ю. 15-223 ТП "Все в дом", ТП "Все в дом премиум"
               and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 333
                                  and igacnum = 2)
-->>22.08.2015  Макарова Л.Ю.        [15-841] АБС: Взимание комиссий. Тарифы НТК с 03.08.15

-->>05.09.2018 Баязитов М.Э. Исправление https://redmine.lan.ubrr.ru/issues/55147#note-6
               and not exists (select 1
                                  from gac
                                 where cgacacc = acc.cACCacc
                                   and cgaccur = acc.cACCcur
                                   and igaccat = 112
                                   and igacnum = 97
                                   and exists (select 1
                                                 from xxi.au_attach_obg au
                                                where au.caccacc = acc.caccacc
                                                  and au.CACCCUR = acc.cacccur
                                                  and au.i_table = 304
                                                  and trunc(d_create) <= d2
                                                   and c_newdata ='112/97'))
--<<05.09.2018 Баязитов М.Э. Исправление https://redmine.lan.ubrr.ru/issues/55147#note-6

/*     and not exists (select 1
                          from gac
                         where cgacacc = acc.cACCacc
                           and cgaccur = acc.cACCcur
                           and igaccat = 131
                           and exists (select 1
                                         from xxi.au_attach_obg au
                                        where au.caccacc = acc.cACCacc
                                          and au.cacccur = acc.cACCcur
                                          and i_table = 304
                                          and d_create <= d2
                                          and au.c_newdata like '131%'))*/
--<<27.07.2015  Макарова Л.Ю.        АБС: ТП Все просто в НТК
-->>29.06.2015  Макарова Л.Ю. Исправление ошибки при расчете комиссий по ТП "Тест-драйв"       (по бумаге комиссия должна браться)
-- UBRR Pashevich AO 14-992
/*               and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =acc.CACCACC  and cacccur = acc.CACCCUR
                                  and c_newdata = cg_112_72
                                  and d1 between trunc(d_create,'mm') and last_day(add_months (d_create,5))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum =72
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = cg_112_72
                                                        and a2.d_create>last_day(add_months (a1.d_create,5))
                                                )
                            )

               and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =acc.CACCACC  and cacccur = acc.CACCCUR
                                  and c_newdata = cg_112_35
                                  and d1 between trunc(d_create,'mm') and last_day(add_months (d_create,2))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum =35
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = cg_112_35
                                                        and a2.d_create>last_day(add_months (a1.d_create,2))
                                                )

                         )*/
--<<29.06.2015  Макарова Л.Ю. Исправление ошибки при расчете комиссий по ТП "Тест-драйв"       (по бумаге комиссия должна браться)
               /*and not exists (select 1
                                 from xxi.au_attach_obg au
                                where au.caccacc = acc.cACCacc
                                  and au.cacccur = acc.cACCcur
                                  and add_months(last_day(d_create),2) > d1
                                  and i_table = 304
                                  and au.c_newdata = '112/35' )*/
               -- UBRR Pashevich AO 14-992
       -- > y.metalnikov@i-sys.ru 11/12/13 rm 12-2172
       AND NOT exists (SELECT 1
                         FROM gac
                        WHERE cgacacc = acc.cACCacc
                          AND cgaccur = acc.cACCcur
                          AND igaccat = 112
                          AND igacnum = 40
                          AND exists (SELECT 1
                                        FROM xxi.au_attach_obg au
                                       WHERE au.caccacc = acc.cACCacc
                                         AND au.cacccur = acc.cACCcur
                                         AND au.i_table = 304
                                         AND au.d_create <= d2
                                         AND add_months(last_day(au.d_create),11) > d1
                                         AND au.c_newdata = '112/40'))
       AND NOT exists (SELECT 1
                         FROM xxi.au_attach_obg au_s
                        INNER JOIN xxi.au_attach_obg au_e
                           ON au_e.caccacc = au_s.caccacc
                          AND au_e.cacccur = au_s.cacccur
                          AND au_e.i_table = 304
                          AND au_e.C_OLDDATA = '112/40'
                        WHERE au_s.caccacc = acc.cACCacc
                          AND au_s.cacccur = acc.cACCcur
                          AND au_s.i_table = 304
                          AND au_s.d_create <= d2
                          AND au_e.d_create >= d1
                          AND add_months(last_day(au_s.d_create),11) > d1
                          AND au_s.c_newdata = '112/40')
        -- < y.metalnikov@i-sys.ru 11/12/13
               and not exists (select 1
                                 from xxi.au_attach_obg au
                                where au.caccacc = acc.cACCacc
                                  and au.cacccur = acc.cACCcur
                                  and d_create > d1
                                  and d_create < d2
                                  and i_table = 304
                                  and au.c_newdata in ( --'112/35', UBRR Pashevich AO 14-992
                                                        '112/36','112/37','112/38',
                                                        --'112/39', -->> Ubrr Маkarova L.U. Торговый,условия отбора док-тов, для взимания комиссии
                                                        '112/40','112/45'))
               and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum = 50
                                  and exists (select 1
                                                from xxi.au_attach_obg au
                                               where au.caccacc = acc.cACCacc
                                                 and au.cacccur = acc.cACCcur
                                                 and i_table = 304
                                                 and d_create <= d2
                                                 and add_months(last_day(d_create),5) > d1
                                                 and au.c_newdata = '112/50'))
               and not exists (select 1
                                 from xxi.au_attach_obg au
                                where au.caccacc = acc.cACCacc
                                  and au.cacccur = acc.cACCcur
                                  and add_months(last_day(d_create),5) > d1
                                  and d_create <= d2
                                  and i_table = 304
                                  and au.c_newdata = '112/50' )
               -->> ubrr korolkov 12-1657(#9707)
               and not exists (select 'x'
                                 from xxi.au_attach_obg au
                                where au.caccacc = acc.cACCacc
                                  and au.cacccur = acc.cACCcur
                                  and add_months(last_day(au.d_create),3) > d1
                                  and au.d_create <= d2
                                  and au.i_table = v_autab
                                  and au.c_newdata = cg_112_59
                                  and not exists
                                    (select 'x' from xxi.au_attach_obg au2
                                      where au2.caccacc = au.caccacc
                                        and au2.cacccur = au.cacccur
                                        and au2.c_olddata = cg_112_59
                                        and au2.d_create >= au.d_create
                                        and add_months(au2.d_create,1) <= d2) )
               --<< ubrr korolkov 12-1657(#9707)
               and not exists (select 1
                                 from gac
                                where cgacacc = acc.caccacc
                                  and cgaccur = acc.cacccur
                                  and igaccat = 112
                                  and igacnum in (6,8)
                                  and exists (select 1
                                                from xxi.au_attach_obg au
                                               where au.caccacc = acc.caccacc
                                                 and au.cacccur = acc.cacccur
                                                 and trunc(d_create) <= d2
                                                 and ( c_newdata ='112/6' or c_newdata ='112/8')
                                             ))
               and not exists (select /*+ index(t I_TRN_OLD_NEW_DAC)*/ -->><<--25.11.2019 Баязитов [19-62184] Ежемесячные комиссии
                                      1
                                 from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v t -->><<--25.11.2019 Баязитов [19-62184] Ежемесячные комиссии
                                where t.ctrnaccd = acc.caccacc
                                  and t.ctrncur = acc.cacccur
                                  and dtrntran between d1 and d2+86399/86400
                                  and itrnsop = 4)
---<<< UBRR Pashevich A. #12-508
               -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
               and not exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                             UBRR_UNIQUE_ACC_COMMS uuac 
                                   where acc.caccacc = uutc.cacc 
                                     and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF 
                                     and lc_idsmr = uutc.idsmr 
                                     and uutc.status = 'N'
                                     and uutc.uuta_id = uuac.uuta_id
                                     and uuac.com_type in ('RKBP','RKBK','RKO') 
                                 )
               --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
--->>>UBRR Pashevich A. #12-508
---<<<UBRR Pashevich A. #12-1530
              and not exists (select 1
                               from xxi.au_attach_obg au
                                 where     au.caccacc  = acc.caccacc
                                        and au.cacccur = acc.cacccur
                                        and c_newdata ='105/11'
                                        and trunc(au.d_create) <= to_date('18042013','dd.mm.yyyy')
                                        and exists (select 1
                                                     from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v -->><<--25.11.2019 Баязитов [19-62184] Ежемесячные комиссии
                                                      where     ctrnaccd   = acc.caccacc
                                                            and ctrncurc   = acc.cacccur
                                                            and dtrntran between d1 and d2+86399/86400
                                                            and ctrnidopen = 'CORREQTS')
                                        and d2 <= to_date('31072013','dd.mm.yyyy hh24:mi:ss')

                              )
             -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
             and not exists ( select 1
                                from gac g
                                    ,ubrr_rko_exinc_catgr e
                               where g.igaccat   = e.icat
                                 and g.igacnum   = e.igrp
                                 and e.ccom_type = 'RKO'
                                 and e.exinc     = 0
                                 and g.cgacacc   = acc.caccacc
                                 and g.cgaccur   = acc.cACCcur
                                 and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.caccacc
                                                and au.cacccur = acc.cacccur
                                                and au.i_table = 304
                                                and trunc(au.d_create) <= d2
                                                and au.c_newdata = g.igaccat||'/'||g.igacnum
                                                and trunc(au.d_create) between nvl(e.date_start, dg_date_start) and nvl(e.date_end, dg_date_end) --<<22.01.2020 Баязитов [19-64846]
                                            )
                            )
             --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
--->>>UBRR Pashevich A. #12-1530
-- (нач.) Новолодский А. Ю. 18.02.2015 12-2313
            --and ubrr_xxi5.ubrr_rko.iseqrexistscatgrlist(ctrnaccd, ctrncur, d1, d2) is null
             and not exists (select 1
                                 from sbs
                                where csbsdo like 'R_EKV%'
                                  and csbsacc = ctrnaccd)
-->>--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты
              and not exists (select 1
                                from sbs
                               where csbsdo like 'R_Onl%'
                                 and csbsacc=ctrnaccd)
--<<--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты
-- (кон.) Новолодский А. Ю. 18.02.2015 12-2313
            group by ctrnaccd,ctrncur,iACCotd
            UNION ALL
            select /*+ index( trn I_TRN_OLD_NEW_DACC )*/ -->><<--25.11.2019 Баязитов [19-62184] Ежемесячные комиссии
                   ctrnaccc acc,ctrncur,count(1) c,iaccotd,0 cd,0 md,count(1) cc,sum(mtrnsum) mc
            from acc,
                 ubrr_trn_old_new_v trn --xxi.V_TRN_PART_CURRENT -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
            where
            -- ubrr katyuhin >>>
                  acc.caccacc like acc_1
              and acc.cacccur = 'RUR'
              and acc.iaccbs2 not in (40813,40817,40818,40820
                                     ,40826 -->><< 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
                                     -- UBRR Pashevich A. 12-101
                                     ,42309,40810,40811,40812,40823,40824 -->><<-- ubrr 12.07.2016 Арсланов Д.Ф. #30780
                                     -- UBRR Pashevich A. 12-101
                                     )
              and acc.caccprizn <> 'З'
              and acc.caccacc like '40___810%'
              and substr(acc.caccacc,14,1) <> '4'
              and substr(acc.caccacc,1,3) not in ('401','402','403','404','409')
              AND acc.caccacc NOT LIKE '40821________7%' -- 29/12/2011 Бездворный А.В. комиссии по 40821 (контрагенты) по РКО не считаем
            -- ubrr katyuhin <<<
              and trn.ctrnaccc = acc.caccacc
              and trn.ctrncurc = acc.cacccur
              and trn.dtrntran between d1 and d2+86399/86400
              -->> 20.09.2017 ubrr korolkov 15-1436
              and not (ctrnaccd like '30232%' and lower(replace(ctrnpurp, ' ')) like 'возм%термин%')
              --<< 20.09.2017 ubrr korolkov 15-1436
              and trn.itrntype in (-7, 2, 5, 10, 12, 51, 53, 55)
              and not (trn.itrntype=4 and trn.itrnsop=51 and trn.ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
              and substr(nvl(ctrnacca,0),1,5) not in ('47426', '70606')
              and substr(ctrnaccd,1,5) not in ('47426', '70606')
              and not exists (select 1
                                from gac
                               where cgacacc = acc.cACCacc
                                 and cgaccur = acc.cACCcur
                                 and igaccat = 112
                                 and igacnum in (1,3,4,5,7,8,9,10,13,15,16,17,19,20,21,22,23,25,
                                                 31 ,
                                                 -- 35 ,UBRR Pashevich AO 14-992
                                                 36, 37, 38,
                                                 --39, -->> Ubrr Маkarova L.U. Торговый,условия отбора док-тов, для взимания комиссии
                                                 40, 50,
                                                 57  -- UBRR  Pashevich A. 12-1750
                                                 ,98 --10.12.2019 Баязитов [19-69749] Доработка АБС. ежемесячные комиссии (РКО) по обращению ДКБ
                                                 )
                              )
               and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum = 45
                                  and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata like '112/45'))
-->> 11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю.
/* and  not exists (select 1
                          from gac g
                           where     cgacacc = cACCacc
                                 and cgaccur = cACCcur
                                 and igaccat = 112
                                 and igacnum = 92
                                 and exists (select 1
                                              from xxi.au_attach_obg au
                                               where     au.caccacc = cACCacc
                                                     and au.cacccur = cACCcur
                                                     and i_table = 304
                                                     and d_create<=d2 and au.c_newdata = '112/92'))*/--чтобы считалось по НТК, если стоит 112/92

--<< 11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю.
-->> ubrr Макарова Л.Ю. 15-223 ТП "Все в дом", ТП "Все в дом премиум" Исправление ошибки 26.10.15
and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum = 73
                            and exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 333
                                  and igacnum = 4)
and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2+86399/86400--15-1101 MakarovaLU
                                                and au.c_newdata = '112/73')
                             and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2+86399/86400--15-1101 MakarovaLU
                                                and au.c_newdata = '333/4'))
and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum = 74
                            and exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 333
                                  and igacnum = 4)
                             and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2+86399/86400--15-1101 MakarovaLU
                                                and au.c_newdata = '112/74')
                             and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2+86399/86400--15-1101 MakarovaLU
                                                and au.c_newdata = '333/4'))
--<< ubrr Макарова Л.Ю. 15-223 ТП "Все в дом", ТП "Все в дом премиум" Исправление ошибки 26.10.15
              and not exists (select 1
                                from gac
                               where cgacacc = acc.cACCacc
                                 and cgaccur = acc.cacccur
                                 and igaccat = 333
                                 and igacnum = 2)
-->> ubrr 01.10.2019 ubrr Ризанов Р.Т Исправление ошибки неначисления комиссии RKO по ГО по причине одновременной комиссии RKO, REB_PE в SBS
              and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum = 97
                                  and exists (select 1
                                                from xxi.au_attach_obg au
                                               where au.caccacc = acc.caccacc
                                                 and au.CACCCUR = acc.cacccur
                                                 and au.i_table = 304
                                                 and trunc(d_create) <= d2+86399/86400
                                                  and c_newdata ='112/97'))
--<< ubrr 01.10.2019 ubrr Ризанов Р.Т Исправление ошибки неначисления комиссии RKO по ГО по причине одновременной комиссии RKO, REB_PE в SBS
-->>22.08.2015  Макарова Л.Ю.        [15-841] АБС: Взимание комиссий. Тарифы НТК с 03.08.15
   /*  and not exists (select 1
                          from gac
                         where cgacacc = acc.cACCacc
                           and cgaccur = acc.cACCcur
                           and igaccat = 131
                           and exists (select 1
                                         from xxi.au_attach_obg au
                                        where au.caccacc = acc.cACCacc
                                          and au.cacccur = acc.cACCcur
                                          and i_table = 304
                                          and d_create <= d2
                                          and au.c_newdata like '131%'))*/
-->>22.08.2015  Макарова Л.Ю.        [15-841] АБС: Взимание комиссий. Тарифы НТК с 03.08.15
-->>29.06.2015  Макарова Л.Ю. Исправление ошибки при расчете комиссий по ТП "Тест-драйв"       (по бумаге комиссия должна браться)
-- UBRR Pashevich AO 14-992
            /*   and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =acc.CACCACC  and cacccur = acc.CACCCUR
                                  and c_newdata = cg_112_72
                                  and d1 between trunc(d_create,'mm') and last_day(add_months (d_create,5))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum =72
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = cg_112_72
                                                        and a2.d_create>last_day(add_months (a1.d_create,5))
                                                )
                         )

               and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =acc.CACCACC  and cacccur = acc.CACCCUR
                                  and c_newdata = cg_112_35
                                  and d1 between trunc(d_create,'mm') and last_day(add_months (d_create,2))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum =35
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = cg_112_35
                                                        and a2.d_create>last_day(add_months (a1.d_create,2))
                                                )

                         )*/
--<<29.06.2015  Макарова Л.Ю. Исправление ошибки при расчете комиссий по ТП "Тест-драйв"       (по бумаге комиссия должна браться)
/*              and not exists (select 1
                                from xxi.au_attach_obg au
                               where au.caccacc = acc.cACCacc
                                 and au.cacccur = acc.cACCcur
                                 and add_months(last_day(d_create),2) > d1
                                 and i_table = 304
                                 and au.c_newdata = '112/35' )*/
              -- UBRR Pashevich AO 14-992
              and not exists (select 1
                                from xxi.au_attach_obg au
                               where au.caccacc = acc.cACCacc
                                 and au.cacccur = acc.cACCcur
                                 and d_create > d1
                                 and d_create < d2
                                 and i_table = 304
                                 and au.c_newdata in (-- '112/35',UBRR Pashevich AO 14-992
                                                      '112/36','112/37','112/38',
                                                      --'112/39', -->> Ubrr Маkarova L.U. Торговый,условия отбора док-тов, для взимания комиссии
                                                      '112/40','112/45'))
               -- > y.metalnikov@i-sys.ru 11/12/13 rm 12-2172
               AND NOT exists (SELECT 1
                                 FROM gac
                                WHERE cgacacc = acc.cACCacc
                                  AND cgaccur = acc.cACCcur
                                  AND igaccat = 112
                                  AND igacnum = 40
                                  AND exists (SELECT 1
                                                FROM xxi.au_attach_obg au
                                               WHERE au.caccacc = acc.cACCacc
                                                 AND au.cacccur = acc.cACCcur
                                                 AND au.i_table = 304
                                                 AND au.d_create <= d2
                                                 AND add_months(last_day(au.d_create),11) > d1
                                                 AND au.c_newdata = '112/40'))
               AND NOT exists (SELECT 1
                                 FROM xxi.au_attach_obg au_s
                                INNER JOIN xxi.au_attach_obg au_e
                                   ON au_e.caccacc = au_s.caccacc
                                  AND au_e.cacccur = au_s.cacccur
                                  AND au_e.i_table = 304
                                  AND au_e.C_OLDDATA = '112/40'
                                WHERE au_s.caccacc = acc.cACCacc
                                  AND au_s.cacccur = acc.cACCcur
                                  AND au_s.i_table = 304
                                  AND au_s.d_create <= d2
                                  AND au_e.d_create >= d1
                                  AND add_months(last_day(au_s.d_create),11) > d1
                                  AND au_s.c_newdata = '112/40')
                -- < y.metalnikov@i-sys.ru 11/12/13
              and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum = 50
                                  and exists (select 1
                                                from xxi.au_attach_obg au
                                               where au.caccacc = acc.cACCacc
                                                 and au.cacccur = acc.cACCcur
                                                 and i_table = 304
                                                 and d_create <= d2
                                                 and add_months(last_day(d_create),5) > d1
                                                 and au.c_newdata = '112/50'))
               and not exists (select 1
                                 from xxi.au_attach_obg au
                                where au.caccacc = acc.cACCacc
                                  and au.cacccur = acc.cACCcur
                                  and add_months(last_day(d_create),5) > d1
                                  and d_create <= d2
                                  and i_table = 304
                                  and au.c_newdata = '112/50' )
              -->> ubrr korolkov 12-1657(#9707)
               and not exists (select 'x'
                                 from xxi.au_attach_obg au
                                where au.caccacc = acc.cACCacc
                                  and au.cacccur = acc.cACCcur
                                  and add_months(last_day(au.d_create),3) > d1
                                  and au.d_create <= d2
                                  and au.i_table = v_autab
                                  and au.c_newdata = cg_112_59
                                  and not exists
                                    (select 'x' from xxi.au_attach_obg au2
                                      where au2.caccacc = au.caccacc
                                        and au2.cacccur = au.cacccur
                                        and au2.c_olddata = cg_112_59
                                        and au2.d_create >= au.d_create
                                        and add_months(au2.d_create,1) <= d2) )
              --<< ubrr korolkov 12-1657(#9707)
              and not exists (select 1
                                from gac
                               where cgacacc = acc.caccacc
                                 and cgaccur = acc.cacccur
                                 and igaccat = 105
                                 and igacnum in (1,2,8,9,
-- Ubrr Pashevich A. 12-1530
                                                 11
-- Ubrr Pashevich A. 12-1530
))
              and not exists (select 1
                                from gac
                               where cgacacc = acc.caccacc
                                 and cgaccur = acc.cacccur
                                 and igaccat = 112
                                 and igacnum in (6,8)
                                 and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.caccacc
                                                and au.cacccur = acc.cacccur
                                                and trunc(au.d_create) <= d2
                                                and ( au.c_newdata ='112/6' or au.c_newdata ='112/8')
                                            ))
---<<< UBRR Pashevich A. #12-508
            -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
            and not exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                          UBRR_UNIQUE_ACC_COMMS uuac 
                               where acc.caccacc = uutc.cacc 
                                 and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF 
                                 and lc_idsmr = uutc.idsmr 
                                 and uutc.status = 'N'
                                 and uutc.uuta_id = uuac.uuta_id
                                 and uuac.com_type in ('RKBP','RKBK','RKO')
                             ) 
            --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
--->>> UBRR Pashevich A. #12-508
---<<<UBRR Pashevich A. #12-1530
              and not exists (select 1
                               from xxi.au_attach_obg au
                                 where     au.caccacc  = acc.caccacc
                                        and au.cacccur = acc.cacccur
                                        and c_newdata ='105/11'
                                        and trunc(au.d_create) <= to_date('18042013','dd.mm.yyyy')
                                        and exists (select 1
                                                     from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v -->><<--25.11.2019 Баязитов [19-62184] Ежемесячные комиссии
                                                      where     ctrnaccd   = acc.caccacc
                                                            and ctrncurc   = acc.cacccur
                                                            and dtrntran between d1 and d2+86399/86400
                                                            and ctrnidopen = 'CORREQTS')
                                        and d2 <=to_date('31072013','dd.mm.yyyy hh24:mi:ss')
                              )
             -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
             and not exists ( select 1
                                from gac g
                                    ,ubrr_rko_exinc_catgr e
                               where g.igaccat   = e.icat
                                 and g.igacnum   = e.igrp
                                 and e.ccom_type = 'RKO'
                                 and e.exinc     = 0
                                 and g.cgacacc   = acc.caccacc
                                 and g.cgaccur   = acc.cACCcur
                                 and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.caccacc
                                                and au.cacccur = acc.cacccur
                                                and au.i_table = 304
                                                and trunc(au.d_create) <= d2
                                                and au.c_newdata = g.igaccat||'/'||g.igacnum
                                                and trunc(au.d_create) between nvl(e.date_start, dg_date_start) and nvl(e.date_end, dg_date_end) --<<22.01.2020 Баязитов [19-64846]
                                            )
                            )
             --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
-- (нач.) Новолодский А. Ю. 18.02.2015 12-2313
            --and ubrr_xxi5.ubrr_rko.iseqrexistscatgrlist(ctrnaccd, ctrncur, d1, d2) is null
              and not exists (select 1
                                 from sbs
                                where csbsdo like 'R_EKV%'
                                  and csbsacc = ctrnaccc)
-->>--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты
              and not exists (select 1
                                from sbs
                               where csbsdo like 'R_Onl%'
                                 and csbsacc=ctrnaccc)
--<<--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты
-- (кон.) Новолодский А. Ю. 18.02.2015 12-2313
--->>>UBRR Pashevich A. #12-1530
    group by ctrnaccc,ctrncur,iACCotd
)
group by acc,ctrncur,iaccotd);

ubrr_bnkserv_calc_new_lib.WriteProtocol('RKO : insert SBS '||sql%rowcount||' записей'); -- 11.03.2020  Ризанов Р.Т. [20-72291] Ошибка при взимании комиссии за ведение счёта со счетов НТК

----------------------------------------------------------------------------------------------------------------------------
/*
UBRR Pashevich A.№ 12-508
Ведение расчетного счета
- с использованием бумажной технологии
- крупные клиенты
*/

  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif := 'Y';          --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)
  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif_id_check := 'N'; --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)

   INSERT INTO SBS
   ( cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, cSBSdo,iSBSdebdoc,mSBSdebob,iSBScreddoc,mSBScredob )
   (select to_char(sysdate,'HH24:MI:SS'), acc,ctrncur,
           /*DECODE(iACCotd, 6201,1100,6248,1100,6261,1100,6262,1100,6204,700, 6242,700, 6245,650, 6205,800, 6212,600,
                           6246,600, 6237,1000,6257,1000,6222,650, 6231,1000,6250,550, 6253,600, 6255,600, 6265,600,
                           6266,600, 6254,1000,6102,600, 6402,600, 6420,600, 6404,500, 6104,600, 6411,650, 6414,600,
                           6103,350, 6448,350, 6405,350, 6421,200, 6105,1000,6112,700, 6440,600, 6107,700, 6401,700,
                           6403,700, 6406,700, 6408,700, 6407,700, 6415,700, 6416,700, 6423,700, 6409,500, 6427,450,
                           6106,500, 6412,500, 6513,500, 6109,500, 6413,500, 6429,500, 6431,500, 6453,500, 6418,500,
                           6417,800, 6442,600, 6441,600, 6452,600, 6454,600, 6110,750, 6410,750, 6422,750, 6460,750,
                           6428,450, 6457,450, 6445,750, 6115,550, 6114,600, 6116,1000, 1700)*/
--!!! Pashevich A. крупные клиенты по справочнику
            sumcom,
           'RKO', sum(cd), sum(md), sum(cc), sum(mc)
      from (
             select /*+ index(trn I_TRN_OLD_NEW_ADT)*/ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                    ctrnaccd acc,ctrncur,count(1) c,ubrr_xxi5.UBRR_UNIQ_ACC_SUM(ctrnaccd,ctrncur,null,d1,'RKO',sum(mtrnsum),0) sumcom,count(1) cd,sum(mtrnsum) md ,0 cc,0 mc  -- 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
             from acc,
                  ubrr_trn_old_new_v trn --xxi.V_TRN_PART_CURRENT -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
             where
               -- ubrr katyuhin >>>
                   acc.caccacc like acc_1
               and acc.cacccur = 'RUR'
               and acc.cACCprizn <> 'З'
               and acc.iaccbs2 not in (40813,40817,40818,40820
                                       ,40826 -->><< 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
                                       -- UBRR Pashevich A. 12-101
                                       ,42309,40810,40811,40812,40823,40824 -->><<-- ubrr 12.07.2016 Арсланов Д.Ф. #30780
                                       -- UBRR Pashevich A. 12-101
                                      )
               and substr(acc.caccacc,1,3) not in ('401','402','403','404','409')
               AND acc.caccacc NOT LIKE '40821________7%' -- 29/12/2011 Бездворный А.В. комиссии по 40821 (контрагенты) по РКО не считаем
               -- ubrr katyuhin <<<
               and trn.ctrnaccd = acc.caccacc
               and trn.ctrncur = acc.cacccur
               and trn.dtrntran between d1 and d2+86399/86400             
               -->> 20.09.2017 ubrr korolkov 15-1436
               and substr(case when iTrnType in (5, 50, 53, 52, 55, 17, 41, 42, 43, 44) then nvl(cTrnClient_Acc, cTrnAccC) when cTrnMfoA is null then nvl(cTrnAccA, cTrnAccC) else cTrnAccA end, 1, 5) not in ('60309', '60322')
               --<< 20.09.2017 ubrr korolkov 15-1436
               and not (trn.itrntype=4 and trn.itrnsop=51 and trn.ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
               and (  (    trn.itrntype in (2,3,4,11,14,15,21,22,23,25,28)
                       and (   substr(trn.itrnba2c,1,3) in (111,301,302,303,401,402,403,404,405,406,407,423,426)
                            or trn.itrnba2c in (10000,40802,40807,40817,40818,40820)))
                    or (     trn.itrntype in (9,13)
                        and not exists (select 1
                                          from gac
                                         where cgacacc = trn.ctrnaccd
                                           and cgaccur = trn.ctrncur
                                           and igaccat=105
                                           and igacnum in (1,2,8,9,
-- Ubrr Pashevich A. 12-1531
                                                           11
-- Ubrr Pashevich A. 12-1531
                                                           ))))
  -->> ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
         and not (itrntype in (22,25) and regexp_like(ctrnpurp, '^ *(|! *)0406')   -- ubrr 24.05.2017 Макарова Л.Ю. [14-985.18] Некорректное списание комиссии за проведение платежей ЮЛ и ИП
                  and exists (select 1 from xxi."smr" where csmrmfo8 = ctrnmfoa))
         --<< ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии

               and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 333
                                  and igacnum = 2)
-->>22.08.2015  Макарова Л.Ю.        [15-841] АБС: Взимание комиссий. Тарифы НТК с 03.08.15
-->>27.07.2015  Макарова Л.Ю.  АБС: ТП Все просто в НТК (по действ. тарифам до 03.08.15)
/*     and not exists (select 1
                          from gac
                         where cgacacc = acc.cACCacc
                           and cgaccur = acc.cACCcur
                           and igaccat = 131
                           and exists (select 1
                                         from xxi.au_attach_obg au
                                        where au.caccacc = acc.cACCacc
                                          and au.cacccur = acc.cACCcur
                                          and i_table = 304
                                          and d_create <= d2
                                          and au.c_newdata like '131%'))*/
--<<27.07.2015  Макарова Л.Ю.        АБС: ТП Все просто в НТК
               and not exists (select /*+ index(t I_TRN_OLD_NEW_DAC)*/ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                                      1
                                 from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v t -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                                where t.ctrnaccd = acc.caccacc
                                  and t.ctrncur = acc.cacccur
                                  and dtrntran between d1 and d2+86399/86400
                                  and itrnsop = 4)
---<<<UBRR Pashevich A. #12-508
                -->> 25.06.2018 Пинаев Д.Е. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)
                and not exists (select 1
                             from gac
                            where cgacacc = acc.cACCacc
                              and cgaccur = acc.cACCcur
                              and igaccat = 112
                              and igacnum = 97
                              and exists (select 1
                                            from xxi.au_attach_obg au
                                           where au.caccacc = acc.caccacc
                                             and au.CACCCUR = acc.cacccur
                                             and au.i_table = 304
                                             and trunc(d_create) <= d2
                                              and c_newdata ='112/97'))
                --<< 25.06.2018 Пинаев Д.Е. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)
                -->>10.12.2019 Баязитов [19-69749] Доработка АБС. ежемесячные комиссии (РКО) по обращению ДКБ
                and not exists (select 1
                             from gac
                            where cgacacc = acc.cACCacc
                              and cgaccur = acc.cACCcur
                              and igaccat = 112
                              and igacnum = 98
                              and exists (select 1
                                            from xxi.au_attach_obg au
                                           where au.caccacc = acc.caccacc
                                             and au.CACCCUR = acc.cacccur
                                             and au.i_table = 304
                                             and trunc(d_create) <= d2
                                              and c_newdata ='112/98'))
                and not exists (select 1
                             from gac
                            where cgacacc = acc.cACCacc
                              and cgaccur = acc.cACCcur
                              and igaccat = 112
                              and igacnum = 45
                              and exists (select 1
                                            from xxi.au_attach_obg au
                                           where au.caccacc = acc.caccacc
                                             and au.CACCCUR = acc.cacccur
                                             and au.i_table = 304
                                             and trunc(d_create) <= d2
                                              and c_newdata ='112/45'))
                --<<10.12.2019 Баязитов [19-69749] Доработка АБС. ежемесячные комиссии (РКО) по обращению ДКБ
               -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
               and exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                         UBRR_UNIQUE_ACC_COMMS uuac 
                                   where acc.caccacc = uutc.cacc 
                                     and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF
                                     and lc_idsmr = uutc.idsmr
                                     and uutc.status = 'N'
                                     and uutc.uuta_id = uuac.uuta_id
                                     and uuac.daily = 'N'
                                     and uuac.com_type = 'RKO')  
                --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
---<<<UBRR Pashevich A. #12-508
               -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
               and not exists ( select 1
                                  from gac g
                                      ,ubrr_rko_exinc_catgr e
                                 where g.igaccat   = e.icat
                                   and g.igacnum   = e.igrp
                                   and e.ccom_type = 'RKO'
                                   and e.exinc     = 0
                                   and g.cgacacc   = acc.caccacc
                                   and g.cgaccur   = acc.cACCcur
                                   and exists (select 1
                                                 from xxi.au_attach_obg au
                                                where au.caccacc = acc.caccacc
                                                  and au.cacccur = acc.cacccur
                                                  and au.i_table = 304
                                                  and trunc(au.d_create) <= d2
                                                  and au.c_newdata = g.igaccat||'/'||g.igacnum
                                                  and trunc(au.d_create) between nvl(e.date_start, dg_date_start) and nvl(e.date_end, dg_date_end) --<<22.01.2020 Баязитов [19-64846]
                                              )
                              )
               --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
-- (нач.) Новолодский А. Ю. 18.02.2015 12-2313
            --and ubrr_xxi5.ubrr_rko.iseqrexistscatgrlist(ctrnaccd, ctrncur, d1, d2) is null
              and not exists (select 1
                                 from sbs
                                where csbsdo like 'R_EKV%'
                                  and csbsacc = ctrnaccd)
-->>--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты
              and not exists (select 1
                                from sbs
                               where csbsdo like 'R_Onl%'
                                 and csbsacc= ctrnaccd)
--<<--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты
-- (кон.) Новолодский А. Ю. 18.02.2015 12-2313
            group by ctrnaccd,ctrncur
            UNION ALL
            select /*+ index( trn I_TRN_OLD_NEW_DACC )*/ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                   ctrnaccc acc,ctrncur,count(1) c,ubrr_xxi5.UBRR_UNIQ_ACC_SUM(ctrnaccc,ctrncur,null,d1,'RKO',sum(mtrnsum),0),0 cd,0 md,count(1) cc,sum(mtrnsum) mc  -- 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
            from acc,
                 ubrr_trn_old_new_v trn --xxi.V_TRN_PART_CURRENT -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
            where
            -- ubrr katyuhin >>>
                  acc.caccacc like acc_1
              and acc.cacccur = 'RUR'
              and acc.iaccbs2 not in (40813,40817,40818,40820
                                     ,40826 -->><< 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
                                      -- UBRR Pashevich A. 12-101
                                      , 42309
                                      -- UBRR Pashevich A. 12-101
                                     )
              and acc.caccprizn <> 'З'
              and acc.caccacc like '40___810%'
              and substr(acc.caccacc,14,1) <> '4'
              and substr(acc.caccacc,1,3) not in ('401','402','403','404','409')
              AND acc.caccacc NOT LIKE '40821________7%' -- 29/12/2011 Бездворный А.В. комиссии по 40821 (контрагенты) по РКО не считаем
            -- ubrr katyuhin <<<
              and trn.ctrnaccc = acc.caccacc
              and trn.ctrncurc = acc.cacccur
              and trn.dtrntran between d1 and d2+86399/86400
              -->> 20.09.2017 ubrr korolkov 15-1436
              and not (ctrnaccd like '30232%' and lower(replace(ctrnpurp, ' ')) like 'возм%термин%')
              --<< 20.09.2017 ubrr korolkov 15-1436
              and trn.itrntype in (-7, 2, 5, 10, 12, 51, 53, 55)
              and not (trn.itrntype=4 and trn.itrnsop=51 and trn.ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
              and substr(nvl(ctrnacca,0),1,5) not in ('47426', '70606')
              and substr(ctrnaccd,1,5) not in ('47426', '70606')

              and not exists (select 1
                                from gac
                               where cgacacc = acc.cACCacc
                                 and cgaccur = acc.cacccur
                                 and igaccat = 333
                                 and igacnum = 2)
              and not exists (select 1
                                from gac
                               where cgacacc = acc.caccacc
                                 and cgaccur = acc.cacccur
                                 and igaccat = 105
                                 and igacnum in (1,2,8,9,
-- Ubrr Pashevich A. 12-1530
                                                 11
-- Ubrr Pashevich A. 12-1530
))

---<<<UBRR Pashevich A. #12-508
              -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
              and  exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                         UBRR_UNIQUE_ACC_COMMS uuac 
                                   where acc.caccacc = uutc.cacc 
                                     and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF
                                     and lc_idsmr = uutc.idsmr
                                     and uutc.status = 'N'
                                     and uutc.uuta_id = uuac.uuta_id
                                     and uuac.daily = 'N'
                                     and uuac.com_type = 'RKO')
              --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
--->>>UBRR Pashevich A. #12-508
-- (нач.) Новолодский А. Ю. 18.02.2015 12-2313
            --and ubrr_xxi5.ubrr_rko.iseqrexistscatgrlist(ctrnaccd, ctrncur, d1, d2) is null
            and not exists (select 1
                                 from sbs
                                where csbsdo like 'R_EKV%'
                                  and csbsacc = ctrnaccc)
-->>--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты
              and not exists (select 1
                                from sbs
                               where csbsdo like 'R_Onl%'
                                 and csbsacc= ctrnaccc)
--<<--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты
-- (кон.) Новолодский А. Ю. 18.02.2015 12-2313
                -->>10.12.2019 Баязитов [19-69749] Доработка АБС. ежемесячные комиссии (РКО) по обращению ДКБ
                and not exists (select 1
                             from gac
                            where cgacacc = acc.cACCacc
                              and cgaccur = acc.cACCcur
                              and igaccat = 112
                              and igacnum = 98
                              and exists (select 1
                                            from xxi.au_attach_obg au
                                           where au.caccacc = acc.caccacc
                                             and au.CACCCUR = acc.cacccur
                                             and au.i_table = 304
                                             and trunc(d_create) <= d2
                                              and c_newdata ='112/98'))
                and not exists (select 1
                             from gac
                            where cgacacc = acc.cACCacc
                              and cgaccur = acc.cACCcur
                              and igaccat = 112
                              and igacnum = 45
                              and exists (select 1
                                            from xxi.au_attach_obg au
                                           where au.caccacc = acc.caccacc
                                             and au.CACCCUR = acc.cacccur
                                             and au.i_table = 304
                                             and trunc(d_create) <= d2
                                              and c_newdata ='112/45'))
                --<<10.12.2019 Баязитов [19-69749] Доработка АБС. ежемесячные комиссии (РКО) по обращению ДКБ
                -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
                and not exists ( select 1
                                   from gac g
                                       ,ubrr_rko_exinc_catgr e
                                  where g.igaccat   = e.icat
                                    and g.igacnum   = e.igrp
                                    and e.ccom_type = 'RKO'
                                    and e.exinc     = 0
                                    and g.cgacacc   = acc.caccacc
                                    and g.cgaccur   = acc.cACCcur
                                    and exists (select 1
                                                  from xxi.au_attach_obg au
                                                 where au.caccacc = acc.caccacc
                                                   and au.cacccur = acc.cacccur
                                                   and au.i_table = 304
                                                   and trunc(au.d_create) <= d2
                                                   and au.c_newdata = g.igaccat||'/'||g.igacnum
                                                   and trunc(au.d_create) between nvl(e.date_start, dg_date_start) and nvl(e.date_end, dg_date_end) --<<22.01.2020 Баязитов [19-64846]
                                               )
                               )
                --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
    group by ctrnaccc,ctrncur
)
group by acc,ctrncur,sumcom);

  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif := 'N';          --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)
  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif_id_check := 'Y'; --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)

-->> 11.03.2020  Ризанов Р.Т. [20-72291] Ошибка при взимании комиссии за ведение счёта со счетов НТК
ubrr_bnkserv_calc_new_lib.WriteProtocol('RKO : (крупные клиенты) insert SBS '||sql%rowcount||' записей');

-- замена МВЗ НТК для RKO
merge into xxi."sbs" r
using ( select s1.CSBSACC
              ,s1.CSBSCUR
              ,s1.CSBSDO
              ,s1.IDSMR
              ,s1.ISBSOTDNUM       -- замененный МВЗ НТК
          from ( select s.CSBSACC
                       ,s.CSBSCUR
                       ,s.CSBSDO
                       ,s.IDSMR
                       ,tar.cmvz ISBSOTDNUM
                       ,g.IGACNUM
                       ,row_number() over ( partition by g.cgacacc,g.cgaccur,g.idsmr order by null) rn
                   from xxi."sbs" s
                       ,gac       g
                       ,ubrr_comm_gacmvz_tarif tar
                  where s.idsmr   = lc_idsmr
                    and s.CSBSDO  = 'RKO'
                    and s.CSBSACC like acc_1
                    and g.cgacacc = s.csbsacc
                    and g.cgaccur = s.csbscur
                    and g.idsmr   = s.idsmr
                    and g.igaccat = tar.icat
                    and g.igacnum = tar.inum
                    and g.igaccat = 131
                    and exists (select 1
                                  from xxi.au_attach_obg au
                                 where au.caccacc = g.cgacacc
                                   and au.cacccur = g.cgaccur
                                   and i_table    = 304
                                   and d_create  <= d2
                                   and au.c_newdata like '131%')

               ) s1
           where s1.rn =1 -- защита от множественности 131 категории с разными значениями в gac
      ) n
on (     r.csbsacc = n.csbsacc
     and r.csbscur = n.csbscur
     and r.csbsdo  = n.csbsdo
     and r.idsmr   = n.idsmr
    )
when matched then
       update set isbsotdnum = n.isbsotdnum;

ubrr_bnkserv_calc_new_lib.WriteProtocol('RKO : заполнение (merge) ISBSOTDNUM - МВЗ для НТК '||sql%rowcount||' записей');
--<< 11.03.2020  Ризанов Р.Т. [20-72291] Ошибка при взимании комиссии за ведение счёта со счетов НТК


-->>22.08.2015  Макарова Л.Ю.        [15-841] АБС: Взимание комиссий. Тарифы НТК с 03.08.15
update sbs
   set mSBStoll_sum = /*DECODE(isbsotdnum, 8515,890,8516,890,8505,890,8209,690,8243,790,8114,790,8511,890,8306,790,8517,890,8216,790,8542,790,8509,890,8491,890,8519,890,8090,890,
                                    8504,790,8481,950,8487,950,8488,950,8490,950,8494,950,8492,950,8486,950,8507,790,8009,690,8499,890,6899,790,8495,890,8070,690,
                                    8496,890,8129,790,8521,790,8066,790,8518,890,8512,890,8493,890,8482,950,8543,950,8484,950,8544,950,8485,950,8545,950,8500,890,8514,890,8220,790,8523,790,8234,790,8522,790,8502,890,
                                    8501,890,8483,790,8506,790,8510,890,8044,890,8520,890,8558,790,8557,790,
                                    8524,790,8525,790,8526,950,8527,950,8528,950,8529,950,8530,950,8531,950,8532,950,8533,790,8534,890,8535,790,
                                    8536,890,8537,790,8538,890,8539,890,8540,890,8541,890,
                                    8546,690,8547,890,8548,890,8549,890,8550,890,8551,790,8552,790,8553,690,8554,690,8555,890,8556,790,
                                    8559,890,8560,890,8561,950,8562,950,8563,950,8564,950
                                    ,690 -- 11.03.2020  Ризанов Р.Т. [20-72291] Ошибка при взимании комиссии за ведение счёта со счетов НТК
                                    )  -- 13.08.2020 Карачев А.А. План мероприятий по переподчинению НТК Филиала "Кировский" головному банку*/ 
                                DECODE(isbsotdnum, 8526,1000,8528,1000,8529,1000,8530,1000,8532,1000,8531,1000,8527,1000,8561,1000,8562,1000,8563,1000,8564,1000,8543,1000,
                                                   8544,1000,8545,1000,8555,950,8519,950,8560,950,8536,950,8548,950,8538,950,8559,950,8539,950,8518,950,8547,950,8515,950,
                                                   8516,950,8540,950,8511,950,8517,950,8541,950,8534,950,8549,950,8514,950,8550,950,8501,950,8510,950,8520,950,8524,850,
                                                   8114,850,8525,850,8542,850,8533,850,8556,850,8535,850,8521,850,8552,850,8523,850,8522,850,8537,850,8551,850,8558,850,
                                                   8557,850,8554,950,8546,950,8553,950,
                                    690 -- 11.03.2020  Ризанов Р.Т. [20-72291] Ошибка при взимании комиссии за ведение счёта со счетов НТК
                                    )  -- 08.09.2020 Карачев А.А. СЗ, № 1122-05/078009 от 27.08.2020 Об изменении тарифов по ежемесячным комиссияим, по пакетам услуг
 where cSBSdo = 'RKO'
   and exists (select 1
                 from gac
                where cgacacc = cSBSacc
                  and cgaccur = cSBScur
                  and igaccat = 131
                  and exists (select 1
                                from xxi.au_attach_obg au
                               where au.caccacc = cSBSacc
                                 and au.cacccur = cSBScur
                                 and i_table = 304
                                 and d_create <= d2
                                 and au.c_newdata like '131%'))

-->>01.09.2015  Макарова Л.Ю.        [15-921] АБС: Ведение счета бесплатно
               and not exists (select 1
                                 from gac
                                where cgacacc = cSBSacc
                                  and cgaccur = cSBScur
                                  and igaccat = 114
                                  and igacnum = 10
                                  and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = cSBSacc
                                                and au.cacccur =cSBScur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata = '114/10'))
--<<01.09.2015  Макарова Л.Ю.        [15-921] АБС: Ведение счета бесплатно
  and not (exists (select 1
                             from xxi.AU_ATTACH_OBG au
                            where au.caccacc = cSBSacc
                              and au.cacccur = cSBScur
                              and i_table = 304
                              and au.c_newdata = '112/45'
                              and d_create <= d2
                              and d_create >= d1)
                    or exists (select 1
                         from gac
                        where cgacacc = cSBSacc
                          and cgaccur = cSBScur
                          and igaccat = 112
                          and igacnum = 45
                          and exists (select 1
                                        from xxi.au_attach_obg au
                                       where au.caccacc = cSBSacc
                                         and au.cacccur = cSBScur
                                         and i_table = 304
                                         and d_create <= d2
                                         and au.c_newdata = '112/45') )
            )
  -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
  and not exists ( select 1
                     from gac g
                         ,ubrr_rko_exinc_catgr e
                    where g.igaccat   = e.icat
                      and g.igacnum   = e.igrp
                      and e.ccom_type = 'RKO'
                      and e.exinc     = 0
                      and g.cgacacc   = cSBSacc
                      and g.cgaccur   = cSBScur
                      and exists (select 1
                                    from xxi.au_attach_obg au
                                   where au.caccacc = cSBSacc
                                     and au.cacccur = cSBScur
                                     and au.i_table = 304
                                     and trunc(au.d_create) <= d2
                                     and au.c_newdata = g.igaccat||'/'||g.igacnum
                                     and trunc(au.d_create) between nvl(e.date_start, dg_date_start) and nvl(e.date_end, dg_date_end) --<<22.01.2020 Баязитов [19-64846]
                                 )
                 )
  --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
            ;

   ubrr_bnkserv_calc_new_lib.WriteProtocol('RKO: update суммы комиссии МВЗ для НТК '||sql%rowcount||' записей'); -- 11.03.2020  Ризанов Р.Т. [20-72291] Ошибка при взимании комиссии за ведение счёта со счетов НТК

--<<22.08.2015  Макарова Л.Ю.        [15-841] АБС: Взимание комиссий. Тарифы НТК с 03.08.15
DBMS_TRANSACTION.COMMIT;


----------------------------------------------------------------------------------------------------------------------------
-- 1.1)для не пользователей банк-клиента - REO в режиме Эконом
/*
Ведение расчетного счета в режиме "Эконом"
- с использованием бумажной технологии
*/
   INSERT INTO SBS
   ( cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, cSBSdo,iSBSdebdoc,mSBSdebob,iSBScreddoc,mSBScredob )
   (select to_char(sysdate,'HH24:MI:SS'), acc,ctrncur,

   /*  DECODE(iACCotd, 6264,950,6452,950,6487,1000,6440,1000,6245,1150,6204,1150,6935,1000,6112,1000,6473,1000,6301,1300,6303,1300,6302,1300,
            6213,1300,6210,1300,6216,1300,6232,1300,6240,1300,6224,1300,6208,1300,6239,1300,6220,1300,6219,1300,6217,1300,6263,1300,
            6269,1300,6932,950,6428,1000,6472,1000,6489,1000,6237,950,6257,950,6205,950,6482,1000,6106,1000,6412,1000,6409,950,6933,1000,
            6931,950,6485,950,6255,1000,6254,950,6923,950,6927,950,6486,1000,6427,1000,6474,950,6105,1200,6471,1000,6253,1000,6445,1000,
            6201,1000,6248,1000,6250,950,6115,1000,6464,1000,6483,1000,6925,950,6926,950,6921,950,6479,1000,6417,1000,6463,950,6246,1150,
            6110,1000,6422,1000,6410,1000,6460,1000,6212,950,6453,950,6469,1000,6116,1200,6904,1200,6442,1000,6930,950,6922,950,6242,1150,
            6418,950,6265,1000,6222,950,6231,950,6470,1000,6478,1000,6261,1000,6480,1000,6109,1000,6429,1000,6413,1000,6431,1000,6488,1000,
            6490,1000,6107,1000,6408,1000,6406,1000,6401,1000,6403,1000,6416,1000,6937,1000,6938,1000,6939,1000,6941,1000,6948,1200,6963,
            1200,6967,1200,6950,1000,6951,1000,6952,1000,6953,1000,6954,1000,6955,1000,6956,1000,6968,1000,6969,1000,6970,1000,6971,1000,
            6973,1000,6974,950,6975,1000,6976,1000,6981,950,6982,1000,6983,1000,6984,1000,6985,1000,6986,1000,6988,1000,6989,1000,6990,1000,
            6991,1000,6992,950,6993,1000,6994,1000,6995,1000,6996,950,6997,1000,6998,1000,6915,1000,6905,1000,6907,950,6910,950,6912,1000,
            6913,1000,6914,1000,6942,1000,6944,1000,
            1250), -- 13.08.2020 Карачев А.А. План мероприятий по переводу Кировский в ВСП*/
    DECODE(iACCotd, 6948,1300,6963,1300,6967,1300,6301,1400,6303,1400,6302,1400,6213,1400,6210,1400,6216,1400,6232,1400,
                    6240,1400,6224,1400,6208,1400,6239,1400,6220,1400,6219,1400,6217,1400,6263,1400,6269,1400,6913,1100,
                    6915,1100,6933,1100,6986,1100,6950,1100,6951,1100,6955,1100,6953,1100,6982,1100,6984,1100,6983,1100,
                    6988,1100,6989,1100,6993,1100,6997,1100,6994,1100,6998,1100,6914,1100,6968,1100,6973,1100,6971,1100,
                    6969,1100,6970,1100,6975,1100,6937,1100,6939,1100,6935,1100,6956,1100,6938,1100,6985,1100,6942,1100,
                    6201,1100,6248,1100,6995,1100,6905,1100,6990,1100,6952,1100,6261,1100,6954,1100,6255,1100,6976,1100,
                    6912,1100,6253,1100,6265,1100,6991,1100,6490,1100,6941,1100,6925,1000,6926,1000,6264,1000,6910,1000,
                    6932,1000,6237,1000,6257,1000,6205,1000,6974,1000,6931,1000,6254,1000,6927,1000,6981,1000,6250,1000,
                    6463,1000,6212,1000,6907,1000,6930,1000,6996,1000,6222,1000,6231,1000,6245,1250,6204,1250,6246,1250,
                    6242,1250,6992,1000,6923,1000,6921,1000,6922,1000,9219,1400,9217,1400,6106,1100,
            1250), -- 08.09.2020 Карачев А.А. СЗ, № 1122-05/078009 от 27.08.2020 Об изменении тарифов по ежемесячным комиссияим, по пакетам услуг
    'REO',sum(cd),sum(md),sum(cc),sum(mc)
        from (select ctrnaccd acc,ctrncur,count(1) c,iaccotd,count(1) cd,sum(mtrnsum) md ,0 cc,0 mc
                from ubrr_trn_old_new_v trn /*xxi.V_TRN_PART_CURRENT*/, acc a -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
               where ctrnaccd like acc_1
                 and cTRNcur = 'RUR'
                 and dtrntran between  d1 and d2+86399/86400
                 -->> 20.09.2017 ubrr korolkov 15-1436
                 and substr(case when iTrnType in (5, 50, 53, 52, 55, 17, 41, 42, 43, 44) then nvl(cTrnClient_Acc, cTrnAccC) when cTrnMfoA is null then nvl(cTrnAccA, cTrnAccC) else cTrnAccA end, 1, 5) not in ('60309', '60322')
                 --<< 20.09.2017 ubrr korolkov 15-1436
               AND caccacc NOT LIKE '40821________7%' -- 29/12/2011 Бездворный А.В. комиссии по 40821 (контрагенты) по РКО не считаем
               and not (itrntype=4 and itrnsop=51 and ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
                 and (  (    itrntype in (2,3,4,11,14,15,21,22,23,25,28)
                        and (   substr(itrnba2c,1,3) in (111,301,302,303,401,402,403,404,405,406,407,423,426)
                             or itrnba2c in (10000,40802,40807,40817,40818,40820,40911)))
                    or (     itrntype in (9,13)
                        and not exists (select 1
                                          from gac
                                         where cgacacc = cTRNaccd
                                           and cgaccur = ctrncur
                                           and igaccat=105
                                           and igacnum in (1,2,8,9,
-- Ubrr Pashevich A. 12-1530
                                                           11
-- Ubrr Pashevich A. 12-1530
))))
  -->> ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
         and not (itrntype in(22,25) and regexp_like(ctrnpurp, '^ *(|! *)0406')   -- ubrr 24.05.2017 Макарова Л.Ю. [14-985.18] Некорректное списание комиссии за проведение платежей ЮЛ и ИП
                  and exists (select 1 from xxi."smr" where csmrmfo8 = ctrnmfoa))
         --<< ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
               and not exists (select 1
                                 from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v t -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                                where t.ctrnaccd = trn.ctrnaccd
                                  and t.ctrncur = trn.ctrncur
                                  and dtrntran between  d1 and d2+86399/86400
                                  and itrnsop=4)
               and not exists (select 1
                                 from gac
                                where cgacacc = cACCacc
                                  and cgaccur = cACCcur
                                  and igaccat = 112
                                  and igacnum in (1,3,4,5,7,9,10,13,15,16,17,19,20,21,22,23,25,31,
                                                  -- 35, UBRR Pashevich AO 14-992
                                                  36,37,38,39,40,45,50,0,
                                                  57 -- UBRR Pashevich A. 12-1750
                                                  )
                              )
               and not exists (select 1
                                 from gac
                                where cgacacc = a.cACCacc
                                  and cgaccur = a.cACCcur
                                  and igaccat = 333
                                  and igacnum = 2)
-->>01.09.2015  Макарова Л.Ю.        [15-921] АБС: Ведение счета бесплатно
               and not exists (select 1
                                 from gac
                                where cgacacc = a.cACCacc
                                  and cgaccur = a.cACCcur
                                  and igaccat = 114
                                  and igacnum = 10
                                  and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = a.cACCacc
                                                and au.cacccur =a.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata = '114/10'))
--<<01.09.2015  Макарова Л.Ю.        [15-921] АБС: Ведение счета бесплатно
               -- > y.metalnikov@i-sys.ru 11/12/13 rm 12-2172
               AND NOT exists (SELECT 1
                                 FROM gac
                                WHERE cgacacc = a.cACCacc
                                  AND cgaccur = a.cACCcur
                                  AND igaccat = 112
                                  AND igacnum = 40
                                  AND exists (SELECT 1
                                                FROM xxi.au_attach_obg au
                                               WHERE au.caccacc = a.cACCacc
                                                 AND au.cacccur = a.cACCcur
                                                 AND au.i_table = 304
                                                 AND au.d_create <= d2
                                                 AND add_months(last_day(au.d_create),11) > d1
                                                 AND au.c_newdata = '112/40'))
               AND NOT exists (SELECT 1
                                 FROM xxi.au_attach_obg au_s
                                INNER JOIN xxi.au_attach_obg au_e
                                   ON au_e.caccacc = au_s.caccacc
                                  AND au_e.cacccur = au_s.cacccur
                                  AND au_e.i_table = 304
                                  AND au_e.C_OLDDATA = '112/40'
                                WHERE au_s.caccacc = a.cACCacc
                                  AND au_s.cacccur = a.cACCcur
                                  AND au_s.i_table = 304
                                  AND au_s.d_create <= d2
                                  AND au_e.d_create >= d1
                                  AND add_months(last_day(au_s.d_create),11) > d1
                                  AND au_s.c_newdata = '112/40')
                -- < y.metalnikov@i-sys.ru 11/12/13
               and not exists (select 1
                                 from xxi.au_attach_obg au
                                where au.caccacc = a.cACCacc
                                  and au.cacccur = a.cACCcur
                                  and d_create > d1
                                  and d_create < d2
                                  and i_table = 304
                                  and au.c_newdata in (-- '112/35', UBRR Pashevich AO 14-992
                                                       '112/36','112/37','112/38',/*'112/39',*/'112/40','112/45','112/50'))
-->>--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты

              and not exists (select 1
                                from sbs
                               where csbsdo like 'R_Onl%'
                                 and csbsacc=ctrnaccd)
--<<--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты
               -->> ubrr korolkov 12-1657(#9707)
               and not exists (select 'x'
                                 from xxi.au_attach_obg au
                                where au.caccacc = a.cACCacc
                                  and au.cacccur = a.cACCcur
                                  and add_months(last_day(au.d_create),3) > d1
                                  and au.d_create <= d2
                                  and au.i_table = v_autab
                                  and au.c_newdata = cg_112_59
                                  and not exists
                                    (select 'x' from xxi.au_attach_obg au2
                                      where au2.caccacc = au.caccacc
                                        and au2.cacccur = au.cacccur
                                        and au2.c_olddata = cg_112_59
                                        and au2.d_create >= au.d_create
                                        and add_months(au2.d_create,1) <= d2) )
               --<< ubrr korolkov 12-1657(#9707)
               and exists (select 1
                             from gac
                            where cgacacc = cACCacc
                              and cgaccur = cACCcur
                              and igaccat = 112
                              and igacnum in (6,8)
                              and exists (select 1
                                            from xxi.au_attach_obg
                                           where cgacacc = caccacc
                                             and cgaccur = cacccur
                                             and trunc(d_create) <= d2
                                             and (   c_newdata ='112/6'
                                                  or c_newdata ='112/8')))
               and cACCacc = cTRNaccd
               and cACCcur = cTRNcur
               and cACCprizn <> 'З'
---<<<UBRR Pashevich A. #12-508
               -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
               and not exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                             UBRR_UNIQUE_ACC_COMMS uuac 
                                   where ctrnaccd = uutc.cacc 
                                     and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF 
                                     and lc_idsmr = uutc.idsmr 
                                     and uutc.status = 'N'
                                     and uutc.uuta_id = uuac.uuta_id
                                     and uuac.com_type in ('RKBP','RKBK','RKO')
                                 )
               --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
--->>>UBRR Pashevich A. #12-508
---<<<UBRR Pashevich A. #12-1530
              and not exists (select 1
                               from xxi.au_attach_obg au
                                 where     au.caccacc  = a.caccacc
                                        and au.cacccur = a.cacccur

                                        and c_newdata ='105/11'
                                        and trunc(au.d_create) <= to_date('18042013','dd.mm.yyyy')
                                        and exists (select 1
                                                     from ubrr_trn_old_new_v --xxi.V_TRN_PART_CURRENT -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                                                      where     ctrnaccd   = a.caccacc
                                                            and ctrncurc   = a.cacccur
                                                            and dtrntran between d1 and d2+86399/86400
                                                            and ctrnidopen = 'CORREQTS')
                                        and d2 <= to_date('31072013','dd.mm.yyyy hh24:mi:ss')

                              )
--->>>UBRR Pashevich A. #12-1530
            -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
            and not exists ( select 1
                               from gac g
                                   ,ubrr_rko_exinc_catgr e
                              where g.igaccat   = e.icat
                                and g.igacnum   = e.igrp
                                and e.ccom_type = 'REO'
                                and e.exinc     = 0
                                and g.cgacacc   = a.caccacc
                                and g.cgaccur   = a.cACCcur
                                and exists (select 1
                                              from xxi.au_attach_obg au
                                             where au.caccacc = a.caccacc
                                               and au.cacccur = a.cacccur
                                               and au.i_table = 304
                                               and trunc(au.d_create) <= d2
                                               and au.c_newdata = g.igaccat||'/'||g.igacnum
                                               and trunc(au.d_create) between nvl(e.date_start, dg_date_start) and nvl(e.date_end, dg_date_end) --<<22.01.2020 Баязитов [19-64846]
                                           )
                           )
            --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
            group by ctrnaccd,ctrncur,iACCotd
             UNION ALL
            select ctrnaccc acc,ctrncur,count(1) c,iaccotd,0 cd,0 md,count(1) cc,sum(mtrnsum) mc
              from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v, acc a -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
             where ctrnaccc like acc_1
               and cTRNcurc = 'RUR'
               and dtrntran between d1 and d2+86399/86400
               -->> 20.09.2017 ubrr korolkov 15-1436
               and not (ctrnaccd like '30232%' and lower(replace(ctrnpurp, ' ')) like 'возм%термин%')
               --<< 20.09.2017 ubrr korolkov 15-1436
               -->>--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты

              and not exists (select 1
                                from sbs
                               where csbsdo like 'R_Onl%'
                                  and csbsacc = ctrnaccc)
--<<--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты
               AND caccacc NOT LIKE '40821________7%' -- 29/12/2011 Бездворный А.В. комиссии по 40821 (контрагенты) по РКО не считаем
/*              and (  (    iTRNtype in (2,5,51)
                      and (   ctrnaccd like '301%'
                           or ctrnaccd like '303%')) -- добавили кредит межбанка через 303% 11.01.09 мвв
                   or iTRNtype in (10,12))*/
               and itrntype in (-7, 2, 5, 10, 12, 51, 53, 55)
               and not (itrntype=4 and itrnsop=51 and ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
               and substr(nvl(ctrnacca,0),1,5) not in ('47426', '70606')
               and substr(ctrnaccd,1,5) not in ('47426', '70606')
               and exists (select 1
                             from gac
                            where cgacacc = cACCacc
                              and cgaccur = cACCcur
                              and igaccat = 112
                              and igacnum in (6,8)
                              and exists (select 1
                                            from xxi.au_attach_obg
                                           where cgacacc = caccacc
                                             and cgaccur = cacccur
                                             and trunc(d_create) <= d2
                                             and (   c_newdata ='112/6'
                                                  or c_newdata ='112/8')))
-->>01.09.2015  Макарова Л.Ю.        [15-921] АБС: Ведение счета бесплатно
               and not exists (select 1
                                 from gac
                                where cgacacc = a.cACCacc
                                  and cgaccur = a.cACCcur
                                  and igaccat = 114
                                  and igacnum = 10
                                  and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = a.cACCacc
                                                and au.cacccur =a.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata = '114/10'))
--<<01.09.2015  Макарова Л.Ю.        [15-921] АБС: Ведение счета бесплатно
                -- > y.metalnikov@i-sys.ru 11/12/13 rm 12-2172
                AND NOT exists (SELECT 1
                                 FROM gac
                                WHERE cgacacc = a.cACCacc
                                  AND cgaccur = a.cACCcur
                                  AND igaccat = 112
                                  AND igacnum = 40
                                  AND exists (SELECT 1
                                                FROM xxi.au_attach_obg au
                                               WHERE au.caccacc = a.cACCacc
                                                 AND au.cacccur = a.cACCcur
                                                 AND au.i_table = 304
                                                 AND au.d_create <= d2
                                                 AND add_months(last_day(au.d_create),11) > d1
                                                 AND au.c_newdata = '112/40'))
                AND NOT exists (SELECT 1
                                 FROM xxi.au_attach_obg au_s
                                INNER JOIN xxi.au_attach_obg au_e
                                   ON au_e.caccacc = au_s.caccacc
                                  AND au_e.cacccur = au_s.cacccur
                                  AND au_e.i_table = 304
                                  AND au_e.C_OLDDATA = '112/40'
                                WHERE au_s.caccacc = a.cACCacc
                                  AND au_s.cacccur = a.cACCcur
                                  AND au_s.i_table = 304
                                  AND au_s.d_create <= d2
                                  AND au_e.d_create >= d1
                                  AND add_months(last_day(au_s.d_create),11) > d1
                                  AND au_s.c_newdata = '112/40')
                -- < y.metalnikov@i-sys.ru 11/12/13
               and not exists (select 1
                                 from xxi.au_attach_obg au
                                where au.caccacc = a.cACCacc
                                  and au.cacccur = a.cACCcur
                                  and d_create > d1
                                  and d_create < d2
                                  and i_table = 304
                                  and au.c_newdata in (--'112/35', UBRR Pashevich AO 14-992
                                                       '112/36','112/37','112/38',/*'112/39',*/'112/40','112/45','112/50'))
               -->> ubrr korolkov 12-1657(#9707)
               and not exists (select 'x'
                                 from xxi.au_attach_obg au
                                where au.caccacc = a.cACCacc
                                  and au.cacccur = a.cACCcur
                                  and add_months(last_day(au.d_create),3) > d1
                                  and au.d_create <= d2
                                  and au.i_table = v_autab
                                  and au.c_newdata = cg_112_59
                                  and not exists
                                    (select 'x' from xxi.au_attach_obg au2
                                      where au2.caccacc = au.caccacc
                                        and au2.cacccur = au.cacccur
                                        and au2.c_olddata = cg_112_59
                                        and au2.d_create >= au.d_create
                                        and add_months(au2.d_create,1) <= d2) )
               --<< ubrr korolkov 12-1657(#9707)
               and not exists (select 1
                                 from gac
                                where cgacacc = cACCacc
                                  and cgaccur = cACCcur
                                  and igaccat = 112
                                  and igacnum in (1,3,4,5,7,9,10,13,15,16,17,19,20,21,22,23,25,31,
                                                  -- 35, UBRR Pashevich AO 14-992
                                                  36,37,38,39,40,45,50,
                                                  57 -- UBRR Pashevich A. 12-1750
                                                  )
                               )
               and not exists (select 1
                                 from gac
                                where cgacacc = a.cACCacc
                                  and cgaccur = a.cACCcur
                                  and igaccat = 333
                                  and igacnum = 2)
               and not exists (select 1
                                 from gac
                                where cgacacc = cACCacc
                                  and cgaccur = cACCcur
                                  and igaccat = 105
                                  and igacnum in (1,2,8,9,
-- Ubrr Pashevich A. 12-1530
                                                  11
-- Ubrr Pashevich A. 12-1530
))
               and cACCacc = cTRNaccc
               and cACCcur = cTRNcurc
               and cACCprizn <> 'З'
---<<<UBRR Pashevich A. #12-508
               -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
               and not exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                             UBRR_UNIQUE_ACC_COMMS uuac 
                                   where ctrnaccc = uutc.cacc 
                                     and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF 
                                     and lc_idsmr = uutc.idsmr 
                                     and uutc.status = 'N'
                                     and uutc.uuta_id = uuac.uuta_id
                                     and uuac.com_type in ('RKBP','RKBK','RKO')
                                 ) 
               --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
--->>>UBRR Pashevich A. #12-508
---<<<UBRR Pashevich A. #12-1530
              and not exists (select 1
                               from xxi.au_attach_obg au
                                 where     au.caccacc  = a.caccacc
                                        and au.cacccur = a.cacccur

                                        and c_newdata ='105/11'
                                        and trunc(au.d_create) <= to_date('18042013','dd.mm.yyyy')
                                        and exists (select 1
                                                     from ubrr_trn_old_new_v --xxi.V_TRN_PART_CURRENT -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                                                      where     ctrnaccd   = a.caccacc
                                                            and ctrncurc   = a.cacccur
                                                            and dtrntran between d1 and d2+86399/86400
                                                            and ctrnidopen = 'CORREQTS')
                                        and d2 <= to_date('31072013','dd.mm.yyyy hh24:mi:ss')

                              )
--->>>UBRR Pashevich A. #12-1530
             -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
             and not exists ( select 1
                                from gac g
                                    ,ubrr_rko_exinc_catgr e
                               where g.igaccat   = e.icat
                                 and g.igacnum   = e.igrp
                                 and e.ccom_type = 'REO'
                                 and e.exinc     = 0
                                 and g.cgacacc   = a.caccacc
                                 and g.cgaccur   = a.cACCcur
                                 and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = a.caccacc
                                                and au.cacccur = a.cacccur
                                                and au.i_table = 304
                                                and trunc(au.d_create) <= d2
                                                and au.c_newdata = g.igaccat||'/'||g.igacnum
                                                and trunc(au.d_create) between nvl(e.date_start, dg_date_start) and nvl(e.date_end, dg_date_end) --<<22.01.2020 Баязитов [19-64846]
                                            )
                            )
             --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
             group by ctrnaccc,ctrncur,iACCotd)
group by acc,ctrncur,iaccotd);

-- begin 01/03/2008 VVM корректировка для Агентов Континенталя, считаем что они по тарифу К-Б идут (для ССБ)
begin
     for r in (select a.rowid rw, caccmail,
                      /*decode(caccmail, 'K', decode(b.iaccotd,6305,350,800),
                                            decode(b.iaccotd,6305,600,1000))*/--распоряжение №7006-2947 от 09.12.2009 ( изм.Галиева)
                       decode(caccmail, 'K', decode(b.iaccotd,6305,400,950),
                       decode(b.iaccotd,6305,700,1400)) summ
                 from sbs a,acc b
                where csbsdo='RKO'
                  and exists (select 1
                                from gac
                               where cgacacc = a.cSBSacc
                                 and cgaccur = a.cSBScur
                                 and igaccat = 112
                                 and igacnum = 11)
                  and exists (select 1
                                from gac
                               where cgacacc = a.cSBSacc
                                 and cgaccur = a.cSBScur
                                 and igaccat = 105
                                 and igacnum in (1,2,8,9))
                  and b.caccacc=a.csbsacc) loop

        update SBS
           set mSBStoll_sum=r.summ,
               cSBSdo='RKB'||DECODE(r.caccmail, 'K', 'K', 'P')
         WHERE rowid=r.rw;
    end loop;
end;
-- end 01/03/2008 VVM корректировка для Агенов Континенталя, считаем что они по тарифу К-Б идут (для ССБ)
DBMS_TRANSACTION.COMMIT;


----------------------------------------------------------------------------------------------------------------------------
-- 2)для пользователей банк-клиента - RKB
/*
Ведение расчетного счета
- с использованием системы удаленного доступа
*/

   INSERT INTO SBS
   ( cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, cSBSdo ,iSBSdebdoc,mSBSdebob,iSBScreddoc,mSBScredob)
   (select to_char(sysdate,'HH24:MI:SS'), acc,ctrncur,
           DECODE(caccmail, 'K',
           -- без предоставления выписки и документов в бумажном виде
          /*  DECODE(iACCotd,6264,790,6452,790,6487,890,6440,890,6245,900,6204,900,6935,890,6112,890,6473,890,6301,1310,6303,1310,6302,1310,6213,1310,
                        6210,1310,6216,1310,6232,1310,6240,1310,6224,1310,6208,1310,6239,1310,6220,1310,6219,1310,6217,1310,6263,1310,6269,1310,
                        6932,790,6428,890,6472,890,6489,890,6237,790,6257,790,6205,790,6482,790,6106,890,6412,890,6409,790,6933,890,6931,790,6485,690,
                        6255,790,6254,790,6923,690,6927,790,6486,790,6427,790,6474,790,6105,950,6471,790,6253,790,6445,890,6201,890,6248,890,6250,790,
                        6115,890,6464,890,6483,890,6925,790,6926,790,6921,690,6479,890,6417,890,6463,790,6246,900,6110,890,6422,890,6410,890,6460,890,
                        6212,790,6453,790,6469,890,6116,950,6904,950,6442,890,6930,790,6922,690,6242,900,6418,790,6265,790,6222,790,6231,790,6470,890,
                        6478,890,6261,890,6480,790,6109,890,6429,890,6413,890,6431,890,6488,890,6490,790,6107,890,6408,890,6406,890,6401,890,6403,890,
                        6416,890,6937,890,6938,890,6939,890,6941,790,6948,950,6963,950,6967,950,6950,890,6951,890,6952,890,6953,890,6954,790,6955,890,
                        6956,890,6968,890,6969,890,6970,890,6971,890,6973,890,6974,790,6975,890,6976,790,6981,790,6982,890,6983,890,6984,890,6985,890,
                        6986,890,6988,890,6989,890,6990,890,6991,790,6992,690,6993,890,6994,890,6995,890,6996,790,6997,890,6998,890,6915,890,6905,890,
                        6907,790,6910,790,6912,790,6913,890,6914,890,6942,890,6944,890,
                        1310 -- 11.03.2020 Ризанов Р.Т. [20-72291] Ошибка при взимании комиссии за ведение счёта со счетов НТК
                 ), -- 13.08.2020 Карачев А.А. План мероприятий по переводу Кировский в ВСП*/
           DECODE(iACCotd,6948,1000,6963,1000,6967,1000,6301,1400,6303,1400,6302,1400,6213,1400,6210,1400,6216,1400,6232,1400,6240,1400,6224,1400,6208,1400,
                        6239,1400,6220,1400,6219,1400,6217,1400,6263,1400,6269,1400,6913,950,6915,950,6933,950,6986,950,6950,950,6951,950,6955,950,6953,950,
                        6982,950,6984,950,6983,950,6988,950,6989,950,6993,950,6997,950,6994,950,6998,950,6914,950,6968,950,6973,950,6971,950,6969,950,6970,950,
                        6975,950,6937,950,6939,950,6935,950,6956,950,6938,950,6985,950,6942,950,6201,950,6248,950,6995,950,6905,950,6990,950,6952,950,6261,950,
                        6954,850,6255,850,6976,850,6912,850,6253,850,6265,850,6991,850,6490,850,6941,850,6925,850,6926,850,6264,850,6910,850,6932,850,6237,850,
                        6257,850,6205,850,6974,850,6931,850,6254,850,6927,850,6981,850,6250,850,6463,850,6212,850,6907,850,6930,850,6996,850,6222,850,6231,850,
                        6245,990,6204,990,6246,990,6242,990,6992,950,6923,950,6921,950,6922,950,6106,950,
                        1310 -- 11.03.2020 Ризанов Р.Т. [20-72291] Ошибка при взимании комиссии за ведение счёта со счетов НТК
                 ), -- 08.09.2020 Карачев А.А. СЗ, № 1122-05/078009 от 27.08.2020 Об изменении тарифов по ежемесячным комиссияим, по пакетам услуг
          -- с предоставлением выписки и документов в бумажном виде
    /*  DECODE(iACCotd,6264,1400,6452,1400,6487,1450,6440,1450,6245,1400,6204,1400,6935,1450,6112,1450,6473,1450,6301,1700,6303,1700,6302,1700,
                            6213,1700,6210,1700,6216,1700,6232,1700,6240,1700,6224,1700,6208,1700,6239,1700,6220,1700,6219,1700,6217,1700,6263,1700,
                            6269,1700,6932,1400,6428,1450,6472,1450,6489,1450,6237,1400,6257,1400,6205,1400,6482,1450,6106,1450,6412,1450,6409,1400,
                            6933,1450,6931,1400,6485,1400,6255,1450,6254,1400,6923,1400,6927,1400,6486,1450,6427,1450,6474,1400,6105,1500,6471,1450,
                            6253,1450,6445,1450,6201,1450,6248,1450,6250,1400,6115,1450,6464,1450,6483,1450,6925,1400,6926,1400,6921,1400,6479,1450,
                            6417,1450,6463,1400,6246,1400,6110,1450,6422,1450,6410,1450,6460,1450,6212,1400,6453,1400,6469,1450,6116,1500,6904,1500,
                            6442,1450,6930,1400,6922,1400,6242,1400,6418,1400,6265,1450,6222,1400,6231,1400,6470,1450,6478,1450,6261,1450,6480,1450,
                            6109,1450,6429,1450,6413,1450,6431,1450,6488,1450,6490,1450,6107,1450,6408,1450,6406,1450,6401,1450,6403,1450,6416,1450,
                            6937,1450,6938,1450,6939,1450,6941,1450,6948,1500,6963,1500,6967,1500,6950,1450,6951,1450,6952,1450,6953,1450,6954,1450,
                            6955,1450,6956,1450,6968,1450,6969,1450,6970,1450,6971,1450,6973,1450,6974,1400,6975,1450,6976,1450,6981,1400,6982,1450,
                            6983,1450,6984,1450,6985,1450,6986,1450,6988,1450,6989,1450,6990,1450,6991,1450,6992,1400,6993,1450,6994,1450,6995,1450,
                            6996,1400,6997,1450,6998,1450,6915,1450,6905,1450,6907,1400,6910,1400,6912,1450,6913,1450,6914,1450,6942,1450,6944,1450,
                            1700 -- 11.03.2020 Ризанов Р.Т. [20-72291] Ошибка при взимании комиссии за ведение счёта со счетов НТК 
                    )
                 ), -- 13.08.2020 Карачев А.А. План мероприятий по переводу Кировский в ВСП*/
              DECODE(iACCotd,6948,1700,6963,1700,6967,1700,6301,1900,6303,1900,6302,1900,6213,1900,6210,1900,6216,1900,6232,1900,6240,1900,6224,1900,6208,1900,
                        6239,1900,6220,1900,6219,1900,6217,1900,6263,1900,6269,1900,6913,1500,6915,1500,6933,1500,6986,1500,6950,1500,6951,1500,6955,1500,
                        6953,1500,6982,1500,6984,1500,6983,1500,6988,1500,6989,1500,6993,1500,6997,1500,6994,1500,6998,1500,6914,1500,6968,1500,6973,1500,
                        6971,1500,6969,1500,6970,1500,6975,1500,6937,1500,6939,1500,6935,1500,6956,1500,6938,1500,6985,1500,6942,1500,6201,1500,6248,1500,
                        6995,1500,6905,1500,6990,1500,6952,1500,6261,1500,6954,1500,6255,1500,6976,1500,6912,1500,6253,1500,6265,1500,6991,1500,6490,1500,
                        6941,1500,6925,1500,6926,1500,6264,1500,6910,1500,6932,1500,6237,1500,6257,1500,6205,1500,6974,1500,6931,1500,6254,1500,6927,1500,
                        6981,1500,6250,1500,6463,1500,6212,1500,6907,1500,6930,1500,6996,1500,6222,1500,6231,1500,6245,1500,6204,1500,6246,1500,6242,1500,
                        6992,1500,6923,1500,6921,1500,6922,1500,6106,1500,
                       1700 -- 11.03.2020 Ризанов Р.Т. [20-72291] Ошибка при взимании комиссии за ведение счёта со счетов НТК 
                    )
                 ), -- 08.09.2020 Карачев А.А. СЗ, № 1122-05/078009 от 27.08.2020 Об изменении тарифов по ежемесячным комиссияим, по пакетам услуг
            -- 'RKB'||DECODE(iACCotd,6400,null,6107,null,6401,null,6403,null,6406,null,6407,null,6408,null,6415,null,6416,null,6423,null,6103,null,6405,null,6421,null,6105,null, DECODE(caccmail, 'K', 'K', 'P')),
            'RKB'||DECODE(caccmail, 'K', 'K', 'P'), -- 12.07.2012 ubrr korolkov
             sum(cd),sum(md),sum(cc),sum(mc)
      from (
             select /*+ index( trn I_TRN_OLD_NEW_ADT )*/ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                    ctrnaccd acc,ctrncur,count(1) c,iaccotd,count(1) cd,sum(mtrnsum) md ,0 cc,0 mc, caccmail
             from acc,
                  ubrr_trn_old_new_v trn --xxi.V_TRN_PART_CURRENT -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
             where
               --1=0 and
               -- ubrr katyuhin >>>
                   acc.caccacc LIKE acc_1
               and acc.cacccur = 'RUR'
               and acc.caccprizn <> 'З'
               and acc.iaccbs2 NOT IN (40813, 40817, 40818, 40820
                                      -- UBRR Pashevich A. 12-101
                                      ,42309,40810,40811,40812,40823,40824 -->><<-- ubrr 12.07.2016 Арсланов Д.Ф. #30780
                                      -- UBRR Pashevich A. 12-101
                                      )
               and SUBSTR (acc.caccacc, 1, 3) NOT IN ('401', '402', '403', '404', '409')
               AND acc.caccacc NOT LIKE '40821________7%' -- 29/12/2011 Бездворный А.В. комиссии по 40821 (контрагенты) по РКО не считаем
               -- ubrr katyuhin <<<
               and trn.ctrnaccd = acc.cACCacc
               and trn.ctrncur = acc.cACCcur
               and dtrntran between d1 and d2+86399/86400
               -->> 20.09.2017 ubrr korolkov 15-1436
               and substr(case when iTrnType in (5, 50, 53, 52, 55, 17, 41, 42, 43, 44) then nvl(cTrnClient_Acc, cTrnAccC) when cTrnMfoA is null then nvl(cTrnAccA, cTrnAccC) else cTrnAccA end, 1, 5) not in ('60309', '60322')
               --<< 20.09.2017 ubrr korolkov 15-1436
               and (  (    itrntype in (2,3,4,11,14,15,21,22,23,25,28)
                       and (   substr(itrnba2c,1,3) in (111,301,302,303,401,402,403,404,405,406,407,423,426)
                            or itrnba2c in (10000,40802,40807,40817,40818,40820,40911))
                -- Зуев А.А. раньше это условие распространялось и на кассу
                        and (exists (select /*+ index( t I_TRN_OLD_NEW_DAC )*/ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                                           1
                                      from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v t -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                                     where t.ctrnaccd = trn.ctrnaccd
                                       and t.ctrncur = trn.ctrncur
                                       and dtrntran between d1 and d2+86399/86400
                                       and itrnsop=4)
                             -->>22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
                             or exists (select /*+ index( t I_TRN_OLD_NEW_ADT )*/ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                                              1
                                          from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v t -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                                         where t.ctrnaccd = trn.ctrnaccd
                                           and t.ctrncur = trn.ctrncur
                                           and dtrntran between d1 and d2+86399/86400
                                           and itrnsop=51
                                           and itrntype=4
                                           and ctrnpurp like '0450%') ))
                            --<<22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
                    or (    itrntype in (9,13)
                        and exists (select 1
                                      from gac
                                     where cgacacc = cTRNaccd
                                       and cgaccur = ctrncur
                                       and igaccat=105
                                       and igacnum in (1,2,8,9,
-- Ubrr Pashevich A. 12-1531
                                                       11
-- Ubrr Pashevich A. 12-1531
))))
  -->> ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
         and not (itrntype in (22,25) and regexp_like(ctrnpurp, '^ *(|! *)0406') -- ubrr 24.05.2017 Макарова Л.Ю. [14-985.18] Некорректное списание комиссии за проведение платежей ЮЛ и ИП
                  and exists (select 1 from xxi."smr" where csmrmfo8 = ctrnmfoa))
         --<< ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
                -->> 25.06.2018 Пинаев Д.Е. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)
                and not exists (select 1
                             from gac
                            where cgacacc = acc.cACCacc
                              and cgaccur = acc.cACCcur
                              and igaccat = 112
                              and igacnum = 97
                              and exists (select 1
                                            from xxi.au_attach_obg au
                                           where au.caccacc = acc.caccacc
                                             and au.CACCCUR = acc.cacccur
                                             and au.i_table = 304
                                             and trunc(d_create) <= d2
                                              and c_newdata ='112/97'))
                --<< 25.06.2018 Пинаев Д.Е. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)
                -->> 24.10.2018 Баязитов [18-56613]  ТП "Сбрось лишнее" (по типу ТП "Экспресс") для НТК с 01.11.18
                and not exists (select 1
                             from gac
                            where cgacacc = acc.cACCacc
                              and cgaccur = acc.cACCcur
                              and igaccat = 112
                              and igacnum = 98
                              and exists (select 1
                                            from xxi.au_attach_obg au
                                           where au.caccacc = acc.caccacc
                                             and au.CACCCUR = acc.cacccur
                                             and au.i_table = 304
                                             and trunc(d_create) <= d2
                                              and c_newdata ='112/98'))
                --<< 24.10.2018 Баязитов [18-56613]  ТП "Сбрось лишнее" (по типу ТП "Экспресс") для НТК с 01.11.18
-->>01.09.2015  Макарова Л.Ю.        [15-921] АБС: Ведение счета бесплатно
               and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 114
                                  and igacnum = 10
                                  and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata = '114/10'))
--<<01.09.2015  Макарова Л.Ю.        [15-921] АБС: Ведение счета бесплатно
-->> ubrr Макарова Л.Ю. 15-223 ТП "Все в дом", ТП "Все в дом премиум"
  and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum = 74
                                  and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata = '112/74'))
-->> 11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю.
 /*and  not exists (select 1
                          from gac g
                           where     cgacacc = cACCacc
                                 and cgaccur = cACCcur
                                 and igaccat = 112
                                 and igacnum = 92
                                 and exists (select 1
                                              from xxi.au_attach_obg au
                                               where     au.caccacc = cACCacc
                                                     and au.cacccur = cACCcur
                                                     and i_table = 304
                                                     and d_create<=d2 and au.c_newdata = '112/92'))*/--чтобы считалось по НТК, если стоит 112/92

--<< 11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю.
and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum = 73
                            and exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 333
                                  and igacnum = 4)
                             and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata = '112/73')
                             and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata = '333/4'))
and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum = 74
                            and exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 333
                                  and igacnum = 4)
                             and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata like '112/74')
                             and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata like '333/4'))
--<< ubrr Макарова Л.Ю. 15-223 ТП "Все в дом", ТП "Все в дом премиум"
               and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum in (1,3,4,5,7,10,12,15,16,17,19,20,21,22,23,24,13,25,31,36,37,38,39,
                                                  57 -- Ubrr  Pashevich A. 12-1750
                                                  )
                                ) --Галиева добавила 13 группу 03.04.2009 -- korolkov 24.04.2012
-- UBRR Pashevich A. 14-406
               and not exists (select 1
                                from gac g
                                 where     cgacacc = acc.caccacc
                                       and cgaccur = acc.cacccur
                                       and igaccat = 112
                                       and igacnum = 67
                                       and exists (select 1
                                                    from xxi.au_attach_obg au
                                                     where     au.caccacc = acc.cACCacc
                                                           and au.cacccur = acc.cACCcur
                                                           and i_table = 304
                                                            and d_create<=d2+86399/86400 /*UBRR Pashevich AO 14-992*/ and au.c_newdata = '112/67')
                                       and exists (Select 1
                                                    From gac
                                                     Where     cgacacc = acc.cACCacc
                                                           and cgaccur = acc.cACCcur
                                                           and igaccat=105
                                                           and igacnum in (2,11))                                                          
                               )
-- UBRR Pashevich A. 14-406
               and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum = 45
                                  and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata like '112/45'))
                -->> 26.05.2015 ubrr korolkov 15-453
                and not exists (select 1
                                from gac
                                where cgacacc = acc.cACCacc
                                and cgaccur = acc.cACCcur
                                and igaccat = 112
                                and igacnum in (78,79,80,
                                99,100,101,102,103, --27.12.2018 Баязитов [15-43]
                                104,105,106,        -- Бизнес  Премиум  3, 6, 12  -- ubrr 31.05.2019 Ризанов Р.Т. [19-59153] АБС. Лимит платежей в пакеты услуг "Бизнес-Класс 3,6,12"
                                108, --09.01.2020 Баязитов [19-70025] АБС: Тарифный план "Промо Online"
                                94)--24.09.2016 ubrr Maкарова Л.Ю. 16-2653 АБС: Кат/гр 112/94 для пакета услуг "Бизнес-комплект"
                                and exists (select 1
                                            from xxi.au_attach_obg au
                                            where au.caccacc = acc.cACCacc
                                            and au.cacccur = acc.cACCcur
                                            and i_table = 304
                                            and trunc(d_create) <= d2
                                            and au.c_newdata like '112/'||to_char(gac.igacnum)))
                --<< 26.05.2015 ubrr korolkov 15-453
-->> 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
               and not exists (select 1
                                 from gac
                                 where cgacacc = acc.cACCacc
                                   and cgaccur = acc.cACCcur
                                   and igaccat = 114
                                   and igacnum = 16)
--<< 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
-->> ubrr Макарова Л.Ю. 15-231 ТП "Онлайн бесплатно"
               and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum = 76
                                  and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata = '112/76'))
--<< ubrr Макарова Л.Ю. 15-231 ТП "Онлайн бесплатно"
               and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 333
                                  and igacnum = 2)

-- UBRR Pashevich AO 14-992
                and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =acc.CACCACC  and cacccur = acc.CACCCUR
                                  and c_newdata = cg_112_72
                                  and d1 between trunc(d_create,'mm') and last_day( add_months (d_create,5))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum =72
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = cg_112_72
                                                        and a2.d_create>last_day(add_months (a1.d_create,5))
                                                )
                         )
                         -->> UBRR Макарова Л.Ю. 15-279
    and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =acc.CACCACC  and cacccur = acc.CACCCUR
                                  and c_newdata = cg_112_75
                                  and d1 between trunc(d_create,'mm') and last_day(add_months (d_create,5))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum =75
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = cg_112_75
                                                        and a2.d_create>last_day(add_months (a1.d_create,5))
                                                )
                         )
    --<< UBRR Макарова Л.Ю. 15-279
                and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =acc.CACCACC  and cacccur = acc.CACCCUR
                                  and c_newdata = cg_112_35
                                  and d1 between trunc(d_create,'mm') and last_day(add_months (d_create,2))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum =35
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = cg_112_35
                                                        and a2.d_create> last_day(add_months (a1.d_create,2))
                                                )

                         )
          -->> ubrr 08.07.2016 Арсланов Д.Ф. 16-2143.2 "Тест-драйв+"
              and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =acc.CACCACC  and cacccur = acc.CACCCUR
                                  and c_newdata = '112/93'
                                  and d1 between trunc(d_create,'mm') and last_day(add_months (d_create,2))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum = 93
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = '112/93'
                                                        and a2.d_create>last_day(add_months (a1.d_create,2))
                                                )

                         )
        --<< ubrr 08.07.2016 Арсланов Д.Ф. 16-2143.2 "Тест-драйв+"
                       -->>> Pinaev https://redmine.lan.ubrr.ru/issues/25034
             /*   and not exists (select 1
                                 from xxi.au_attach_obg au
                                where au.caccacc = acc.cACCacc
                                  and au.cacccur = acc.cACCcur
                                  and add_months(last_day(d_create),2) > d1
                                  and i_table = 304
                                  and au.c_newdata = '112/35' )*/
                                  --<<< Pinaev https://redmine.lan.ubrr.ru/issues/25034
                -- UBRR Pashevich AO 14-992

                -- > y.metalnikov@i-sys.ru 11/12/13 rm 12-2172
                AND NOT exists (SELECT 1
                                 FROM gac
                                WHERE cgacacc = acc.cACCacc
                                  AND cgaccur = acc.cACCcur
                                  AND igaccat = 112
                                  AND igacnum = 40
                                  AND exists (SELECT 1
                                                FROM xxi.au_attach_obg au
                                               WHERE au.caccacc = acc.cACCacc
                                                 AND au.cacccur = acc.cACCcur
                                                 AND au.i_table = 304
                                                 AND au.d_create <= d2
                                                 AND add_months(last_day(au.d_create),11) > d1
                                                 AND au.c_newdata = '112/40'))
                AND NOT exists (SELECT 1
                                 FROM xxi.au_attach_obg au_s
                                INNER JOIN xxi.au_attach_obg au_e
                                   ON au_e.caccacc = au_s.caccacc
                                  AND au_e.cacccur = au_s.cacccur
                                  AND au_e.i_table = 304
                                  AND au_e.C_OLDDATA = '112/40'
                                WHERE au_s.caccacc = acc.cACCacc
                                  AND au_s.cacccur = acc.cACCcur
                                  AND au_s.i_table = 304
                                  AND au_s.d_create <= d2
                                  AND au_e.d_create >= d1
                                  AND add_months(last_day(au_s.d_create),11) > d1
                                  AND au_s.c_newdata = '112/40')
                -- < y.metalnikov@i-sys.ru 11/12/13
               and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum = 50
                                  and exists (select 1
                                                from xxi.au_attach_obg au
                                               where au.caccacc = acc.cACCacc
                                                 and au.cacccur = acc.cACCcur
                                                 and i_table = 304
                                                 and d_create <= d2
                                                 and add_months(last_day(d_create),5) > d1
                                                 and au.c_newdata = '112/50'))
               and not exists (select 1
                                 from xxi.au_attach_obg au
                                where au.caccacc = acc.cACCacc
                                  and au.cacccur = acc.cACCcur
                                  and add_months(last_day(d_create),5) > d1
                                  and d_create <= d2
                                  and i_table = 304
                                  and au.c_newdata = '112/50' )
               -->> ubrr korolkov 12-1657(#9707)
               and not exists (select 'x'
                                 from xxi.au_attach_obg au
                                where au.caccacc = acc.cACCacc
                                  and au.cacccur = acc.cACCcur
                                  and add_months(last_day(au.d_create),3) > d1
                                  and au.d_create <= d2
                                  and au.i_table = v_autab
                                  and au.c_newdata = cg_112_59
                                  and not exists
                                    (select 'x' from xxi.au_attach_obg au2
                                      where au2.caccacc = au.caccacc
                                        and au2.cacccur = au.cacccur
                                        and au2.c_olddata = cg_112_59
                                        and au2.d_create >= au.d_create
                                        and add_months(au2.d_create,1) <= d2) )
               --<< ubrr korolkov 12-1657(#9707)
               and not exists (select 1
                                 from xxi.au_attach_obg au
                                where au.caccacc = acc.cACCacc
                                  and au.cacccur = acc.cACCcur
                                  and d_create > d1
                                  and d_create < d2
                                  and i_table = 304
                                  and au.c_newdata in (-- '112/35', UBRR Pashevich AO 14-992
                                                       '112/36','112/37','112/38'/*,'112/39'*/,'112/40','112/45'))
               and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum in (6,8)
                                  and exists (select 1
                                                from xxi.au_attach_obg au
                                               where au.caccacc = acc.caccacc --cgacacc
                                                 and au.cacccur = acc.cacccur --cgaccur
                                                 and trunc(au.d_create) <= d2
                                                 and ( c_newdata ='112/6' or c_newdata ='112/8')
                                             ))
             -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
             and not exists ( select 1
                                from gac g
                                    ,ubrr_rko_exinc_catgr e
                               where g.igaccat   = e.icat
                                 and g.igacnum   = e.igrp
                                 and e.ccom_type = 'RKB'
                                 and e.exinc     = 0
                                 and g.cgacacc   = acc.caccacc
                                 and g.cgaccur   = acc.cACCcur
                                 and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.caccacc
                                                and au.cacccur = acc.cacccur
                                                and au.i_table = 304
                                                and trunc(au.d_create) <= d2
                                                and au.c_newdata = g.igaccat||'/'||g.igacnum
                                                and trunc(au.d_create) between nvl(e.date_start, dg_date_start) and nvl(e.date_end, dg_date_end) --<<22.01.2020 Баязитов [19-64846]
                                            )
                            )
             --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
               and not exists (select 1
                                 from sbs
                                where csbsdo like 'RK%'
                                  and csbsacc = acc.caccacc)
---<<<UBRR Pashevich A. #12-508
               -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
               and not exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                             UBRR_UNIQUE_ACC_COMMS uuac 
                                   where caccacc = uutc.cacc 
                                     and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF 
                                     and lc_idsmr = uutc.idsmr 
                                     and uutc.status = 'N'
                                     and uutc.uuta_id = uuac.uuta_id
                                     and uuac.com_type in ('RKBP','RKBK','RKO')
                                 ) 
               --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
--->>>UBRR Pashevich A. #12-508
---<<<UBRR Pashevich A. #12-1530
              and not exists (select 1
                               from xxi.au_attach_obg au
                                 where     au.caccacc  = acc.caccacc
                                        and au.cacccur = acc.cacccur
                                        and c_newdata ='105/11'
                                        and trunc(au.d_create) <= to_date('18042013','dd.mm.yyyy')
                                        and exists (select 1
                                                     from ubrr_trn_old_new_v --xxi.V_TRN_PART_CURRENT -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                                                      where     ctrnaccd   = acc.caccacc
                                                            and ctrncurc   = acc.cacccur
                                                            and dtrntran between d1 and d2+86399/86400
                                                            and ctrnidopen = 'CORREQTS')
                                        and d2 <=to_date('31072013','dd.mm.yyyy hh24:mi:ss')

                              )
--->>>UBRR Pashevich A. #12-1530
-- (нач.) Новолодский А. Ю. 18.02.2015 12-2313
            --and ubrr_xxi5.ubrr_rko.iseqrexistscatgrlist(ctrnaccd, ctrncur, d1, d2) is null
               and not exists (select 1
                                 from sbs
                                where csbsdo like 'R_EKV%'
                                  and csbsacc = ctrnaccd)
-->>--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты

              and not exists (select 1
                                from sbs
                               where csbsdo like 'R_Onl%'
                                 and csbsacc=ctrnaccd)
--<<--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты
-- (кон.) Новолодский А. Ю. 18.02.2015 12-2313
            group by ctrnaccd,ctrncur,iACCotd, caccmail
            UNION all
            select /*+ index( trn I_TRN_OLD_NEW_DACC )*/ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                   ctrnaccc acc, ctrncur, count(1) c, iaccotd, 0 cd, 0 md, count(1) cc, sum(mtrnsum) mc, caccmail
            from acc,
                 /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v trn -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
            where
            -- ubrr katyuhin >>>
              --1=0 and
                  acc.caccacc LIKE acc_1
              and acc.cacccur = 'RUR'
              and acc.caccprizn <> 'З'
              and acc.iaccbs2 NOT IN (40813,40817,40818,40820
                                     -- UBRR Pashevich A. 12-101
                                     ,42309,40810,40811,40812,40823,40824 -->><<-- ubrr 12.07.2016 Арсланов Д.Ф. #30780
                                     -- UBRR Pashevich A. 12-101
                                     )
              and substr(acc.caccacc,14,1) <> '4'
              and substr(acc.caccacc,1,3) not in ('401','402','403','404','409')
              and acc.caccacc like '40___810%'
              AND acc.caccacc NOT LIKE '40821________7%' -- 29/12/2011 Бездворный А.В. комиссии по 40821 (контрагенты) по РКО не считаем
            -- ubrr katyuhin <<<
              and trn.ctrnaccc = acc.caccacc
              and trn.ctrncurc = acc.cacccur
              and trn.dtrntran between d1 and d2+86399/86400
              -->> 20.09.2017 ubrr korolkov 15-1436
              and not (ctrnaccd like '30232%' and lower(replace(ctrnpurp, ' ')) like 'возм%термин%')
              --<< 20.09.2017 ubrr korolkov 15-1436
              and trn.itrntype in (-7, 2, 5, 10, 12, 51, 53, 55)
              and substr(nvl(trn.ctrnacca,0),1,5) not in ('47426', '70606')
              and substr(trn.ctrnaccd,1,5) not in ('47426', '70606')
              and not exists (select 1
                                from sbs
                               where csbsdo like 'RK%'
                                 and csbsacc=acc.caccacc)
                -->> 25.06.2018 Пинаев Д.Е. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)
                and not exists (select 1
                             from gac
                            where cgacacc = acc.cACCacc
                              and cgaccur = acc.cACCcur
                              and igaccat = 112
                              and igacnum = 97
                              and exists (select 1
                                            from xxi.au_attach_obg au
                                           where au.caccacc = acc.caccacc
                                             and au.CACCCUR = acc.cacccur
                                             and au.i_table = 304
                                             and trunc(d_create) <= d2
                                              and c_newdata ='112/97'))
                --<< 25.06.2018 Пинаев Д.Е. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)
                -->> 24.10.2018 Баязитов [18-56613]  ТП "Сбрось лишнее" (по типу ТП "Экспресс") для НТК с 01.11.18
                and not exists (select 1
                             from gac
                            where cgacacc = acc.cACCacc
                              and cgaccur = acc.cACCcur
                              and igaccat = 112
                              and igacnum = 98
                              and exists (select 1
                                            from xxi.au_attach_obg au
                                           where au.caccacc = acc.caccacc
                                             and au.CACCCUR = acc.cacccur
                                             and au.i_table = 304
                                             and trunc(d_create) <= d2
                                              and c_newdata ='112/98'))
                --<< 24.10.2018 Баязитов [18-56613]  ТП "Сбрось лишнее" (по типу ТП "Экспресс") для НТК с 01.11.18

-->>01.09.2015  Макарова Л.Ю.        [15-921] АБС: Ведение счета бесплатно
               and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 114
                                  and igacnum = 10
                                  and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata = '114/10'))
-->> 11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю.
/* and  not exists (select 1
                          from gac g
                           where     cgacacc = cACCacc
                                 and cgaccur = cACCcur
                                 and igaccat = 112
                                 and igacnum = 92
                                 and exists (select 1
                                              from xxi.au_attach_obg au
                                               where     au.caccacc = cACCacc
                                                     and au.cacccur = cACCcur
                                                     and i_table = 304
                                                     and d_create<=d2 and au.c_newdata = '112/92'))*/--чтобы считалось по НТК, если стоит 112/92

--<< 11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю.
--<<01.09.2015  Макарова Л.Ю.        [15-921] АБС: Ведение счета бесплатно
 -->> ubrr Макарова Л.Ю. 15-223 ТП "Все в дом", ТП "Все в дом премиум"
  and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum = 74
                                  and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata = '112/74'))
and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum = 73
                            and exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 333
                                  and igacnum = 4)
                             and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata = '112/73')
                             and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata = '333/4'))
and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum = 74
                            and exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 333
                                  and igacnum = 4)
                             and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata = '112/74')
                             and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata = '333/4'))
--<< ubrr Макарова Л.Ю. 15-223 ТП "Все в дом", ТП "Все в дом премиум"
              and not exists (select 1
                                from gac
                               where cgacacc = acc.caccacc
                                 and cgaccur = acc.cacccur
                                 and igaccat = 112
                                 and igacnum in (1,3,4,5,7,10,13,15,16,17,19,20,21,22,23,24,25,31,36,37,38,39,
                                                 57 -- UBRR  Pashevich A. 12-1750
                                                )
                              )
-- UBRR Pashevich A. 14-406
             and not exists (select 1
                              from gac g
                                 where     cgacacc = acc.caccacc
                                       and cgaccur = acc.cacccur
                                       and igaccat = 112
                                       and igacnum = 67
                                       and exists (select 1
                                                    from xxi.au_attach_obg au
                                                     where     au.caccacc = acc.cACCacc
                                                           and au.cacccur = acc.cACCcur
                                                           and i_table = 304
                                                            and d_create<=d2+86399/86400/*UBRR Pashevich AO 29.10.2014*/ and au.c_newdata = '112/67')
                                       and exists (Select 1
                                                    From gac
                                                     Where     cgacacc = acc.cACCacc
                                                           and cgaccur = acc.cACCcur
                                                           and igaccat=105
                                                           and igacnum in (2,11))
                               )
-- UBRR Pashevich A. 14-406
               and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum = 45
                                  and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata like '112/45'))
                -->> 26.05.2015 ubrr korolkov 15-453
                and not exists (select 1
                                from gac
                                where cgacacc = acc.cACCacc
                                and cgaccur = acc.cACCcur
                                and igaccat = 112
                                and igacnum in (78,79,80,
                                99,100,101,102,103, --27.12.2018 Баязитов [15-43]
                                104,105,106,        -- Бизнес  Премиум  3, 6, 12  -- ubrr 31.05.2019 Ризанов Р.Т. [19-59153] АБС. Лимит платежей в пакеты услуг "Бизнес-Класс 3,6,12"
                                108, --09.01.2020 Баязитов [19-70025] АБС: Тарифный план "Промо Online"
                                94)--24.09.2016 ubrr Maкарова Л.Ю. 16-2653 АБС: Кат/гр 112/94 для пакета услуг "Бизнес-комплект"
                                and exists (select 1
                                            from xxi.au_attach_obg au
                                            where au.caccacc = acc.cACCacc
                                            and au.cacccur = acc.cACCcur
                                            and i_table = 304
                                            and trunc(d_create) <= d2
                                            and au.c_newdata like '112/'||to_char(gac.igacnum)))
                --<< 26.05.2015 ubrr korolkov 15-453
-->> 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
               and not exists (select 1
                                 from gac
                                 where cgacacc = acc.cACCacc
                                   and cgaccur = acc.cACCcur
                                   and igaccat = 114
                                   and igacnum = 16)
--<< 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
-->> ubrr Макарова Л.Ю. 15-231 ТП "Онлайн бесплатно"
               and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum = 76
                                  and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata = '112/76'))
--<< ubrr Макарова Л.Ю. 15-231 ТП "Онлайн бесплатно"
              and not exists (select 1
                                from gac
                               where cgacacc = acc.cACCacc
                                 and cgaccur = acc.cACCcur
                                 and igaccat = 333
                                 and igacnum = 2)
              and not exists (select 1
                                from xxi.au_attach_obg au
                               where au.caccacc = acc.cACCacc
                                 and au.cacccur = acc.cACCcur
                                 and d_create > d1
                                 and d_create < d2
                                 and i_table = 304
                                 and au.c_newdata in (--'112/35', UBRR Pashevich AO 14-992
                                                      '112/36','112/37','112/38',/*'112/39',*/'112/40','112/45'))
              -- UBRR Pashevich AO 14-992
              and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =acc.CACCACC  and cacccur = acc.CACCCUR
                                  and c_newdata = cg_112_72
                                  and d1 between trunc(d_create,'mm') and last_day ( add_months (d_create,5) )
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum =72
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = cg_112_72
                                                        and a2.d_create> last_day(add_months (a1.d_create,5))
                                                )
                         )
                         -->> UBRR Макарова Л.Ю. 15-279
    and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =acc.CACCACC  and cacccur = acc.CACCCUR
                                  and c_newdata = cg_112_75
                                  and d1 between trunc(d_create,'mm') and last_day(add_months (d_create,5))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum =75
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = cg_112_75
                                                        and a2.d_create>last_day(add_months (a1.d_create,5))
                                                )
                         )
    --<< UBRR Макарова Л.Ю. 15-279
              and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =acc.CACCACC  and cacccur = acc.CACCCUR
                                  and c_newdata = cg_112_35
                                  and d1 between trunc(d_create,'mm') and last_day (add_months (d_create,2))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum =35
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = cg_112_35
                                                        and a2.d_create> last_day(add_months (a1.d_create,2))
                                                )

                         )
          -->> ubrr 08.07.2016 Арсланов Д.Ф. 16-2143.2 "Тест-драйв+"
              and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =acc.CACCACC  and cacccur = acc.CACCCUR
                                  and c_newdata = '112/93'
                                  and d1 between trunc(d_create,'mm') and last_day(add_months (d_create,2))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum = 93
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = '112/93'
                                                        and a2.d_create>last_day(add_months (a1.d_create,2))
                                                )

                         )
        --<< ubrr 08.07.2016 Арсланов Д.Ф. 16-2143.2 "Тест-драйв+"

              /*and not exists (select 1
                                from xxi.au_attach_obg au
                               where au.caccacc = acc.cACCacc
                                 and au.cacccur = acc.cACCcur
                                 and add_months(last_day(d_create),2) > d1
                                 and i_table = 304
                                 and au.c_newdata = '112/35' )*/
               -- UBRR Pashevich AO 14-992
               -- > y.metalnikov@i-sys.ru 11/12/13 rm 12-2172
               and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum = 40
                                  and exists (select 1
                                                from xxi.au_attach_obg au
                                               where au.caccacc = acc.cACCacc
                                                 and au.cacccur = acc.cACCcur
                                                 and i_table = 304
                                                 and d_create <= d2
                                                 and add_months(last_day(d_create),11) > d1
                                                 and au.c_newdata = '112/40'))
               and not exists (select 1
                                 from xxi.au_attach_obg au_s
                                INNER JOIN xxi.au_attach_obg au_e ON
                                  au_e.caccacc = au_s.caccacc
                                 and au_e.cacccur = au_s.cacccur
                                 and au_e.i_table = 304
                                 -- UBRR Pashevich A. исправление ошибки https://redmine.lan.ubrr.ru/issues/11284
                                 and au_e.c_olddata = '112/40'
                                 -- UBRR Pashevich A. исправление ошибки https://redmine.lan.ubrr.ru/issues/11284
                               where au_s.caccacc = acc.cACCacc
                                 and au_s.cacccur = acc.cACCcur
                                 and au_s.i_table = 304
                                 and au_s.d_create <= d2
                                 and au_e.d_create >= d1
                                 and au_s.c_newdata = '112/40')
                -- < y.metalnikov@i-sys.ru 11/12/13
              and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 112
                                  and igacnum = 50
                                  and exists (select 1
                                                from xxi.au_attach_obg au
                                               where au.caccacc = acc.cACCacc
                                                 and au.cacccur = acc.cACCcur
                                                 and i_table = 304
                                                 and d_create <= d2
                                                 and add_months(last_day(d_create),5) > d1
                                                 and au.c_newdata = '112/50'))

               and not exists (select 1
                                 from xxi.au_attach_obg au
                                where au.caccacc = acc.cACCacc
                                  and au.cacccur = acc.cACCcur
                                  and add_months(last_day(d_create),5) > d1
                                  and d_create <= d2
                                  and i_table = 304
                                  and au.c_newdata = '112/50' )
               -->> ubrr korolkov 12-1657(#9707)
               and not exists (select 'x'
                                 from xxi.au_attach_obg au
                                where au.caccacc = acc.cACCacc
                                  and au.cacccur = acc.cACCcur
                                  and add_months(last_day(au.d_create),3) > d1
                                  and au.d_create <= d2
                                  and au.i_table = v_autab
                                  and au.c_newdata = cg_112_59
                                  and not exists
                                    (select 'x' from xxi.au_attach_obg au2
                                      where au2.caccacc = au.caccacc
                                        and au2.cacccur = au.cacccur
                                        and au2.c_olddata = cg_112_59
                                        and au2.d_create >= au.d_create
                                        and add_months(au2.d_create,1) <= d2) )
               --<< ubrr korolkov 12-1657(#9707)
              and exists (select 1
                            from gac
                           where cgacacc = acc.caccacc
                             and cgaccur = acc.cacccur
                             and igaccat = 105
                             and igacnum in (1,2,8,9,
-- Ubrr Pashevich A. 12-1530
                                             11
-- Ubrr Pashevich A. 12-1530
))
              and not exists (select 1
                                from gac
                               where cgacacc = acc.caccacc
                                 and cgaccur = acc.cacccur
                                 and igaccat = 112
                                 and igacnum in (6,8)
                                 and  exists (
                                              select 1
                                              from xxi.au_attach_obg au
                                              where     au.caccacc = acc.caccacc
                                                    and au.cacccur = acc.cacccur
                                                    and trunc(au.d_create) <= d2
                                                    and ( c_newdata ='112/6' or c_newdata ='112/8')
                                             ))
---<<<UBRR Pashevich A. #12-508
              -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
              and not exists ( select 1
                                 from gac g
                                     ,ubrr_rko_exinc_catgr e
                                where g.igaccat   = e.icat
                                  and g.igacnum   = e.igrp
                                  and e.ccom_type = 'RKB'
                                  and e.exinc     = 0
                                  and g.cgacacc   = acc.caccacc
                                  and g.cgaccur   = acc.cACCcur
                                  and exists (select 1
                                                from xxi.au_attach_obg au
                                               where au.caccacc = acc.caccacc
                                                 and au.cacccur = acc.cacccur
                                                 and au.i_table = 304
                                                 and trunc(au.d_create) <= d2
                                                 and au.c_newdata = g.igaccat||'/'||g.igacnum
                                                 and trunc(au.d_create) between nvl(e.date_start, dg_date_start) and nvl(e.date_end, dg_date_end) --<<22.01.2020 Баязитов [19-64846]
                                             )
                             )
              --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
               -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
               and not exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                             UBRR_UNIQUE_ACC_COMMS uuac 
                                   where caccacc = uutc.cacc 
                                     and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF 
                                     and lc_idsmr = uutc.idsmr 
                                     and uutc.status = 'N'
                                     and uutc.uuta_id = uuac.uuta_id
                                     and uuac.com_type in ('RKBP','RKBK','RKO')
                                 )                 
               --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
--->>>UBRR Pashevich A. #12-508
---<<<UBRR Pashevich A. #12-1530
              and not exists (select 1
                               from xxi.au_attach_obg au
                                 where     au.caccacc  = acc.caccacc
                                        and au.cacccur = acc.cacccur
                                        and c_newdata ='105/11'
                                        and trunc(au.d_create) <= to_date('18042013','dd.mm.yyyy')
                                        and exists (select 1
                                                     from ubrr_trn_old_new_v --xxi.V_TRN_PART_CURRENT -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                                                      where     ctrnaccd   = acc.caccacc
                                                            and ctrncurc   = acc.cacccur
                                                            and dtrntran between d1 and d2+86399/86400
                                                            and ctrnidopen = 'CORREQTS')
                                        and d2<=to_date('31072013','dd.mm.yyyy hh24:mi:ss')
                              )
--->>>UBRR Pashevich A. #12-1530
-- (нач.) Новолодский А. Ю. 18.02.2015 12-2313
          --and ubrr_xxi5.ubrr_rko.iseqrexistscatgrlist(ctrnaccc, ctrncur, d1, d2) is null
         and not exists (select 1
                 from sbs
                where csbsdo like 'R_EKV%'
                  and csbsacc = ctrnaccc)
-->>--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты

              and not exists (select 1
                                from sbs
                               where csbsdo like 'R_Onl%'
                                 and csbsacc=ctrnaccc)
--<<--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты
-- (кон.) Новолодский А. Ю. 18.02.2015 12-2313
    group by ctrnaccc,ctrncur,iACCotd, caccmail
)
group by acc,ctrncur,iaccotd, caccmail);

    l_cnt_rec := sql%rowcount; -- 24.07.2019 Ризанов Р.Т. [19-62974] III ЭТАП УБРИР. Распространение Пакетов услуг УБРиР на ВУЗ

    DBMS_TRANSACTION.COMMIT;

    ubrr_bnkserv_calc_new_lib.WriteProtocol('Загружено в SBS записей по комиссии "Ведение расчётного счёта с использованием СУД" [RKB]: ' || l_cnt_rec);     -- 24.07.2019 Ризанов Р.Т. [19-62974] III ЭТАП УБРИР. Распространение Пакетов услуг УБРиР на ВУЗ


----------------------------------------------------------------------------------------------------------------------------
-->>--ubrr Салахеев Р.Р. 14-406
/*!!!*/
   INSERT INTO SBS
   ( cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, cSBSdo ,iSBSdebdoc,mSBSdebob,iSBScreddoc,mSBScredob)
   (select to_char(sysdate,'HH24:MI:SS'), acc,ctrncur,
           DECODE(caccmail, 'K',ubrr_rko.F_GetComSum (p_com => 'RKBK_Just',p_otd => iaccotd),ubrr_rko.F_GetComSum (p_com => 'RKBP_Just',p_otd => iaccotd)),
            'RKB'||DECODE(caccmail, 'K', 'K', 'P'),
             sum(cd),sum(md),sum(cc),sum(mc)
      from (
             select /*+ index( trn I_TRN_OLD_NEW_ADT )*/ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                    ctrnaccd acc,ctrncur,count(1) c,iaccotd,count(1) cd,sum(mtrnsum) md ,0 cc,0 mc, caccmail
             from acc,
                  ubrr_trn_old_new_v trn --xxi.V_TRN_PART_CURRENT -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
             where     acc.caccacc LIKE acc_1
                   and acc.cacccur = 'RUR'
               and acc.caccprizn <> 'З'
               and acc.iaccbs2 NOT IN (40813, 40817, 40818, 40820,42309
                                      ,40810,40811,40812,40823,40824 -->><<-- ubrr 12.07.2016 Арсланов Д.Ф. #30780
                                      )
               and SUBSTR (acc.caccacc, 1, 3) NOT IN ('401', '402', '403', '404', '409')
               AND acc.caccacc NOT LIKE '40821________7%'
               and trn.ctrnaccd = acc.cACCacc
               and trn.ctrncur = acc.cACCcur
               and dtrntran between d1 and d2+86399/86400
               -->> 20.09.2017 ubrr korolkov 15-1436
               and substr(case when iTrnType in (5, 50, 53, 52, 55, 17, 41, 42, 43, 44) then nvl(cTrnClient_Acc, cTrnAccC) when cTrnMfoA is null then nvl(cTrnAccA, cTrnAccC) else cTrnAccA end, 1, 5) not in ('60309', '60322')
               --<< 20.09.2017 ubrr korolkov 15-1436
               and (  (    itrntype in (2,3,4,11,14,15,21,22,23,25,28)
                       and (   substr(itrnba2c,1,3) in (111,301,302,303,401,402,403,404,405,406,407,423,426)
                            or itrnba2c in (10000,40802,40807,40817,40818,40820,40911))
                        and exists (select /*+ index( t I_TRN_OLD_NEW_DAC )*/ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                                           1
                                      from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v t -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                                     where t.ctrnaccd = trn.ctrnaccd
                                       and t.ctrncur = trn.ctrncur
                                       and dtrntran between d1 and d2+86399/86400
                                       and itrnsop=4))
                    or (    itrntype in (9,13))
                    )
               and not (itrntype=4 and itrnsop=51 and ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
  -->> ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
         and not (itrntype in (22,25) and regexp_like(ctrnpurp, '^ *(|! *)0406')-- ubrr 24.05.2017 Макарова Л.Ю. [14-985.18] Некорректное списание комиссии за проведение платежей ЮЛ и ИП
                  and exists (select 1 from xxi."smr" where csmrmfo8 = ctrnmfoa))
         --<< ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
               and exists (select 1
                            from gac
                             where     cgacacc = acc.caccacc
                                   and cgaccur = acc.cacccur
                                   and igaccat = 112
                                   and igacnum = 67
                                   and exists (select 1
                                                from xxi.au_attach_obg au
                                                 where     au.caccacc = acc.cACCacc
                                                       and au.cacccur = acc.cACCcur
                                                       and i_table = 304
                                                       and d_create<=d2+ 86399/86400/*UBRR Pashevich AO 29.10.2014*/ and au.c_newdata = '112/67')
                            )
               and exists (select 1
                            from gac
                             where     cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat=105
                                  and igacnum in (2,11)
                           )
               and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 333
                                  and igacnum = 2)
                -->> 25.06.2018 Пинаев Д.Е. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)
                and not exists (select 1
                             from gac
                            where cgacacc = acc.cACCacc
                              and cgaccur = acc.cACCcur
                              and igaccat = 112
                              and igacnum = 97
                              and exists (select 1
                                            from xxi.au_attach_obg au
                                           where au.caccacc = acc.caccacc
                                             and au.CACCCUR = acc.cacccur
                                             and au.i_table = 304
                                             and trunc(d_create) <= d2
                                              and c_newdata ='112/97'))
                --<< 25.06.2018 Пинаев Д.Е. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)

                -->> 24.10.2018 Баязитов [18-56613] ТП "Сбрось лишнее" (по типу ТП "Экспресс") для НТК с 01.11.18
                and not exists (select 1
                             from gac
                            where cgacacc = acc.cACCacc
                              and cgaccur = acc.cACCcur
                              and igaccat = 112
                              and igacnum = 98
                              and exists (select 1
                                            from xxi.au_attach_obg au
                                           where au.caccacc = acc.caccacc
                                             and au.CACCCUR = acc.cacccur
                                             and au.i_table = 304
                                             and trunc(d_create) <= d2
                                              and c_newdata ='112/98'))
                --<< 24.10.2018 Баязитов [18-56613] ТП "Сбрось лишнее" (по типу ТП "Экспресс") для НТК с 01.11.18

                -->>27.12.2018 Баязитов [15-43]  АБС: Новый пакет услуг с авансовой оплатой за пакет платежей
                and not exists (select 1
                                from gac
                                where cgacacc = acc.cACCacc
                                and cgaccur = acc.cACCcur
                                and igaccat = 112
                                and igacnum in (78,79,80,99,100,101,102,103
                                                ,104,105,106    -- Бизнес  Премиум  3, 6, 12  -- ubrr 31.05.2019 Ризанов Р.Т. [19-59153] АБС. Лимит платежей в пакеты услуг "Бизнес-Класс 3,6,12"
                                               )
                                and exists (select 1
                                            from xxi.au_attach_obg au
                                            where au.caccacc = acc.cACCacc
                                            and au.cacccur = acc.cACCcur
                                            and i_table = 304
                                            and trunc(d_create) <= d2
                                            and au.c_newdata like '112/'||to_char(gac.igacnum)))
                --<<27.12.2018 Баязитов [15-43]  АБС: Новый пакет услуг с авансовой оплатой за пакет платежей
-->> 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
               and not exists (select 1
                                 from gac
                                 where cgacacc = acc.cACCacc
                                   and cgaccur = acc.cACCcur
                                   and igaccat = 114
                                   and igacnum = 16)
--<< 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов

 -->> UBRR Макарова Л.Ю. 15-42 доп.треб. https://redmine.lan.ubrr.ru/issues/19917#note-36
             and not exists (select 1
                          from gac
                         where cgacacc = acc.cACCacc
                           and cgaccur = acc.cACCcur
                           and igaccat = 131
                           and exists (select 1
                                         from xxi.au_attach_obg au
                                        where au.caccacc = acc.cACCacc
                                          and au.cacccur = acc.cACCcur
                                          and i_table = 304
                                          and d_create <= d2
                                          and au.c_newdata like '131%'))
             -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
             and not exists ( select 1
                                from gac g
                                    ,ubrr_rko_exinc_catgr e
                               where g.igaccat   = e.icat
                                 and g.igacnum   = e.igrp
                                 and e.ccom_type = 'RKB'
                                 and e.exinc     = 0
                                 and g.cgacacc   = acc.caccacc
                                 and g.cgaccur   = acc.cACCcur
                                 and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.caccacc
                                                and au.cacccur = acc.cacccur
                                                and au.i_table = 304
                                                and trunc(au.d_create) <= d2
                                                and au.c_newdata = g.igaccat||'/'||g.igacnum
                                                and trunc(au.d_create) between nvl(e.date_start, dg_date_start) and nvl(e.date_end, dg_date_end) --<<22.01.2020 Баязитов [19-64846]
                                            )
                            )
             --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
-->> UBRR Макарова Л.Ю. 15-42 доп.треб. https://redmine.lan.ubrr.ru/issues/19917#note-36
               and not exists (select 1
                                 from sbs
                                where csbsdo like 'RK%'
                                  and csbsacc = acc.caccacc)
-->>--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты

              and not exists (select 1
                                from sbs
                               where csbsdo like 'R_Onl%'
                                 and csbsacc=ctrnaccd)
--<<--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты
               -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
               and not exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                             UBRR_UNIQUE_ACC_COMMS uuac 
                                       where caccacc = uutc.cacc 
                                         and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF 
                                         and lc_idsmr = uutc.idsmr 
                                         and uutc.status = 'N'
                                         and uutc.uuta_id = uuac.uuta_id
                                         and uuac.com_type in ('RKBP','RKBK','RKO')
                                ) 
               --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
-- (нач.) Новолодский А. Ю. 18.02.2015 12-2313
                --and ubrr_xxi5.ubrr_rko.iseqrexistscatgrlist(ctrnaccd, ctrncur, d1, d2) is null
               and not exists (select 1
                 from sbs
                where csbsdo like 'R_EKV%'
                  and csbsacc = ctrnaccd)
-- (кон.) Новолодский А. Ю. 18.02.2015 12-2313
            group by ctrnaccd,ctrncur,iACCotd, caccmail
            UNION all
            select /*+ index( trn I_TRN_OLD_NEW_ACDT )*/ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                   ctrnaccc acc, ctrncur, count(1) c, iaccotd, 0 cd, 0 md, count(1) cc, sum(mtrnsum) mc, caccmail
            from acc,
                 ubrr_trn_old_new_v trn --xxi.V_TRN_PART_CURRENT -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
            where     acc.caccacc LIKE acc_1
                  and acc.cacccur = 'RUR'
                  and acc.caccprizn <> 'З'
                  and acc.iaccbs2 NOT IN ( 40813,40817,40818,40820,42309
                                          ,40810,40811,40812,40823,40824 -->><<-- ubrr 12.07.2016 Арсланов Д.Ф. #30780
                                         )
                  and substr(acc.caccacc,14,1) <> '4'
                  and substr(acc.caccacc,1,3) not in ('401','402','403','404','409')
                  and acc.caccacc like '40___810%'
                  AND acc.caccacc NOT LIKE '40821________7%'
                  and trn.ctrnaccc = acc.caccacc
                  and trn.ctrncurc = acc.cacccur
                  and trn.dtrntran between d1 and d2+86399/86400
                  -->> 20.09.2017 ubrr korolkov 15-1436
                  and not (ctrnaccd like '30232%' and lower(replace(ctrnpurp, ' ')) like 'возм%термин%')
                  --<< 20.09.2017 ubrr korolkov 15-1436
                  and trn.itrntype in (-7, 2, 5, 10, 12, 51, 53, 55)
                  and not (trn.itrntype=4 and trn.itrnsop=51 and trn.ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
                  and substr(nvl(trn.ctrnacca,0),1,5) not in ('47426', '70606')
                  and substr(trn.ctrnaccd,1,5) not in ('47426', '70606')
                  and not exists (select 1
                                   from sbs
                                    where     csbsdo like 'RK%'
                                          and csbsacc=acc.caccacc)
                 and exists ( select 1
                               from gac
                                where     cgacacc = acc.caccacc
                                      and cgaccur = acc.cacccur
                                      and igaccat = 112
                                      and igacnum = 67
                                      and exists ( select 1
                                                    from xxi.au_attach_obg au
                                                     where     au.caccacc = acc.cACCacc
                                                          and au.cacccur = acc.cACCcur
                                                          and i_table = 304
                                                          and d_create<=d2+ 86399/86400 /*UBRR Pashevich AO 29.10.2014*/ and au.c_newdata = '112/67')
                              )
                  and exists ( select 1
                                from gac
                                 where     cgacacc = acc.cACCacc
                                       and cgaccur = acc.cACCcur
                                       and igaccat=105
                                       and igacnum in (2,11))
                  and not exists (select 1
                                   from gac
                                    where     cgacacc = acc.cACCacc
                                          and cgaccur = acc.cACCcur
                                          and igaccat = 333
                                          and igacnum = 2)

-->>01.09.2015  Макарова Л.Ю.        [15-921] АБС: Ведение счета бесплатно
               and not exists (select 1
                                 from gac
                                where cgacacc = acc.cACCacc
                                  and cgaccur = acc.cACCcur
                                  and igaccat = 114
                                  and igacnum = 10
                                  and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.cACCacc
                                                and au.cacccur = acc.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata = '114/10'))
--<<01.09.2015  Макарова Л.Ю.        [15-921] АБС: Ведение счета бесплатно
-->> UBRR Макарова Л.Ю. 15-42 доп.треб. https://redmine.lan.ubrr.ru/issues/19917#note-36
              and not exists (select 1
                          from gac
                         where cgacacc = acc.cACCacc
                           and cgaccur = acc.cACCcur
                           and igaccat = 131
                           and exists (select 1
                                         from xxi.au_attach_obg au
                                        where au.caccacc = acc.cACCacc
                                          and au.cacccur = acc.cACCcur
                                          and i_table = 304
                                          and d_create <= d2
                                          and au.c_newdata like '131%'))
-->> UBRR Макарова Л.Ю. 15-42 доп.треб. https://redmine.lan.ubrr.ru/issues/19917#note-36  -- Счета НТК по Все просто обслуживаются с 03.08.15
                -->> 24.10.2018 Баязитов [18-56613]  ТП "Сбрось лишнее" (по типу ТП "Экспресс") для НТК с 01.11.18
                and not exists (select 1
                             from gac
                            where cgacacc = acc.cACCacc
                              and cgaccur = acc.cACCcur
                              and igaccat = 112
                              and igacnum = 98
                              and exists (select 1
                                            from xxi.au_attach_obg au
                                           where au.caccacc = acc.caccacc
                                             and au.CACCCUR = acc.cacccur
                                             and au.i_table = 304
                                             and trunc(d_create) <= d2
                                              and c_newdata ='112/98'))
                --<< 24.10.2018 Баязитов [18-56613]  ТП "Сбрось лишнее" (по типу ТП "Экспресс") для НТК с 01.11.18

                -->>27.12.2018 Баязитов [15-43]  АБС: Новый пакет услуг с авансовой оплатой за пакет платежей
                and not exists (select 1
                                from gac
                                where cgacacc = acc.cACCacc
                                and cgaccur = acc.cACCcur
                                and igaccat = 112
                                and igacnum in (78,79,80,99,100,101,102,103
                                               ,104,105,106        -- Бизнес  Премиум  3, 6, 12  -- ubrr 31.05.2019 Ризанов Р.Т. [19-59153] АБС. Лимит платежей в пакеты услуг "Бизнес-Класс 3,6,12"
                                               )
                                and exists (select 1
                                            from xxi.au_attach_obg au
                                            where au.caccacc = acc.cACCacc
                                            and au.cacccur = acc.cACCcur
                                            and i_table = 304
                                            and trunc(d_create) <= d2
                                            and au.c_newdata like '112/'||to_char(gac.igacnum)))
                --<<27.12.2018 Баязитов [15-43]  АБС: Новый пакет услуг с авансовой оплатой за пакет платежей
-->> 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
               and not exists (select 1
                                 from gac
                                 where cgacacc = acc.cACCacc
                                   and cgaccur = acc.cACCcur
                                   and igaccat = 114
                                   and igacnum = 16)
--<< 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
             -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
             and not exists ( select 1
                                from gac g
                                    ,ubrr_rko_exinc_catgr e
                               where g.igaccat   = e.icat
                                 and g.igacnum   = e.igrp
                                 and e.ccom_type = 'RKB'
                                 and e.exinc     = 0
                                 and g.cgacacc   = acc.caccacc
                                 and g.cgaccur   = acc.cACCcur
                                 and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.caccacc
                                                and au.cacccur = acc.cacccur
                                                and au.i_table = 304
                                                and trunc(au.d_create) <= d2
                                                and au.c_newdata = g.igaccat||'/'||g.igacnum
                                                and trunc(au.d_create) between nvl(e.date_start, dg_date_start) and nvl(e.date_end, dg_date_end) --<<22.01.2020 Баязитов [19-64846]
                                            )
                            )
             --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
               -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
               and not exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                             UBRR_UNIQUE_ACC_COMMS uuac 
                                       where caccacc = uutc.cacc 
                                         and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF 
                                         and lc_idsmr = uutc.idsmr 
                                         and uutc.status = 'N'
                                         and uutc.uuta_id = uuac.uuta_id
                                         and uuac.com_type in ('RKBP','RKBK','RKO')
                                ) 
              --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
-- (нач.) Новолодский А. Ю. 18.02.2015 12-2313
               --and ubrr_xxi5.ubrr_rko.iseqrexistscatgrlist(ctrnaccc, ctrncur, d1, d2) is null
               and not exists (select 1
                 from sbs
                where csbsdo like 'R_EKV%'
                  and csbsacc = ctrnaccc)
-->>--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты

              and not exists (select 1
                                from sbs
                               where csbsdo like 'R_Onl%'
                                 and csbsacc=ctrnaccc)
--<<--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты
-- (кон.) Новолодский А. Ю. 18.02.2015 12-2313
    group by ctrnaccc,ctrncur,iACCotd, caccmail
)
group by acc,ctrncur,iaccotd, caccmail);
DBMS_TRANSACTION.COMMIT;
--<<--ubrr Салахеев Р.Р.



----------------------------------------------------------------------------------------------------------------------------
/* UBRR Pashevich A. № 12-508
Ведение расчетного счета
- с использованием системы удаленного доступа
- крупные клиенты
*/

  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif := 'Y';          --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)
  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif_id_check := 'N'; --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)

   INSERT INTO SBS
   ( cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, cSBSdo ,iSBSdebdoc,mSBSdebob,iSBScreddoc,mSBScredob)
   (select to_char(sysdate,'HH24:MI:SS'), acc,ctrncur,
           DECODE(caccmail, 'K', ksum,nsum),
          'RKB'||DECODE(caccmail, 'K', 'K', 'P'), -- 12.07.2012 ubrr korolkov
          sum(cd),sum(md),sum(cc),sum(mc)
      from (
             select /*+ index( trn I_TRN_OLD_NEW_ADT )*/ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                    ctrnaccd acc,ctrncur,count(1) c,iaccotd,count(1) cd,sum(mtrnsum) md ,0 cc,0 mc, caccmail,
                    -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
                    -- без предоставлением выписки и документов в бумажном виде
                    (case 
                       when ubrr_bnkserv_calc_new.CheckUniqACC(ctrnaccd,d1,'RKBK',lc_idsmr) > 0 then
                         ubrr_xxi5.UBRR_UNIQ_ACC_SUM(ctrnaccd,ctrncur,iaccotd,d1,'RKBK',sum(mtrnsum),0) 
                       else 0 
                     end)  ksum,   
                    -- с предоставлением выписки и документов в бумажном виде
                    (case 
                       when ubrr_bnkserv_calc_new.CheckUniqACC(ctrnaccd,d1,'RKBP',lc_idsmr) > 0 then
                          ubrr_xxi5.UBRR_UNIQ_ACC_SUM(ctrnaccd,ctrncur,iaccotd,d1,'RKBP',sum(mtrnsum),0)                        
                       else 0 
                     end) nsum  
                    --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
             from acc,
                  ubrr_trn_old_new_v trn --xxi.V_TRN_PART_CURRENT -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
             where
               -- ubrr katyuhin >>>
                   acc.caccacc LIKE acc_1
               and acc.cacccur = 'RUR'
               and acc.caccprizn <> 'З'
               and acc.iaccbs2 NOT IN (40813, 40817, 40818, 40820
                                       -- UBRR Pashevich A. 12-101
                                       ,42309,40810,40811,40812,40823,40824 -->><<-- ubrr 12.07.2016 Арсланов Д.Ф. #30780
                                       -- UBRR Pashevich A. 12-101
                                      )
               and SUBSTR (acc.caccacc, 1, 3) NOT IN ('401', '402', '403', '404', '409')
               AND acc.caccacc NOT LIKE '40821________7%' -- 29/12/2011 Бездворный А.В. комиссии по 40821 (контрагенты) по РКО не считаем
               -- ubrr katyuhin <<<
               and trn.ctrnaccd = acc.cACCacc
               and trn.ctrncur = acc.cACCcur
               and dtrntran between d1 and d2+86399/86400
               -->> 20.09.2017 ubrr korolkov 15-1436
               and substr(case when iTrnType in (5, 50, 53, 52, 55, 17, 41, 42, 43, 44) then nvl(cTrnClient_Acc, cTrnAccC) when cTrnMfoA is null then nvl(cTrnAccA, cTrnAccC) else cTrnAccA end, 1, 5) not in ('60309', '60322')
               --<< 20.09.2017 ubrr korolkov 15-1436
               and not (itrntype=4 and itrnsop=51 and ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
               and (  (    itrntype in (2,3,4,11,14,15,21,22,23,25,28)
                       and (   substr(itrnba2c,1,3) in (111,301,302,303,401,402,403,404,405,406,407,423,426)
                            or itrnba2c in (10000,40802,40807,40817,40818,40820,40911))
                -- Зуев А.А. раньше это условие распространялось и на кассу
                        and (exists (select /*+ index( t I_TRN_OLD_NEW_ADT )*/ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                                           1
                                      from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v t -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                                     where t.ctrnaccd = trn.ctrnaccd
                                       and t.ctrncur = trn.ctrncur
                                       and dtrntran between d1 and d2+86399/86400
                                       and itrnsop=4)
                             -->>22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
                             or exists (select /*+ index( t I_TRN_OLD_NEW_ADT )*/ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                                              1
                                          from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v t -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                                         where t.ctrnaccd = trn.ctrnaccd
                                           and t.ctrncur = trn.ctrncur
                                           and dtrntran between d1 and d2+86399/86400
                                           and itrnsop=51
                                           and itrntype=4
                                           and ctrnpurp like '0450%') ))
                             --<<22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
                    or (    itrntype in (9,13)
                        and exists (select 1
                                      from gac
                                     where cgacacc = cTRNaccd
                                       and cgaccur = ctrncur
                                       and igaccat=105
                                       and igacnum in (1,2,8,9,
--Ubrr Pashevich A. 12-1531
                                                       11
-- Ubrr Pashevich A. 12-1531
))))
  -->> ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
         and not (itrntype in (22,25) and regexp_like(ctrnpurp, '^ *(|! *)0406') -- ubrr 24.05.2017 Макарова Л.Ю. [14-985.18] Некорректное списание комиссии за проведение платежей ЮЛ и ИП
                  and exists (select 1 from xxi."smr" where csmrmfo8 = ctrnmfoa))
         --<< ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
               -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
               and exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                         UBRR_UNIQUE_ACC_COMMS uuac 
                                   where caccacc = uutc.cacc 
                                     and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF
                                     and lc_idsmr = uutc.idsmr  
                                     and uutc.status = 'N'
                                     and uutc.uuta_id = uuac.uuta_id
                                     and uuac.daily = 'N'
                                     and uuac.com_type in ('RKBP','RKBK'))  
                --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
                -->> 26.05.2015 ubrr korolkov 15-453
                and not exists (select 1
                                from gac
                                where cgacacc = acc.cACCacc
                                and cgaccur = acc.cACCcur
                                and igaccat = 112
                                and igacnum in (78,79,80,
                                99,100,101,102,103, --27.12.2018 Баязитов [15-43]
                                104,105,106,        -- Бизнес  Премиум  3, 6, 12  -- ubrr 31.05.2019 Ризанов Р.Т. [19-59153] АБС. Лимит платежей в пакеты услуг "Бизнес-Класс 3,6,12"
                                108, --09.01.2020 Баязитов [19-70025] АБС: Тарифный план "Промо Online"
                                94)--24.09.2016 ubrr Maкарова Л.Ю. 16-2653 АБС: Кат/гр 112/94 для пакета услуг "Бизнес-комплект"
                                and exists (select 1
                                            from xxi.au_attach_obg au
                                            where au.caccacc = acc.cACCacc
                                            and au.cacccur = acc.cACCcur
                                            and i_table = 304
                                            and trunc(d_create) <= d2
                                            and au.c_newdata like '112/'||to_char(gac.igacnum)))
                --<< 26.05.2015 ubrr korolkov 15-453
-->> 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
               and not exists (select 1
                                 from gac
                                 where cgacacc = acc.cACCacc
                                   and cgaccur = acc.cACCcur
                                   and igaccat = 114
                                   and igacnum = 16)
--<< 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
                -->> 25.06.2018 Пинаев Д.Е. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)
                and not exists (select 1
                             from gac
                            where cgacacc = acc.cACCacc
                              and cgaccur = acc.cACCcur
                              and igaccat = 112
                              and igacnum = 97
                              and exists (select 1
                                            from xxi.au_attach_obg au
                                           where au.caccacc = acc.caccacc
                                             and au.CACCCUR = acc.cacccur
                                             and au.i_table = 304
                                             and trunc(d_create) <= d2
                                              and c_newdata ='112/97'))
                --<< 25.06.2018 Пинаев Д.Е. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)

                -->> 24.10.2018 Баязитов [18-56613] ТП "Сбрось лишнее" (по типу ТП "Экспресс") для НТК с 01.11.18
                and not exists (select 1
                             from gac
                            where cgacacc = acc.cACCacc
                              and cgaccur = acc.cACCcur
                              and igaccat = 112
                              and igacnum = 98
                              and exists (select 1
                                            from xxi.au_attach_obg au
                                           where au.caccacc = acc.caccacc
                                             and au.CACCCUR = acc.cacccur
                                             and au.i_table = 304
                                             and trunc(d_create) <= d2
                                              and c_newdata ='112/98'))
                --<< 24.10.2018 Баязитов [18-56613] ТП "Сбрось лишнее" (по типу ТП "Экспресс") для НТК с 01.11.18
             -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
             and not exists ( select 1
                                from gac g
                                    ,ubrr_rko_exinc_catgr e
                               where g.igaccat   = e.icat
                                 and g.igacnum   = e.igrp
                                 and e.ccom_type = 'RKB'
                                 and e.exinc     = 0
                                 and g.cgacacc   = acc.caccacc
                                 and g.cgaccur   = acc.cACCcur
                                 and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.caccacc
                                                and au.cacccur = acc.cacccur
                                                and au.i_table = 304
                                                and trunc(au.d_create) <= d2
                                                and au.c_newdata = g.igaccat||'/'||g.igacnum
                                                and trunc(au.d_create) between nvl(e.date_start, dg_date_start) and nvl(e.date_end, dg_date_end) --<<22.01.2020 Баязитов [19-64846]
                                            )
                            )
             --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
-- (нач.) Новолодский А. Ю. 18.02.2015 12-2313
                 --and ubrr_xxi5.ubrr_rko.iseqrexistscatgrlist(ctrnaccd, ctrncur, d1, d2) is null
               and not exists (select 1
                 from sbs
                where csbsdo like 'R_EKV%'
                  and csbsacc = ctrnaccd)
-->>--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты

              and not exists (select 1
                                from sbs
                               where csbsdo like 'R_Onl%'
                                 and csbsacc=ctrnaccd)
--<<--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты
-- (кон.) Новолодский А. Ю. 18.02.2015 12-2313
            group by ctrnaccd,ctrncur,iACCotd,caccmail
            UNION all
            select /*+ index( trn I_TRN_OLD_NEW_DACC )*/ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                   ctrnaccc acc, ctrncur, count(1) c, iaccotd, 0 cd, 0 md, count(1) cc, sum(mtrnsum) mc, caccmail,null,null
            from acc,
                 ubrr_trn_old_new_v trn --xxi.V_TRN_PART_CURRENT -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
            where
            -- ubrr katyuhin >>>
                  acc.caccacc LIKE acc_1
              and acc.cacccur = 'RUR'
              and acc.caccprizn <> 'З'
              and acc.iaccbs2 NOT IN (40813,40817,40818,40820
                                      -- UBRR Pashevich A. 12-101
                                      ,42309,40810,40811,40812,40823,40824 -->><<-- ubrr 12.07.2016 Арсланов Д.Ф. #30780
                                      -- UBRR Pashevich A. 12-101
                                     )
              and substr(acc.caccacc,14,1) <> '4'
              and substr(acc.caccacc,1,3) not in ('401','402','403','404','409')
              and acc.caccacc like '40___810%'
              AND acc.caccacc NOT LIKE '40821________7%' -- 29/12/2011 Бездворный А.В. комиссии по 40821 (контрагенты) по РКО не считаем
            -- ubrr katyuhin <<<
              and trn.ctrnaccc = acc.caccacc
              and trn.ctrncurc = acc.cacccur
              and trn.dtrntran between d1 and d2+86399/86400
              -->> 20.09.2017 ubrr korolkov 15-1436
              and not (ctrnaccd like '30232%' and lower(replace(ctrnpurp, ' ')) like 'возм%термин%')
              --<< 20.09.2017 ubrr korolkov 15-1436
              and trn.itrntype in (-7, 2, 5, 10, 12, 51, 53, 55)
              and substr(nvl(trn.ctrnacca,0),1,5) not in ('47426', '70606')
              and substr(trn.ctrnaccd,1,5) not in ('47426', '70606')
              and not exists (select 1
                                from sbs
                               where csbsdo like 'RK%'
                                 and csbsacc=acc.caccacc)
              -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
              and exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                        UBRR_UNIQUE_ACC_COMMS uuac 
                                   where caccacc = uutc.cacc 
                                     and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF 
                                     and lc_idsmr = uutc.idsmr
                                     and uutc.status = 'N'
                                     and uutc.uuta_id = uuac.uuta_id
                                     and uuac.daily = 'N'
                                     and uuac.com_type in ('RKBP','RKBK'))  
                --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
                -->> 26.05.2015 ubrr korolkov 15-453
                and not exists (select 1
                                from gac
                                where cgacacc = acc.cACCacc
                                and cgaccur = acc.cACCcur
                                and igaccat = 112
                                and igacnum in (78,79,80,
                                99,100,101,102,103, --27.12.2018 Баязитов [15-43]
                                104,105,106,        -- Бизнес  Премиум  3, 6, 12  -- ubrr 31.05.2019 Ризанов Р.Т. [19-59153] АБС. Лимит платежей в пакеты услуг "Бизнес-Класс 3,6,12"
                                108, --09.01.2020 Баязитов [19-70025] АБС: Тарифный план "Промо Online"
                                94)--24.09.2016 ubrr Maкарова Л.Ю. 16-2653 АБС: Кат/гр 112/94 для пакета услуг "Бизнес-комплект"
                                and exists (select 1
                                            from xxi.au_attach_obg au
                                            where au.caccacc = acc.cACCacc
                                            and au.cacccur = acc.cACCcur
                                            and i_table = 304
                                            and trunc(d_create) <= d2
                                            and au.c_newdata like '112/'||to_char(gac.igacnum)))
                --<< 26.05.2015 ubrr korolkov 15-453
-->> 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
               and not exists (select 1
                                 from gac
                                 where cgacacc = acc.cACCacc
                                   and cgaccur = acc.cACCcur
                                   and igaccat = 114
                                   and igacnum = 16)
--<< 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
                -->> 25.06.2018 Пинаев Д.Е. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)
                and not exists (select 1
                             from gac
                            where cgacacc = acc.cACCacc
                              and cgaccur = acc.cACCcur
                              and igaccat = 112
                              and igacnum = 97
                              and exists (select 1
                                            from xxi.au_attach_obg au
                                           where au.caccacc = acc.caccacc
                                             and au.CACCCUR = acc.cacccur
                                             and au.i_table = 304
                                             and trunc(d_create) <= d2
                                              and c_newdata ='112/97'))
                --<< 25.06.2018 Пинаев Д.Е. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)
                -->> 24.10.2018 Баязитов [18-56613] ТП "Сбрось лишнее" (по типу ТП "Экспресс") для НТК с 01.11.18
                and not exists (select 1
                             from gac
                            where cgacacc = acc.cACCacc
                              and cgaccur = acc.cACCcur
                              and igaccat = 112
                              and igacnum = 98
                              and exists (select 1
                                            from xxi.au_attach_obg au
                                           where au.caccacc = acc.caccacc
                                             and au.CACCCUR = acc.cacccur
                                             and au.i_table = 304
                                             and trunc(d_create) <= d2
                                              and c_newdata ='112/98'))
                --<< 24.10.2018 Баязитов [18-56613] ТП "Сбрось лишнее" (по типу ТП "Экспресс") для НТК с 01.11.18
             -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
             and not exists ( select 1
                                from gac g
                                    ,ubrr_rko_exinc_catgr e
                               where g.igaccat   = e.icat
                                 and g.igacnum   = e.igrp
                                 and e.ccom_type = 'RKB'
                                 and e.exinc     = 0
                                 and g.cgacacc   = acc.caccacc
                                 and g.cgaccur   = acc.cACCcur
                                 and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = acc.caccacc
                                                and au.cacccur = acc.cacccur
                                                and au.i_table = 304
                                                and trunc(au.d_create) <= d2
                                                and au.c_newdata = g.igaccat||'/'||g.igacnum
                                                and trunc(au.d_create) between nvl(e.date_start, dg_date_start) and nvl(e.date_end, dg_date_end) --<<22.01.2020 Баязитов [19-64846]
                                            )
                            )
             --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
-- (нач.) Новолодский А. Ю. 18.02.2015 12-2313
              --and ubrr_xxi5.ubrr_rko.iseqrexistscatgrlist(ctrnaccc, ctrncur, d1, d2) is null
              and not exists (select 1
                 from sbs
                where csbsdo like 'R_EKV%'
                  and csbsacc = ctrnaccc)
-->>--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты
 and not exists (select 1                                from sbs
                               where csbsdo like 'R_Onl%'
                                 and csbsacc=ctrnaccc)
--<<--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты
-- (кон.) Новолодский А. Ю. 18.02.2015 12-2313
    group by ctrnaccc,ctrncur,iACCotd,caccmail
) where ksum<>0 or nsum<>0
group by acc,ctrncur,iaccotd, caccmail,ksum,nsum);

  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif := 'N';          --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)
  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif_id_check := 'Y'; --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)

DBMS_TRANSACTION.COMMIT;



-- >> 24.07.2019 Ризанов Р.Т. [19-62974] III ЭТАП УБРИР. Распространение Пакетов услуг УБРиР на ВУЗ
-- замена суммы комиссии на тариф из НТК по тем счетам у которых есть 131кгр
-->> 23.08.2012 ubrr korolkov https://redmine.lan.ubrr.ru/issues/5420
merge into xxi."sbs" r
using ( select s1.CSBSACC
              ,s1.CSBSCUR
              ,s1.MSBSTOLL_SUM
              ,s1.CSBSTOLL_CUR
              ,s1.CSBSPAYFROM_ACC
              ,s1.CSBSPAYFROM_CUR
              ,s1.CSBSDO
              ,s1.MSBSCOMM
              ,s1.ISBSDEBDOC
              ,s1.ISBSCREDDOC
              ,s1.MSBSDEBOB
              ,s1.MSBSCREDOB
              ,s1.IDSMR
              ,s1.CSBSACC_ZAM
              ,s1.CSBSCUR_ZAM
              ,s1.ISBSOTDNUM       -- замененный МВЗ НТК
          from ( select s.CSBSACC
                       ,s.CSBSCUR
                       ,s.MSBSTOLL_SUM
                       ,s.CSBSTOLL_CUR
                       ,s.CSBSPAYFROM_ACC
                       ,s.CSBSPAYFROM_CUR
                       ,s.CSBSDO
                       ,s.MSBSCOMM
                       ,s.ISBSDEBDOC
                       ,s.ISBSCREDDOC
                       ,s.MSBSDEBOB
                       ,s.MSBSCREDOB
                       ,s.IDSMR
                       ,s.CSBSACC_ZAM
                       ,s.CSBSCUR_ZAM
                       ,tar.cmvz ISBSOTDNUM
                       ,g.IGACNUM
                       ,row_number() over ( partition by g.cgacacc,g.cgaccur,g.idsmr order by null) rn
                   from xxi."sbs" s
                       ,gac       g
                       ,ubrr_comm_gacmvz_tarif tar
                  where s.idsmr   = lc_idsmr
                    and s.CSBSDO  = 'RKBK'
                    and s.CSBSACC like acc_1
                    and g.cgacacc = s.csbsacc
                    and g.cgaccur = s.csbscur
                    and g.idsmr   = s.idsmr
                    and g.igaccat = tar.icat
                    and g.igacnum = tar.inum
                    and g.igaccat = 131
                    and exists (select 1
                                  from xxi.au_attach_obg au
                                 where au.caccacc = g.cgacacc
                                   and au.cacccur = g.cgaccur
                                   and i_table    = 304
                                   and d_create  <= d2
                                   and au.c_newdata like '131%')
                    -->> 25.06.2018 Пинаев Д.Е. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)
                    and not exists (select 1
                                      from gac g1
                                     where g1.cgacacc = s.cSBSacc
                                       and g1.cgaccur = s.cSBScur
                                       and g1.igaccat = 112
                                       and g1.igacnum = 97
                                       and exists (select 1
                                                     from xxi.au_attach_obg au1
                                                    where au1.caccacc = s.cSBSacc
                                                      and au1.CACCCUR = s.cSBScur
                                                      and au1.i_table = 304
                                                      and trunc(au1.d_create) <= d2
                                                       and au1.c_newdata ='112/97'))
                    --<< 25.06.2018 Пинаев Д.Е. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)
                    -->> 24.10.2018 Баязитов [18-56613] ТП "Сбрось лишнее" (по типу ТП "Экспресс") для НТК с 01.11.18
                    and not exists (select 1
                                      from gac g2
                                     where g2.cgacacc = s.cSBSacc
                                       and g2.cgaccur = s.cSBScur
                                       and g2.igaccat = 112
                                       and g2.igacnum = 98
                                       and exists (select 1
                                                     from xxi.au_attach_obg au2
                                                    where au2.caccacc = s.cSBSacc
                                                      and au2.CACCCUR = s.cSBScur
                                                      and au2.i_table = 304
                                                      and trunc(au2.d_create) <= d2
                                                       and au2.c_newdata ='112/98'))
                    --<< 24.10.2018 Баязитов [18-56613] ТП "Сбрось лишнее" (по типу ТП "Экспресс") для НТК с 01.11.18

    -->>01.09.2015  Макарова Л.Ю.        [15-921] АБС: Ведение счета бесплатно
                    and not exists (select 1
                                      from gac g3
                                     where g3.cgacacc = s.cSBSacc
                                       and g3.cgaccur = s.cSBScur
                                       and g3.igaccat = 114
                                       and g3.igacnum = 10
                                       and exists (select 1
                                                    from xxi.au_attach_obg au3
                                                   where au3.caccacc = s.cSBSacc
                                                     and au3.cacccur = s.cSBScur
                                                     and au3.i_table = 304
                                                     and au3.d_create <= d2
                                                     and au3.c_newdata = '114/10'))
     -->> Ubrr Маkarova L.U. [15-1101] АБС: ТП Эквайринг для НТК
                    and not exists (select 1
                                         from gac g4
                                        where g4.cgacacc = s.cSBSacc
                                          and g4.cgaccur = s.cSBScur
                                          and g4.igaccat = 112
                                          and g4.igacnum in (62,63,64,65,66,81,82,83,84,85,86,87,88,89,90)
                                          and exists (select 1
                                                       from xxi.au_attach_obg au4
                                                      where au4.caccacc = s.cSBSacc
                                                        and au4.cacccur = s.cSBScur
                                                        and au4.i_table = 304
                                                        and au4.d_create <= d2
                                                        and au4.c_newdata  like '112/'||to_char(g4.igacnum)))
 -->> Ubrr Маkarova L.U. [15-1101] АБС: ТП Эквайринг для НТК
                    -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
                    and not exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                                  UBRR_UNIQUE_ACC_COMMS uuac 
                                         where s.cSBSacc = uutc.cacc 
                                           and d2 between uutc.DOPENTARIF and uutc.DCANCELTARIF
                                           and lc_idsmr = uutc.idsmr  
                                           and uutc.status = 'N'
                                           and uutc.uuta_id = uuac.uuta_id
                                           and uuac.daily = 'N'
                                           and uuac.com_type in ('RKBK')
                                           )  
                    --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ   
               ) s1
           where s1.rn =1 -- защита от множественности 131 категории с разными значениями в gac
      ) n
on (     r.csbsacc = n.csbsacc
     and r.csbscur = n.csbscur
     and r.csbsdo  = n.csbsdo
     and r.idsmr   = n.idsmr
    )
when matched then
       update set msbstoll_sum = /*DECODE(n.isbsotdnum, 8515,890,8516,890,8505,890,8209,690,8243,790,8114,790,8511,890,8306,790,8517,890,8216,790,8542,790,8509,890,8491,890,8519,890,8090,890,
                                    8504,790,8481,950,8487,950,8488,950,8490,950,8494,950,8492,950,8486,950,8507,790,8009,690,8499,890,6899,790,8495,890,8070,690,
                                    8496,890,8129,790,8521,790,8066,790,8518,890,8512,890,8493,890,8482,950,8543,950,8484,950,8544,950,8485,950,8545,950,8500,890,8514,890,8220,790,8523,790,8234,790,8522,790,8502,890,
                                    8501,890,8483,790,8506,790,8510,890,8044,890,8520,890,
                                    8524,790,8525,790,8526,950,8527,950,8528,950,8529,950,8530,950,8531,950,8532,950,8533,790,8534,890,8535,790,
                                    8536,890,8537,790,8538,890,8539,890,8540,890,8541,890,
                                    8546,690,8547,890,8548,890,8549,890,8550,890,8551,790,8552,790,8553,690,8554,690,8555,890,8556,790,8557,790,8558,790,
                                    8559,890,8560,890,8561,950,8562,950,8563,950,8564,950
                                   ,690 -- 11.03.2020  Ризанов Р.Т. [20-72291] Ошибка при взимании комиссии за ведение счёта со счетов НТК                                    
             ) -- 13.08.2020 Карачев А.А. План мероприятий по переподчинению НТК Филиала "Кировский" головному банку */
       DECODE(n.isbsotdnum, 8526,1000,8528,1000,8529,1000,8530,1000,8532,1000,8531,1000,8527,1000,8561,1000,8562,1000,8563,1000,8564,1000,8543,1000,
                            8544,1000,8545,1000,8555,950,8519,950,8560,950,8536,950,8548,950,8538,950,8559,950,8539,950,8518,950,8547,950,8515,950,
                            8516,950,8540,950,8511,950,8517,950,8541,950,8534,950,8549,950,8514,950,8550,950,8501,950,8510,950,8520,950,8524,850,
                            8114,850,8525,850,8542,850,8533,850,8556,850,8535,850,8521,850,8552,850,8523,850,8522,850,8537,850,8551,850,8558,850,
                            8557,850,8554,950,8546,950,8553,950,
                            690 -- 11.03.2020  Ризанов Р.Т. [20-72291] Ошибка при взимании комиссии за ведение счёта со счетов НТК                                    
             ) -- 08.09.2020 Карачев А.А. СЗ, № 1122-05/078009 от 27.08.2020 Об изменении тарифов по ежемесячным комиссияим, по пакетам услуг
             ,isbsotdnum   = n.isbsotdnum;
--<< 23.08.2012 ubrr korolkov https://redmine.lan.ubrr.ru/issues/5420
-- << 24.07.2019 Ризанов Р.Т. [19-62974] III ЭТАП УБРИР. Распространение Пакетов услуг УБРиР на ВУЗ

----------------------------------------------------------------------------------------------------------------------------
-->> korolkov
/*
По тарифу "Туристический", счёт с категорией/группой 112/31
Ведение расчетного счета в валюте РФ с использованием системы удаленного доступа
без предоставления выписки и документов в бумажном виде
*/
   INSERT INTO SBS
   ( cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, cSBSdo ,iSBSdebdoc,mSBSdebob,iSBScreddoc,mSBScredob)
   (select to_char(sysdate,'HH24:MI:SS'), acc, ctrncur, 9750, 'RKBK', sum(cd), sum(md), sum(cc), sum(mc)
      from (select ctrnaccd acc, ctrncur, count(1) c, iaccotd, count(1) cd, sum(mtrnsum) md , 0 cc, 0 mc, caccmail
              from ubrr_trn_old_new_v trn /*xxi.V_TRN_PART_CURRENT*/, acc a -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
             where ctrnaccd like acc_1
               and cTRNcur = 'RUR'
               and dtrntran between d1 and d2+86399/86400
               and a.cACCacc = cTRNaccd
               and a.cACCcur = cTRNcur
               -->> 20.09.2017 ubrr korolkov 15-1436
               and substr(case when iTrnType in (5, 50, 53, 52, 55, 17, 41, 42, 43, 44) then nvl(cTrnClient_Acc, cTrnAccC) when cTrnMfoA is null then nvl(cTrnAccA, cTrnAccC) else cTrnAccA end, 1, 5) not in ('60309', '60322')
               --<< 20.09.2017 ubrr korolkov 15-1436
               and a.cACCprizn <> 'З'
                 -->> ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
         and not (itrntype  in (22,25) and regexp_like(ctrnpurp, '^ *(|! *)0406') -- ubrr 24.05.2017 Макарова Л.Ю. [14-985.18] Некорректное списание комиссии за проведение платежей ЮЛ и ИП
                  and exists (select 1 from xxi."smr" where csmrmfo8 = ctrnmfoa))
         --<< ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
               AND a.caccacc NOT LIKE '40821________7%' -- 29/12/2011 Бездворный А.В. комиссии по 40821 (контрагенты) по РКО не считаем
               and not exists (select 1
                                 from gac
                                where cgacacc = a.cACCacc
                                  and cgaccur = a.cACCcur
                                  and igaccat = 333
                                  and igacnum = 2)
               and ( exists (select 1
                              from gac
                             where cGACacc = a.cACCacc
                               and cgaccur = a.cACCcur
                               and igaccat = 112
                               and igacnum = 31)
                 or exists (select 1
                              from xxi.AU_ATTACH_OBG au
                             where au.caccacc = a.cACCacc
                               and au.cacccur = a.cACCcur
                               and to_char(d_create,'mmyyyy') = to_char(add_months(d1,-1),'mmyyyy')
                               and i_table = 304
                               and nvl(au.c_newdata,au.c_olddata) = '112/31'
                               )
                                    )
-->>01.09.2015  Макарова Л.Ю.        [15-921] АБС: Ведение счета бесплатно
               and not exists (select 1
                                 from gac
                                where cgacacc = a.cACCacc
                                  and cgaccur = a.cACCcur
                                  and igaccat = 114
                                  and igacnum = 10
                                  and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = a.cACCacc
                                                and au.cacccur = a.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata = '114/10'))
--<<01.09.2015  Макарова Л.Ю.        [15-921] АБС: Ведение счета бесплатно
                -->> 25.06.2018 Пинаев Д.Е. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)
                and not exists (select 1
                             from gac
                            where cgacacc = a.cACCacc
                              and cgaccur = a.cACCcur
                              and igaccat = 112
                              and igacnum = 97
                              and exists (select 1
                                            from xxi.au_attach_obg au
                                           where au.caccacc = a.caccacc
                                             and au.CACCCUR = a.cacccur
                                             and au.i_table = 304
                                             and trunc(d_create) <= d2
                                              and c_newdata ='112/97'))
                --<< 25.06.2018 Пинаев Д.Е. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)
                -->> 24.10.2018 Баязитов [18-56613]  ТП "Сбрось лишнее" (по типу ТП "Экспресс") для НТК с 01.11.18
                and not exists (select 1
                             from gac
                            where cgacacc = a.cACCacc
                              and cgaccur = a.cACCcur
                              and igaccat = 112
                              and igacnum = 98
                              and exists (select 1
                                            from xxi.au_attach_obg au
                                           where au.caccacc = a.caccacc
                                             and au.CACCCUR = a.cacccur
                                             and au.i_table = 304
                                             and trunc(d_create) <= d2
                                              and c_newdata ='112/98'))
                --<< 24.10.2018 Баязитов [18-56613] ТП "Сбрось лишнее" (по типу ТП "Экспресс") для НТК с 01.11.18

                -->> 26.05.2015 ubrr korolkov 15-453
                and not exists (select 1
                                from gac
                                where cgacacc = a.cACCacc
                                and cgaccur = a.cACCcur
                                and igaccat = 112
                                and igacnum in (78,79,80,
                                99,100,101,102,103, --27.12.2018 Баязитов [15-43]
                                104,105,106,        -- Бизнес  Премиум  3, 6, 12  -- ubrr 31.05.2019 Ризанов Р.Т. [19-59153] АБС. Лимит платежей в пакеты услуг "Бизнес-Класс 3,6,12"
                                94)--24.09.2016 ubrr Maкарова Л.Ю. 16-2653 АБС: Кат/гр 112/94 для пакета услуг "Бизнес-комплект"
                                and exists (select 1
                                            from xxi.au_attach_obg au
                                            where au.caccacc = a.cACCacc
                                            and au.cacccur = a.cACCcur
                                            and i_table = 304
                                            and trunc(d_create) <= d2
                                            and au.c_newdata like '112/'||to_char(gac.igacnum)))
                --<< 26.05.2015 ubrr korolkov 15-453
-->> 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
               and not exists (select 1
                                 from gac
                                 where cgacacc = a.cACCacc
                                   and cgaccur = a.cACCcur
                                   and igaccat = 114
                                   and igacnum = 16)
--<< 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
             -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
             and not exists ( select 1
                                from gac g
                                    ,ubrr_rko_exinc_catgr e
                               where g.igaccat   = e.icat
                                 and g.igacnum   = e.igrp
                                 and e.ccom_type = 'RKB'
                                 and e.exinc     = 0
                                 and g.cgacacc   = a.caccacc
                                 and g.cgaccur   = a.cACCcur
                                 and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = a.caccacc
                                                and au.cacccur = a.cacccur
                                                and au.i_table = 304
                                                and trunc(au.d_create) <= d2
                                                and au.c_newdata = g.igaccat||'/'||g.igacnum
                                                and trunc(au.d_create) between nvl(e.date_start, dg_date_start) and nvl(e.date_end, dg_date_end) --<<22.01.2020 Баязитов [19-64846]
                                            )
                            )
             --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
---<<<UBRR Pashevich A. #12-508
               -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
               and not exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                             UBRR_UNIQUE_ACC_COMMS uuac 
                                       where ctrnaccd = uutc.cacc 
                                         and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF 
                                         and lc_idsmr = uutc.idsmr 
                                         and uutc.status = 'N'
                                         and uutc.uuta_id = uuac.uuta_id
                                         and uuac.com_type in ('RKBP','RKBK','RKO')
                                )
               --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
--->>>UBRR Pashevich A. #12-508
-- (нач.) Новолодский А. Ю. 18.02.2015 12-2313
               --and ubrr_xxi5.ubrr_rko.iseqrexistscatgrlist(ctrnaccd, ctrncur, d1, d2) is null
               and not exists (select 1
                 from sbs
                where csbsdo like 'R_EKV%'
                  and csbsacc = ctrnaccd)
-- (кон.) Новолодский А. Ю. 18.02.2015 12-2313
            group by ctrnaccd,ctrncur,iACCotd, caccmail)
group by acc,ctrncur,iaccotd, caccmail);
DBMS_TRANSACTION.COMMIT;



----------------------------------------------------------------------------------------------------------------------------
-->> 16.05.2012 ubrr korolkov https://redmine.lan.ubrr.ru/issues/4849
/*
По тарифу "Комфорт+ (бывший Экспресс 100)", счёт с категорией/группой 112/45
Ведение расчетного счета с использованием системы удаленного доступа
*/
   INSERT INTO SBS
   ( cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, cSBSdo ,iSBSdebdoc,mSBSdebob,iSBScreddoc,mSBScredob)
   (select to_char(sysdate,'HH24:MI:SS'), acc, ctrncur,
          /* decode(iaccotd, 6201,1300,6248,1300,6261,1300,6204,1400,6242,1400,6245,1400,6205,1200,6212,1300,6246,1300,6237,1600,
                           6257,1600,6222,1200,6264,1200,6231,1200,6250,1200,6253,1200,6255,1200,6265,1200,6266,1200,6254,1300,
                           6102,1300,6402,1300,6404,1300,6104,1300,6411,1150,6414,1250,6103,1100,6448,1100,6405,1100,6421,1100,
                           6105,1600,6112,1200,6473,1200,6484,1200,6486,1200,6440,1000,6107,1400,6401,1400,6403,1400,6406,1400,6408,1400,6407,1400,6415,1400,
                           6416,1400,6423,1400,6409,1200,6427,1100,6474,1100,6106,1100,6412,1100,6513,1100,6109,1100,6413,1100,6429,1100,
                           6431,1100,6453,1100,6488,1100,6497,1100,6418,1100,6417,1100,6463,1100,6444,1100,6442,800, 6441,800, 6452,800, 6454,800,
                           6110,1100,6410,1100,6422,1100,6460,1100,6475,1100,6428,1100,6457,1100,6462,1100,6471,1100,6445,1200,6115,900, 6464,900,6487,900,
                           6114,1100,6458,1100,6469,1100,6470,1100,6472,1100,6116,1600,6268,1200,6478,900,6479,900,6482,900,6480,1100,6490,1200,6491,1100,6481,1200,6493,1200,2000),--  распоряжение  № 7006-4596 от 11.12.2013 */
          decode(iaccotd, 6201,2330,2330),--  01.10.2020 Карачев А.А. IM2598357 исправление суммы комиссий
           'R_EXP', sum(cd), sum(md), sum(cc), sum(mc)
      from (select ctrnaccd acc, ctrncur, count(1) c, iaccotd, count(1) cd, sum(mtrnsum) md , 0 cc, 0 mc, caccmail
              from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v trn, acc a -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
             where ctrnaccd like acc_1
               and cTRNcur = 'RUR'
               and dtrntran between d1 and d2+86399/86400
               and substr(nvl(trn.ctrnacca,0),1,2) not like '70%'--22.08.2015  Макарова Л.Ю.        [15-841] АБС: Взимание комиссий. Тарифы НТК с 03.08.15 (искл.комис.док)
               and a.cACCacc = cTRNaccd
               and a.cACCcur = cTRNcur
               -->> 20.09.2017 ubrr korolkov 15-1436
               and substr(case when iTrnType in (5, 50, 53, 52, 55, 17, 41, 42, 43, 44) then nvl(cTrnClient_Acc, cTrnAccC) when cTrnMfoA is null then nvl(cTrnAccA, cTrnAccC) else cTrnAccA end, 1, 5) not in ('60309', '60322')
               --<< 20.09.2017 ubrr korolkov 15-1436
               and a.cACCprizn <> 'З'
                 -->> ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
         and not (itrntype in (22,25) and regexp_like(ctrnpurp, '^ *(|! *)0406')-- ubrr 24.05.2017 Макарова Л.Ю. [14-985.18] Некорректное списание комиссии за проведение платежей ЮЛ и ИП
                  and exists (select 1 from xxi."smr" where csmrmfo8 = ctrnmfoa))
         --<< ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
               and not exists (select 1
                                 from gac
                                where cgacacc = a.cACCacc
                                  and igaccat = 333
                                  and igacnum = 2)
               and (exists (select 1
                             from xxi.AU_ATTACH_OBG au
                            where au.caccacc = a.cACCacc
                              and au.cacccur = a.cACCcur
                              and i_table = 304
                              and au.c_newdata = '112/45'
                              and d_create <= d2
                              and d_create >= d1)
            or exists (select 1
                         from gac
                        where cgacacc = a.caccacc
                          and cgaccur = a.cacccur
                          and igaccat = 112
                          and igacnum = 45
                          and exists (select 1
                                        from xxi.au_attach_obg au
                                       where au.caccacc = a.cACCacc
                                         and au.cacccur = a.cACCcur
                                         and i_table = 304
                                         and d_create <= d2
                                         and au.c_newdata = '112/45') )
            )
            -->> 26.05.2015 ubrr korolkov 15-453
            and not exists (select 1
                            from gac
                            where cgacacc = a.cACCacc
                            and cgaccur = a.cACCcur
                            and igaccat = 112
                            and igacnum in (78,79,80,
                            98,   --10.12.2019 Баязитов [19-69749] Доработка АБС. ежемесячные комиссии (РКО) по обращению ДКБ
                            99,100,101,102,103, --27.12.2018 Баязитов [15-43]
                            104,105,106,        -- Бизнес  Премиум  3, 6, 12  -- ubrr 31.05.2019 Ризанов Р.Т. [19-59153] АБС. Лимит платежей в пакеты услуг "Бизнес-Класс 3,6,12"
                            94)--24.09.2016 ubrr Maкарова Л.Ю. 16-2653 АБС: Кат/гр 112/94 для пакета услуг "Бизнес-комплект"
                            and exists (select 1
                                        from xxi.au_attach_obg au
                                        where au.caccacc = a.cACCacc
                                        and au.cacccur = a.cACCcur
                                        and i_table = 304
                                        and trunc(d_create) <= d2
                                        and au.c_newdata like '112/'||to_char(gac.igacnum)))
-->> 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
               and not exists (select 1
                                 from gac
                                 where cgacacc = a.cACCacc
                                   and cgaccur = a.cACCcur
                                   and igaccat = 114
                                   and igacnum = 16)
--<< 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
             -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
             and not exists ( select 1
                                from gac g
                                    ,ubrr_rko_exinc_catgr e
                               where g.igaccat   = e.icat
                                 and g.igacnum   = e.igrp
                                 and e.ccom_type = 'R_EXP'
                                 and e.exinc     = 0
                                 and g.cgacacc   = a.caccacc
                                 and g.cgaccur   = a.cACCcur
                                 and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = a.caccacc
                                                and au.cacccur = a.cacccur
                                                and au.i_table = 304
                                                and trunc(au.d_create) <= d2
                                                and au.c_newdata = g.igaccat||'/'||g.igacnum
                                                and trunc(au.d_create) between nvl(e.date_start, dg_date_start) and nvl(e.date_end, dg_date_end) --<<22.01.2020 Баязитов [19-64846]
                                            )
                            )
             --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
 -->> Ubrr Маkarova L.U. [15-1101] АБС: ТП Эквайринг для НТК
               and not exists (select 1
                                 from sbs
                                where csbsdo like 'R_EKV%'
                                  and csbsacc = ctrnaccd)
-->>--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты

              and not exists (select 1
                                from sbs
                               where csbsdo like 'R_Onl%'
                                 and csbsacc=ctrnaccd)
--<<--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты
 -->> Ubrr Маkarova L.U. [15-1101] АБС: ТП Эквайринг для НТК
            --<< 26.05.2015 ubrr korolkov 15-453
---<<<UBRR Pashevich A. #12-508
               -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
               and not exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                             UBRR_UNIQUE_ACC_COMMS uuac 
                                       where ctrnaccd = uutc.cacc 
                                         and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF 
                                         and lc_idsmr = uutc.idsmr 
                                         and uutc.status = 'N'
                                         and uutc.uuta_id = uuac.uuta_id
                                         and uuac.com_type in ('RKBP','RKBK','RKO')
                                ) 
               --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
--->>>UBRR Pashevich A. #12-508
            group by ctrnaccd,ctrncur,iACCotd, caccmail)
group by acc,ctrncur,iaccotd, caccmail);


-->> 23.08.2012 ubrr korolkov https://redmine.lan.ubrr.ru/issues/5420
update sbs
   set mSBStoll_sum =/* 800 */ 990 -- (НТК) --25.01.2019 г. Карачев А.А.  Служебная записка № 1122-05/002983 от 17.01.2019 (НТК)
 where cSBSdo = 'R_EXP'
   and exists (select 1
                 from gac
                where cgacacc = cSBSacc
                  and cgaccur = cSBScur
                  and igaccat = 131
                  and exists (select 1
                                from xxi.au_attach_obg au
                               where au.caccacc = cSBSacc
                                 and au.cacccur = cSBScur
                                 and i_table = 304
                                 and d_create <= d2
                                 and au.c_newdata like '131%')
              )
   -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
   and not exists ( select 1
                      from gac g
                          ,ubrr_rko_exinc_catgr e
                     where g.igaccat   = e.icat
                       and g.igacnum   = e.igrp
                       and e.ccom_type = 'R_EXP'
                       and e.exinc     = 0
                       and g.cgacacc   = cSBSacc
                       and g.cgaccur   = cSBScur
                       and exists (select 1
                                     from xxi.au_attach_obg au
                                    where au.caccacc = cSBSacc
                                      and au.cacccur = cSBScur
                                      and au.i_table = 304
                                      and trunc(au.d_create) <= d2
                                      and au.c_newdata = g.igaccat||'/'||g.igacnum
                                      and trunc(au.d_create) between nvl(e.date_start, dg_date_start) and nvl(e.date_end, dg_date_end) --<<22.01.2020 Баязитов [19-64846]
                                  )
                  )
   --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
              ;
--<< 23.08.2012 ubrr korolkov https://redmine.lan.ubrr.ru/issues/5420

-- >> 24.07.2019 Ризанов Р.Т. [19-62974] III ЭТАП УБРИР. Распространение Пакетов услуг УБРиР на ВУЗ
-- замена суммы комиссии на тариф из НТК по тем счетам у которых есть 131кгр
merge into xxi."sbs" r
using ( select s1.CSBSACC
              ,s1.CSBSCUR
              ,s1.MSBSTOLL_SUM
              ,s1.CSBSTOLL_CUR
              ,s1.CSBSPAYFROM_ACC
              ,s1.CSBSPAYFROM_CUR
              ,s1.CSBSDO
              ,s1.MSBSCOMM
              ,s1.ISBSDEBDOC
              ,s1.ISBSCREDDOC
              ,s1.MSBSDEBOB
              ,s1.MSBSCREDOB
              ,s1.IDSMR
              ,s1.CSBSACC_ZAM
              ,s1.CSBSCUR_ZAM
              ,s1.ISBSOTDNUM       -- замененный МВЗ НТК
          from ( select s.CSBSACC
                       ,s.CSBSCUR
                       ,s.MSBSTOLL_SUM
                       ,s.CSBSTOLL_CUR
                       ,s.CSBSPAYFROM_ACC
                       ,s.CSBSPAYFROM_CUR
                       ,s.CSBSDO
                       ,s.MSBSCOMM
                       ,s.ISBSDEBDOC
                       ,s.ISBSCREDDOC
                       ,s.MSBSDEBOB
                       ,s.MSBSCREDOB
                       ,s.IDSMR
                       ,s.CSBSACC_ZAM
                       ,s.CSBSCUR_ZAM
                       ,tar.cmvz ISBSOTDNUM
                       ,g.IGACNUM
                       ,row_number() over ( partition by g.cgacacc,g.cgaccur,g.idsmr order by null) rn
                   from xxi."sbs" s
                       ,gac       g
                       ,ubrr_comm_gacmvz_tarif tar
                  where s.idsmr   = lc_idsmr
                    and s.CSBSDO  = 'R_EXP'
                    and s.CSBSACC like acc_1
                    and g.cgacacc = s.csbsacc
                    and g.cgaccur = s.csbscur
                    and g.idsmr   = s.idsmr
                    and g.igaccat = tar.icat
                    and g.igacnum = tar.inum
                    and g.igaccat = 131
                    and exists (select 1
                                  from xxi.au_attach_obg au
                                 where au.caccacc = g.cgacacc
                                   and au.cacccur = g.cgaccur
                                   and i_table    = 304
                                   and d_create  <= d2
                                   and au.c_newdata like '131%')
               ) s1
           where s1.rn =1 -- защита от множественности 131 категории с разными значениями в gac
      ) n
on (     r.csbsacc = n.csbsacc
     and r.csbscur = n.csbscur
     and r.csbsdo  = n.csbsdo
     and r.idsmr   = n.idsmr
    )
when matched then
    update set msbstoll_sum = 990 -- 02.10.2019 Баязитов Исправление ошибки https://redmine.lan.ubrr.ru/issues/67293
              ,isbsotdnum   = n.isbsotdnum;
-- << 24.07.2019 Ризанов Р.Т. [19-62974] III ЭТАП УБРИР. Распространение Пакетов услуг УБРиР на ВУЗ


DBMS_TRANSACTION.COMMIT;


----------------------------------------------------------------------------------------------------------------------------
-->>22.10.2018 Баязитов [18-56613] ТП "Сбрось лишнее" (по типу ТП "Экспресс") для НТК с 01.11.18
--ТП "Сбрось лишнее" кат.гр 112/101
   INSERT INTO SBS
   ( cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, cSBSdo ,iSBSdebdoc,mSBSdebob,iSBScreddoc,mSBScredob)
   (select to_char(sysdate,'HH24:MI:SS'), acc, ctrncur,
          /*decode(iaccotd, 9216, 1490, 1490),*/
          /*1790*/-->><<--11.07.2019 г. Карачев А.А.  Служебная записка № 1122-05/065172 от 10.07.2019 (НТК)
          2330, --  01.10.2020 Карачев А.А. IM2598357 исправление суммы комиссий
           'R_LIGHT', sum(cd), sum(md), sum(cc), sum(mc)
      from (select ctrnaccd acc, ctrncur, count(1) c, iaccotd, count(1) cd, sum(mtrnsum) md , 0 cc, 0 mc, caccmail
              from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v trn, acc a -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
             where ctrnaccd like acc_1
               and cTRNcur = 'RUR'
               and dtrntran between d1 and d2+86399/86400
               and substr(nvl(trn.ctrnacca,0),1,2) not like '70%'--22.08.2015  Макарова Л.Ю.        [15-841] АБС: Взимание комиссий. Тарифы НТК с 03.08.15 (искл.комис.док)
               and a.cACCacc = cTRNaccd
               and a.cACCcur = cTRNcur
               -->> 20.09.2017 ubrr korolkov 15-1436
               and substr(case when iTrnType in (5, 50, 53, 52, 55, 17, 41, 42, 43, 44) then nvl(cTrnClient_Acc, cTrnAccC) when cTrnMfoA is null then nvl(cTrnAccA, cTrnAccC) else cTrnAccA end, 1, 5) not in ('60309', '60322')
               --<< 20.09.2017 ubrr korolkov 15-1436
               and not (itrntype=4 and itrnsop=51 and ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
               and a.cACCprizn <> 'З'
                 -->> ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
         and not (itrntype in (22,25) and regexp_like(ctrnpurp, '^ *(|! *)0406')-- ubrr 24.05.2017 Макарова Л.Ю. [14-985.18] Некорректное списание комиссии за проведение платежей ЮЛ и ИП
                  and exists (select 1 from xxi."smr" where csmrmfo8 = ctrnmfoa))
         --<< ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
               and not exists (select 1
                                 from gac
                                where cgacacc = a.cACCacc
                                  and igaccat = 333
                                  and igacnum = 2)
               and (exists (select 1
                             from xxi.AU_ATTACH_OBG au
                            where au.caccacc = a.cACCacc
                              and au.cacccur = a.cACCcur
                              and i_table = 304
                              and au.c_newdata = '112/98'
                              and d_create <= d2
                              and d_create >= d1)
                    or exists (select 1
                                 from gac
                                where cgacacc = a.caccacc
                                  and cgaccur = a.cacccur
                                  and igaccat = 112
                                  and igacnum = 98
                                  and exists (select 1
                                                from xxi.au_attach_obg au
                                               where au.caccacc = a.cACCacc
                                                 and au.cacccur = a.cACCcur
                                                 and i_table = 304
                                                 and d_create <= d2
                                                 and au.c_newdata = '112/98') )
                    )
               and exists (select 1
                         from gac
                        where cgacacc = a.cACCacc
                          and cgaccur = a.cACCcur
                          and igaccat = 131
                          and exists (select 1
                                        from xxi.au_attach_obg au
                                       where au.caccacc = a.cACCacc
                                         and au.cacccur = a.cACCcur
                                         and i_table = 304
                                         and d_create <= d2
                                         and au.c_newdata like '131%'))
            -->> 26.05.2015 ubrr korolkov 15-453
            and not exists (select 1
                            from gac
                            where cgacacc = a.cACCacc
                            and cgaccur = a.cACCcur
                            and igaccat = 112
                            and igacnum in (78,79,80,
                            99,100,101,102,103, --27.12.2018 Баязитов [15-43]
                            104,105,106,        -- Бизнес  Премиум  3, 6, 12  -- ubrr 31.05.2019 Ризанов Р.Т. [19-59153] АБС. Лимит платежей в пакеты услуг "Бизнес-Класс 3,6,12"
                            94)--24.09.2016 ubrr Maкарова Л.Ю. 16-2653 АБС: Кат/гр 112/94 для пакета услуг "Бизнес-комплект"
                            and exists (select 1
                                        from xxi.au_attach_obg au
                                        where au.caccacc = a.cACCacc
                                        and au.cacccur = a.cACCcur
                                        and i_table = 304
                                        and trunc(d_create) <= d2
                                        and au.c_newdata like '112/'||to_char(gac.igacnum)))
-->> 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
               and not exists (select 1
                                 from gac
                                 where cgacacc = a.cACCacc
                                   and cgaccur = a.cACCcur
                                   and igaccat = 114
                                   and igacnum = 16)
--<< 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
               -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
               and not exists ( select 1
                                  from gac g
                                      ,ubrr_rko_exinc_catgr e
                                 where g.igaccat   = e.icat
                                   and g.igacnum   = e.igrp
                                   and e.ccom_type = 'R_LIGHT'
                                   and e.exinc     = 0
                                   and g.cgacacc   = a.caccacc
                                   and g.cgaccur   = a.cACCcur
                                   and exists (select 1
                                                 from xxi.au_attach_obg au
                                                where au.caccacc = a.caccacc
                                                  and au.cacccur = a.cacccur
                                                  and au.i_table = 304
                                                  and trunc(au.d_create) <= d2
                                                  and au.c_newdata = g.igaccat||'/'||g.igacnum
                                                  and trunc(au.d_create) between nvl(e.date_start, dg_date_start) and nvl(e.date_end, dg_date_end) --<<22.01.2020 Баязитов [19-64846]
                                              )
                              )
               --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
 -->> Ubrr Маkarova L.U. [15-1101] АБС: ТП Эквайринг для НТК
               and not exists (select 1
                                 from sbs
                                where csbsdo like 'R_EKV%'
                                  and csbsacc = ctrnaccd)
-->>--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты

              and not exists (select 1
                                from sbs
                               where csbsdo like 'R_Onl%'
                                 and csbsacc=ctrnaccd)
--<<--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты
 -->> Ubrr Маkarova L.U. [15-1101] АБС: ТП Эквайринг для НТК
            --<< 26.05.2015 ubrr korolkov 15-453
---<<<UBRR Pashevich A. #12-508
               -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
               and not exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                             UBRR_UNIQUE_ACC_COMMS uuac 
                                       where ctrnaccd = uutc.cacc 
                                         and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF 
                                         and lc_idsmr = uutc.idsmr 
                                         and uutc.status = 'N'
                                         and uutc.uuta_id = uuac.uuta_id
                                         and uuac.com_type in ('RKBP','RKBK','RKO')
                                )         
               --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
--->>>UBRR Pashevich A. #12-508
            group by ctrnaccd,ctrncur,iACCotd, caccmail)
group by acc,ctrncur,iaccotd, caccmail);
DBMS_TRANSACTION.COMMIT;
--<<22.10.2018 Баязитов [18-56613] ТП "Сбрось лишнее" (по типу ТП "Экспресс") для НТК с 01.11.18

--<< korolkov

-- begin 04/07/2008 VVM корректировка для Агентов Континенталя, считаем что они по тарифу К-Б идут (для ССБ)
begin
     for r in (select a.rowid rw, caccmail,
                     /*  decode(caccmail, 'K', decode(b.iaccotd,6305,250,450),
                                            decode(b.iaccotd,6305,400,650))*/
                       decode(caccmail, 'K', decode(b.iaccotd,6305,250,500),
                                           decode(b.iaccotd,6305,400,700)) summ  --  распоряжение № 7006-1770 от 07.06.2013 (изм.Галиева Н.А.)
                 from sbs a,acc b
                where csbsdo = 'REO'
                  and exists (select 1
                                from gac
                               where cgacacc = a.cSBSacc
                                 and cgaccur = a.cSBScur
                                 and igaccat = 112
                                 and igacnum = 11)
                  and exists (select 1
                                from gac
                               where cgacacc = a.cSBSacc
                                 and cgaccur = a.cSBScur
                                 and igaccat = 105
                                 and igacnum in (1,2,8,9))
                  and b.caccacc=a.csbsacc) loop
        update SBS
           set mSBStoll_sum = r.summ,
               cSBSdo = 'REB'||DECODE(r.caccmail, 'K', 'K', 'P')
         where rowid = r.rw;
    end loop;
end;
-- end 04/07/2008 VVM корректировка для Агенов Континенталя, считаем что они по тарифу К-Б идут (для ССБ)


----------------------------------------------------------------------------------------------------------------------------
-- 2.1)для пользователей банк-клиента в режиме Эконом- REB
/*
Ведение расчетного счета в режиме "Эконом"
- с использованием системы удаленного доступа
*/
   INSERT INTO SBS
   ( cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, cSBSdo ,iSBSdebdoc,mSBSdebob,iSBScreddoc,mSBScredob)
   (select to_char(sysdate,'HH24:MI:SS'), acc,ctrncur,
            DECODE(caccmail, 'K',
            -- без предоставления выписки и документов в бумажном виде
        /*   DECODE(iACCotd,6264,600,6452,600,6487,600,6440,600,6245,600,6204,600,6935,600,6112,600,6473,600,6301,790,6303,790,6302,790,6213,790,6210,790,
                        6216,790,6232,790,6240,790,6224,790,6208,790,6239,790,6220,790,6219,790,6217,790,6263,790,6269,790,6932,600,6428,600,6472,600,
                        6489,600,6237,600,6257,600,6205,600,6482,600,6106,600,6412,600,6409,600,6933,600,6931,600,6485,600,6255,600,6254,600,6923,600,
                        6927,600,6486,600,6427,600,6474,600,6105,700,6471,600,6253,600,6445,600,6201,600,6248,600,6250,600,6115,600,6464,600,6483,600,
                        6925,600,6926,600,6921,600,6479,600,6417,600,6463,600,6246,600,6110,600,6422,600,6410,600,6460,600,6212,600,6453,600,6469,600,
                        6116,700,6904,700,6442,600,6930,600,6922,600,6242,600,6418,600,6265,600,6222,600,6231,600,6470,600,6478,600,6261,600,6480,600,
                        6109,600,6429,600,6413,600,6431,600,6488,600,6490,600,6107,600,6408,600,6406,600,6401,600,6403,600,6416,600,6937,600,6938,600,
                        6939,600,6941,600,6948,700,6963,700,6967,700,6950,600,6951,600,6952,600,6953,600,6954,600,6955,600,6956,600,6968,600,6969,600,
                        6970,600,6971,600,6973,600,6974,600,6975,600,6976,600,6981,600,6982,600,6983,600,6984,600,6985,600,6986,600,6988,600,6989,600,
                        6990,600,6991,600,6992,600,6993,600,6994,600,6995,600,6996,600,6997,600,6998,600,6915,600,6905,600,6907,600,6910,600,6912,600,
                        6913,600,6914,600,6942,600,6944,600,
                        750), -- 13.08.2020 Карачев А.А. План мероприятий по переводу Кировский в ВСП */
            DECODE(iACCotd,6948,800,6963,800,6967,800,6301,890,6303,890,6302,890,6213,890,6210,890,6216,890,6232,890,6240,890,6224,890,
                            6208,890,6239,890,6220,890,6219,890,6217,890,6263,890,6269,890,6913,650,6915,650,6933,650,6986,650,6950,650,
                            6951,650,6955,650,6953,650,6982,650,6984,650,6983,650,6988,650,6989,650,6993,650,6997,650,6994,650,6998,650,
                            6914,650,6968,650,6973,650,6971,650,6969,650,6970,650,6975,650,6937,650,6939,650,6935,800,6956,800,6938,800,
                            6985,800,6942,800,6201,800,6248,800,6995,800,6905,800,6990,800,6952,800,6261,800,6954,650,6255,650,6976,650,
                            6912,650,6253,650,6265,650,6991,650,6490,650,6941,650,6925,650,6926,650,6264,650,6910,650,6932,650,6237,650,
                            6257,650,6205,650,6974,650,6931,650,6254,650,6927,650,6981,650,6250,650,6463,650,6212,650,6907,650,6930,650,
                            6996,650,6222,650,6231,650,6245,650,6204,650,6246,650,6242,650,6992,650,6923,650,6921,650,6922,650,9219,890,9217,890,6106,800,
                        750), -- 08.09.2020 Карачев А.А. СЗ, № 1122-05/078009 от 27.08.2020 Об изменении тарифов по ежемесячным комиссияим, по пакетам услуг
            -- с предоставлением выписки и документов в бумажном виде, 
           /*   DECODE(iACCotd,6264,950,6452,950,6487,1000,6440,1000,6245,1150,6204,1150,6935,1000,6112,1000,6473,1000,6301,1300,6303,1300,6302,1300,
                        6213,1300,6210,1300,6216,1300,6232,1300,6240,1300,6224,1300,6208,1300,6239,1300,6220,1300,6219,1300,6217,1300,6263,1300,
                        6269,1300,6932,950,6428,1000,6472,1000,6489,1000,6237,950,6257,950,6205,950,6482,1000,6106,1000,6412,1000,6409,950,6933,1000,
                        6931,950,6485,950,6255,1000,6254,950,6923,950,6927,950,6486,950,6427,1000,6474,950,6105,1200,6471,1000,6253,1000,6445,1000,
                        6201,1000,6248,1000,6250,950,6115,1000,6464,1000,6483,1000,6925,950,6926,1000,6921,950,6479,1000,6417,1000,6463,950,6246,1150,
                        6110,1000,6422,1000,6410,1000,6460,1000,6212,950,6453,950,6469,1000,6116,1200,6904,1200,6442,1000,6930,950,6922,950,6242,1150,
                        6418,950,6265,1000,6222,950,6231,950,6470,1000,6478,1000,6261,1000,6480,1000,6109,1000,6429,1000,6413,1000,6431,1000,6488,1000,
                        6490,1000,6107,1000,6408,1000,6406,1000,6401,1000,6403,1000,6416,1000,6937,1000,6938,1000,6939,1000,6941,950,6948,1200,6963,1200,
                        6967,1200,6950,1000,6951,1000,6952,1000,6953,1000,6954,1000,6955,1000,6956,1000,6968,1000,6969,1000,6970,1000,6971,1000,6973,1000,
                        6974,950,6975,1000,6976,1000,6981,950,6982,1000,6983,1000,6984,1000,6985,1000,6986,1000,6988,1000,6989,1000,6990,1000,6991,1000,
                        6992,950,6993,1000,6994,1000,6995,1000,6996,950,6997,1000,6998,1000,6915,1000,6905,1000,6907,950,6910,950,6912,1000,6913,1000,
                        6914,1000,6942,1000,6944,1000,
                        1250)), -- 13.08.2020 Карачев А.А. План мероприятий по переводу Кировский в ВСП*/
           DECODE(iACCotd,6948,1300,6963,1300,6967,1300,6301,1400,6303,1400,6302,1400,6213,1400,6210,1400,6216,1400,6232,1400,
                            6240,1400,6224,1400,6208,1400,6239,1400,6220,1400,6219,1400,6217,1400,6263,1400,6269,1400,6913,1100,
                            6915,1100,6933,1100,6986,1100,6950,1100,6951,1100,6955,1100,6953,1100,6982,1100,6984,1100,6983,1100,
                            6988,1100,6989,1100,6993,1100,6997,1100,6994,1100,6998,1100,6914,1100,6968,1100,6973,1100,6971,1100,
                            6969,1100,6970,1100,6975,1100,6937,1100,6939,1100,6935,1100,6956,1100,6938,1100,6985,1100,6942,1100,
                            6201,1100,6248,1100,6995,1100,6905,1100,6990,1100,6952,1100,6261,1100,6954,1100,6255,1100,6976,1100,
                            6912,1100,6253,1100,6265,1100,6991,1100,6490,1100,6941,1100,6925,1000,6926,1000,6264,1000,6910,1000,
                            6932,1000,6237,1000,6257,1000,6205,1000,6974,1000,6931,1000,6254,1000,6927,1000,6981,1000,6250,1000,
                            6463,1000,6212,1000,6907,1000,6930,1000,6996,1000,6222,1000,6231,1000,6245,1250,6204,1250,6246,1250,
                            6242,1250,6992,1000,6923,1000,6921,1000,6922,1000,9219,1400,9217,1400,6106,1100,
                        1250)), -- 08.09.2020 Карачев А.А. СЗ, № 1122-05/078009 от 27.08.2020 Об изменении тарифов по ежемесячным комиссияим, по пакетам услуг
                     'REB'|| /* Pashevich A. исправление по письму от 25.03.2013
                    DECODE(iACCotd,6112,null,6411,null,6414,null,6418,null,6110,null,6410,null,6422,null,6103,null,6405,null,6421,null,6105,null,6114,null,6445,null,*/
DECODE(caccmail, 'K', 'K', 'P')
                   /*)*/,--нет разделения по выпискам
            sum(cd),sum(md),sum(cc),sum(mc)
       from (select ctrnaccd acc,ctrncur,count(1) c,iaccotd,count(1) cd,sum(mtrnsum) md ,0 cc,0 mc, caccmail
              from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v trn, acc a -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
             where ctrnaccd like acc_1
               and cTRNcur = 'RUR'
               and dtrntran between d1 and d2+86399/86400
               -->> 20.09.2017 ubrr korolkov 15-1436
               and substr(case when iTrnType in (5, 50, 53, 52, 55, 17, 41, 42, 43, 44) then nvl(cTrnClient_Acc, cTrnAccC) when cTrnMfoA is null then nvl(cTrnAccA, cTrnAccC) else cTrnAccA end, 1, 5) not in ('60309', '60322')
               --<< 20.09.2017 ubrr korolkov 15-1436
               AND caccacc NOT LIKE '40821________7%' -- 29/12/2011 Бездворный А.В. комиссии по 40821 (контрагенты) по РКО не считаем
               and (   (    itrntype in (2,3,4,11,14,15,21,22,23,25,28)
                        and (   substr(itrnba2c,1,3) in (111,301,302,303,401,402,403,404,405,406,407,423,426)
                             or itrnba2c in (10000,40802,40807,40817,40818,40820,40911))
-- Зуев А.А. раньше это условие распространялось и на кассу
                        and (exists (select 1
                                      from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v t -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                                     where t.ctrnaccd = trn.ctrnaccd
                                       and t.ctrncur = trn.ctrncur
                                       and dtrntran between d1 and d2+86399/86400
                                       and itrnsop=4)
                             -->>22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
                             or exists (select 1
                                          from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v t -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                                         where t.ctrnaccd = trn.ctrnaccd
                                           and t.ctrncur = trn.ctrncur
                                           and dtrntran between d1 and d2+86399/86400
                                           and itrntype=4
                                           and itrnsop=51
                                           and ctrnpurp like '0450%'))
                             --<<22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
                             )
                    or (    itrntype in (9,13)
                        and exists (select 1
                                      from gac
                                     where cgacacc = cTRNaccd
                                       and cgaccur = ctrncur
                                       and igaccat = 105
                                       and igacnum in (1,2,8,9,
--- Pashevich A. 12-1530
                                                       11
--- Pashevich A. 12-1530
  ))))
    -->> ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
         and not (itrntype in (22,25) and regexp_like(ctrnpurp, '^ *(|! *)0406') -- ubrr 24.05.2017 Макарова Л.Ю. [14-985.18] Некорректное списание комиссии за проведение платежей ЮЛ и ИП
                  and exists (select 1 from xxi."smr" where csmrmfo8 = ctrnmfoa))
         --<< ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
               and exists (select 1
                             from gac
                            where cgacacc = cACCacc
                              and cgaccur = cACCcur
                              and igaccat = 112
                              and igacnum in (6,8)
                              and exists (select 1
                                            from xxi.au_attach_obg
                                           where cgacacc = caccacc
                                             and cgaccur = cacccur
                                             and trunc(d_create) <= d2
                                             and (   c_newdata ='112/6'
                                                  or c_newdata ='112/8')))
               and not exists (select 1
                                 from gac
                                where cgacacc = a.cACCacc
                                  and cgaccur = a.cACCcur
                                  and igaccat = 333
                                  and igacnum = 2)
-->>01.09.2015  Макарова Л.Ю.        [15-921] АБС: Ведение счета бесплатно
               and not exists (select 1
                                 from gac
                                where cgacacc = a.cACCacc
                                  and cgaccur = a.cACCcur
                                  and igaccat = 114
                                  and igacnum = 10
                                  and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = a.cACCacc
                                                and au.cacccur = a.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata = '114/10'))
--<<01.09.2015  Макарова Л.Ю.        [15-921] АБС: Ведение счета бесплатно
-- UBRR Pashevich AO 14-992
                and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =a.CACCACC  and cacccur = a.CACCCUR
                                  and c_newdata = cg_112_72
                                  and d1 between trunc(d_create,'mm') and last_day(add_months (d_create,5))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum =72
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = cg_112_72
                                                        and a2.d_create> last_day(add_months (a1.d_create,5))
                                                )
                         )
              and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =a.CACCACC  and cacccur = a.CACCCUR
                                  and c_newdata = cg_112_35
                                  and d1 between trunc(d_create,'mm') and last_day(add_months (d_create,2))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum =35
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = cg_112_35
                                                        and a2.d_create> last_day(add_months (a1.d_create,2))
                                                )

                         )
          -->> ubrr 08.07.2016 Арсланов Д.Ф. 16-2143.2 "Тест-драйв+"
              and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =a.CACCACC  and cacccur = a.CACCCUR
                                  and c_newdata = '112/93'
                                  and d1 between trunc(d_create,'mm') and last_day(add_months (d_create,2))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum = 93
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = '112/93'
                                                        and a2.d_create>last_day(add_months (a1.d_create,2))
                                                )

                         )
        --<< ubrr 08.07.2016 Арсланов Д.Ф. 16-2143.2 "Тест-драйв+"
               -- UBRR Pashevich AO 14-992
               /*and not exists (select 1
                                 from xxi.au_attach_obg au
                                where au.caccacc = a.cACCacc
                                  and au.cacccur = a.cACCcur
                                  and add_months(last_day(d_create),2) > d1
                                  and i_table = 304
                                  and au.c_newdata = '112/35' )*/
                 -- > y.metalnikov@i-sys.ru 11/12/13 rm 12-2172
                AND NOT exists (SELECT 1
                                 FROM gac
                                WHERE cgacacc = a.cACCacc
                                  AND cgaccur = a.cACCcur
                                  AND igaccat = 112
                                  AND igacnum = 40
                                  AND exists (SELECT 1
                                                FROM xxi.au_attach_obg au
                                               WHERE au.caccacc = a.cACCacc
                                                 AND au.cacccur = a.cACCcur
                                                 AND au.i_table = 304
                                                 AND au.d_create <= d2
                                                 AND add_months(last_day(au.d_create),11) > d1
                                                 AND au.c_newdata = '112/40'))
                AND NOT exists (SELECT 1
                                 FROM xxi.au_attach_obg au_s
                                INNER JOIN xxi.au_attach_obg au_e
                                   ON au_e.caccacc = au_s.caccacc
                                  AND au_e.cacccur = au_s.cacccur
                                  AND au_e.i_table = 304
                                  AND au_e.C_OLDDATA = '112/40'
                                WHERE au_s.caccacc = a.cACCacc
                                  AND au_s.cacccur = a.cACCcur
                                  AND au_s.i_table = 304
                                  AND au_s.d_create <= d2
                                  AND au_e.d_create >= d1
                                  AND add_months(last_day(au_s.d_create),11) > d1
                                  AND au_s.c_newdata = '112/40')
                -- < y.metalnikov@i-sys.ru 11/12/13
               and not exists (select 1
                                 from xxi.au_attach_obg au
                                where au.caccacc = a.cACCacc
                                  and au.cacccur = a.cACCcur
                                  and d_create > d1
                                  and d_create < d2
                                  and i_table = 304
                                  and au.c_newdata in (--'112/35',UBRR Pashevich AO 14-992
                                                       '112/36','112/37','112/38'/*,'112/39'*/,'112/40','112/45'
                                  ))
               -->> ubrr korolkov 12-1657(#9707)
               and not exists (select 'x'
                                 from xxi.au_attach_obg au
                                where au.caccacc = a.cACCacc
                                  and au.cacccur = a.cACCcur
                                  and add_months(last_day(au.d_create),3) > d1
                                  and au.d_create <= d2
                                  and au.i_table = v_autab
                                  and au.c_newdata = cg_112_59
                                  and not exists
                                    (select 'x' from xxi.au_attach_obg au2
                                      where au2.caccacc = au.caccacc
                                        and au2.cacccur = au.cacccur
                                        and au2.c_olddata = cg_112_59
                                        and au2.d_create >= au.d_create
                                        and add_months(au2.d_create,1) <= d2) )
               --<< ubrr korolkov 12-1657(#9707)
               and not exists (select 1
                                 from gac
                                where cgacacc = cACCacc
                                  and cgaccur = cACCcur
                                  and igaccat = 112
                                  and igacnum in (1,3,4,5,7,10,13,15,16,17,19,20,21,22,23,24,25,31,
                                                  -- 35, UBRR Pashevich AO 14-992
                                                  36,37,38,39,40,45,
                                                  57 -- UBRR Pashevich A. 12-1750

                                                  )
                              )
               and not exists (select 1
                                 from sbs
                                where csbsdo like 'RE%'
                                  and csbsacc=ctrnaccd)
-->>--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты

              and not exists (select 1
                                from sbs
                               where csbsdo like 'R_Onl%'
                                 and csbsacc=ctrnaccd)
--<<--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты
               and cACCacc = cTRNaccd
               and cACCcur = cTRNcur
               and cACCprizn <> 'З'
---<<<UBRR Pashevich A. #12-508
               -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
               and not exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                             UBRR_UNIQUE_ACC_COMMS uuac 
                                       where ctrnaccd = uutc.cacc 
                                         and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF 
                                         and lc_idsmr = uutc.idsmr 
                                         and uutc.status = 'N'
                                         and uutc.uuta_id = uuac.uuta_id
                                         and uuac.com_type in ('RKBP','RKBK','RKO')
                                )        
               --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
--->>>UBRR Pashevich A. #12-508
---<<<UBRR Pashevich A. #12-1530
              and not exists (select 1
                               from xxi.au_attach_obg au
                                 where     au.caccacc  = a.caccacc
                                        and au.cacccur = a.cacccur
                                        and c_newdata ='105/11'
                                        and trunc(au.d_create) <= to_date('18042013','dd.mm.yyyy')
                                        and exists (select 1
                                                     from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                                                      where     ctrnaccd   = a.caccacc
                                                            and ctrncurc   = a.cacccur
                                                            and dtrntran between d1 and d2+86399/86400
                                                            and ctrnidopen = 'CORREQTS')
                                        and d2<=to_date('31072013','dd.mm.yyyy hh24:mi:ss')
                              )
--->>>UBRR Pashevich A. #12-1530
                -->> 26.05.2015 ubrr korolkov 15-453
                and not exists (select 1
                                from gac
                                where cgacacc = a.cACCacc
                                and cgaccur = a.cACCcur
                                and igaccat = 112
                                and igacnum in (78,79,80,
                                99,100,101,102,103, --27.12.2018 Баязитов [15-43]
                                104,105,106,        -- Бизнес  Премиум  3, 6, 12  -- ubrr 31.05.2019 Ризанов Р.Т. [19-59153] АБС. Лимит платежей в пакеты услуг "Бизнес-Класс 3,6,12"
                                94)--24.09.2016 ubrr Maкарова Л.Ю. 16-2653 АБС: Кат/гр 112/94 для пакета услуг "Бизнес-комплект"
                                and exists (select 1
                                            from xxi.au_attach_obg au
                                            where au.caccacc = a.cACCacc
                                            and au.cacccur = a.cACCcur
                                            and i_table = 304
                                            and trunc(d_create) <= d2
                                            and au.c_newdata like '112/'||to_char(gac.igacnum)))
                --<< 26.05.2015 ubrr korolkov 15-453
-->> 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
               and not exists (select 1
                                 from gac
                                 where cgacacc = a.cACCacc
                                   and cgaccur = a.cACCcur
                                   and igaccat = 114
                                   and igacnum = 16)
--<< 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
               -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
               and not exists ( select 1
                                  from gac g
                                      ,ubrr_rko_exinc_catgr e
                                 where g.igaccat   = e.icat
                                   and g.igacnum   = e.igrp
                                   and e.ccom_type = 'REB'
                                   and e.exinc     = 0
                                   and g.cgacacc   = a.caccacc
                                   and g.cgaccur   = a.cACCcur
                                   and exists (select 1
                                                 from xxi.au_attach_obg au
                                                where au.caccacc = a.caccacc
                                                  and au.cacccur = a.cacccur
                                                  and au.i_table = 304
                                                  and trunc(au.d_create) <= d2
                                                  and au.c_newdata = g.igaccat||'/'||g.igacnum
                                                  and trunc(au.d_create) between nvl(e.date_start, dg_date_start) and nvl(e.date_end, dg_date_end) --<<22.01.2020 Баязитов [19-64846]
                                              )
                              )
               --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
             group by ctrnaccd,ctrncur,iACCotd, caccmail
             UNION ALL
            select ctrnaccc acc,ctrncur,count(1) c,iaccotd,0 cd,0 md,count(1) cc,sum(mtrnsum) mc, caccmail
              from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v, acc a -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
             where ctrnaccc like acc_1
               and cTRNcurc = 'RUR'
               and dtrntran between d1 and d2+86399/86400
               -->> 20.09.2017 ubrr korolkov 15-1436
               and not (ctrnaccd like '30232%' and lower(replace(ctrnpurp, ' ')) like 'возм%термин%')
               --<< 20.09.2017 ubrr korolkov 15-1436
               and substr(nvl(ctrnacca,0),1,5) not in ('47426', '70606')
               and substr(ctrnaccd,1,5) not in ('47426', '70606')
               AND caccacc NOT LIKE '40821________7%' -- 29/12/2011 Бездворный А.В. комиссии по 40821 (контрагенты) по РКО не считаем
/*              and (  (    iTRNtype in (2,5,51)
                      and (   ctrnaccd like '301%'
                           or ctrnaccd like '303%')) -- добавили кредит межбанка через 303% 11.01.09 мвв
                   or iTRNtype in (10,12))*/
               and itrntype in (-7, 2, 5, 10, 12, 51, 53, 55)
               and not (itrntype=4 and itrnsop=51 and ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
               and not exists (select 1
                                 from gac
                                where cgacacc = cACCacc
                                  and cgaccur = cACCcur
                                  and igaccat = 112
                                  and igacnum in (1,3,4,5,7,10,13,15,16,17,19,20,21,22,23,24,25,31,
                                                  -- 35, UBRR Pashevich AO 14-992
                                                  36,37,38,39,40,45,
                                                  57-- UBRR Pashevich A. 12-1750
                                                 )
                               )
               and exists (select 1
                             from gac
                            where cgacacc = cACCacc
                              and cgaccur = cACCcur
                              and igaccat = 112
                              and igacnum in (6,8)
                              and exists (select 1
                                            from xxi.au_attach_obg
                                           where cgacacc = caccacc
                                             and cgaccur = cacccur
                                             and trunc(d_create) <= d2
                                             and (   c_newdata ='112/6'
                                                  or c_newdata ='112/8')))
               and exists (select 1
                             from gac
                            where cgacacc = cACCacc
                              and cgaccur = cACCcur
                              and igaccat = 105
                              and igacnum in (1,2,8,9,
-- Ubrr Pashevich A. 12-1531
                                              11
-- Ubrr Pashevich A. 12-1531
                                              ))
               and not exists (select 1
                                 from gac
                                where cgacacc = a.cACCacc
                                  and igaccat = 333
                                  and igacnum = 2)
-->>01.09.2015  Макарова Л.Ю.        [15-921] АБС: Ведение счета бесплатно
               and not exists (select 1
                                 from gac
                                where cgacacc = a.cACCacc
                                  and cgaccur = a.cACCcur
                                  and igaccat = 114
                                  and igacnum = 10
                                  and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = a.cACCacc
                                                and au.cacccur = a.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata = '114/10'))
--<<01.09.2015  Макарова Л.Ю.        [15-921] АБС: Ведение счета бесплатно
               -- UBRR Pashevich AO 14-992
               and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =a.CACCACC  and cacccur = a.CACCCUR
                                  and c_newdata = cg_112_72
                                  and d1 between trunc(d_create,'mm') and last_day(add_months (d_create,5))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum =72
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = cg_112_72
                                                        and a2.d_create> last_day ( add_months (a1.d_create,5))
                                                )
                         )
               and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =a.CACCACC  and cacccur = a.CACCCUR
                                  and c_newdata = cg_112_35
                                  and d1 between trunc(d_create,'mm') and last_day(add_months (d_create,2))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum =35
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = cg_112_35
                                                        and a2.d_create>last_day(add_months (a1.d_create,2))
                                                )

                         )
          -->> ubrr 08.07.2016 Арсланов Д.Ф. 16-2143.2 "Тест-драйв+"
              and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =a.CACCACC  and cacccur = a.CACCCUR
                                  and c_newdata = '112/93'
                                  and d1 between trunc(d_create,'mm') and last_day(add_months (d_create,2))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum = 93
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = '112/93'
                                                        and a2.d_create>last_day(add_months (a1.d_create,2))
                                                )

                         )
        --<< ubrr 08.07.2016 Арсланов Д.Ф. 16-2143.2 "Тест-драйв+"
               /*and not exists (select 1
                                 from xxi.au_attach_obg au
                                where au.caccacc = a.cACCacc
                                  and au.cacccur = a.cACCcur
                                  and add_months(last_day(d_create),2) > d1
                                  and i_table = 304
                                  and au.c_newdata = '112/35' )*/
                 -- UBRR Pashevich AO 14-992
                -- > y.metalnikov@i-sys.ru 11/12/13 rm 12-2172
                AND NOT exists (SELECT 1
                                 FROM gac
                                WHERE cgacacc = a.cACCacc
                                  AND cgaccur = a.cACCcur
                                  AND igaccat = 112
                                  AND igacnum = 40
                                  AND exists (SELECT 1
                                                FROM xxi.au_attach_obg au
                                               WHERE au.caccacc = a.cACCacc
                                                 AND au.cacccur = a.cACCcur
                                                 AND au.i_table = 304
                                                 AND au.d_create <= d2
                                                 AND add_months(last_day(au.d_create),11) > d1
                                                 AND au.c_newdata = '112/40'))
                AND NOT exists (SELECT 1
                                 FROM xxi.au_attach_obg au_s
                                INNER JOIN xxi.au_attach_obg au_e
                                   ON au_e.caccacc = au_s.caccacc
                                  AND au_e.cacccur = au_s.cacccur
                                  AND au_e.i_table = 304
                                  AND au_e.C_OLDDATA = '112/40'
                                WHERE au_s.caccacc = a.cACCacc
                                  AND au_s.cacccur = a.cACCcur
                                  AND au_s.i_table = 304
                                  AND au_s.d_create <= d2
                                  AND au_e.d_create >= d1
                                  AND add_months(last_day(au_s.d_create),11) > d1
                                  AND au_s.c_newdata = '112/40')
                -- < y.metalnikov@i-sys.ru 11/12/13
               and not exists (select 1
                                 from xxi.au_attach_obg au
                                where au.caccacc = a.cACCacc
                                  and au.cacccur = a.cACCcur
                                  and d_create > d1
                                  and d_create < d2
                                  and i_table = 304
                                  and au.c_newdata in (-- '112/35',UBRR Pashevich AO 14-99
                                                       '112/36','112/37','112/38',/*'112/39',*/'112/40','112/45'))
               -->> ubrr korolkov 12-1657(#9707)
               and not exists (select 'x'
                                 from xxi.au_attach_obg au
                                where au.caccacc = a.cACCacc
                                  and au.cacccur = a.cACCcur
                                  and add_months(last_day(au.d_create),3) > d1
                                  and au.d_create <= d2
                                  and au.i_table = v_autab
                                  and au.c_newdata = cg_112_59
                                  and not exists
                                    (select 'x' from xxi.au_attach_obg au2
                                      where au2.caccacc = au.caccacc
                                        and au2.cacccur = au.cacccur
                                        and au2.c_olddata = cg_112_59
                                        and au2.d_create >= au.d_create
                                        and add_months(au2.d_create,1) <= d2) )
               --<< ubrr korolkov 12-1657(#9707)
               and cACCacc = cTRNaccc
               and cACCcur = cTRNcurc
               and cACCprizn <> 'З'
               and not exists (select 1
                                 from sbs
                                where csbsdo like 'RE%'
                                  and csbsacc=ctrnaccc)
-->>--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты

              and not exists (select 1
                                from sbs
                               where csbsdo like 'R_Onl%'
                                 and csbsacc=ctrnaccc)
--<<--11.03.2016 15-1221.1 АБС: Доработка ТП "Онлайн +" (ОТКБ) #25313 Макарова Л.Ю. Мин.тариф, отс-ют обороты
---<<<UBRR Pashevich A. #12-508
               -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
               and not exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                             UBRR_UNIQUE_ACC_COMMS uuac 
                                       where ctrnaccc = uutc.cacc 
                                         and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF 
                                         and lc_idsmr = uutc.idsmr 
                                         and uutc.status = 'N'
                                         and uutc.uuta_id = uuac.uuta_id
                                         and uuac.com_type in ('RKBP','RKBK','RKO')
                                )               
               --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
--->>>UBRR Pashevich A. #12-508
                -->> 26.05.2015 ubrr korolkov 15-453
                and not exists (select 1
                                from gac
                                where cgacacc = a.cACCacc
                                and cgaccur = a.cACCcur
                                and igaccat = 112
                                and igacnum in (78,79,80,
                                99,100,101,102,103, --27.12.2018 Баязитов [15-43]
                                104,105,106,        -- Бизнес  Премиум  3, 6, 12  -- ubrr 31.05.2019 Ризанов Р.Т. [19-59153] АБС. Лимит платежей в пакеты услуг "Бизнес-Класс 3,6,12"
                                94)--24.09.2016 ubrr Maкарова Л.Ю. 16-2653 АБС: Кат/гр 112/94 для пакета услуг "Бизнес-комплект"
                                and exists (select 1
                                            from xxi.au_attach_obg au
                                            where au.caccacc = a.cACCacc
                                            and au.cacccur = a.cACCcur
                                            and i_table = 304
                                            and trunc(d_create) <= d2
                                            and au.c_newdata like '112/'||to_char(gac.igacnum)))
                --<< 26.05.2015 ubrr korolkov 15-453
-->> 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
               and not exists (select 1
                                 from gac
                                 where cgacacc = a.cACCacc
                                   and cgaccur = a.cACCcur
                                   and igaccat = 114
                                   and igacnum = 16)
--<< 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
               -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
               and not exists ( select 1
                                  from gac g
                                      ,ubrr_rko_exinc_catgr e
                                 where g.igaccat   = e.icat
                                   and g.igacnum   = e.igrp
                                   and e.ccom_type = 'REB'
                                   and e.exinc     = 0
                                   and g.cgacacc   = a.caccacc
                                   and g.cgaccur   = a.cACCcur
                                   and exists (select 1
                                                 from xxi.au_attach_obg au
                                                where au.caccacc = a.caccacc
                                                  and au.cacccur = a.cacccur
                                                  and au.i_table = 304
                                                  and trunc(au.d_create) <= d2
                                                  and au.c_newdata = g.igaccat||'/'||g.igacnum
                                                  and trunc(au.d_create) between nvl(e.date_start, dg_date_start) and nvl(e.date_end, dg_date_end) --<<22.01.2020 Баязитов [19-64846]
                                              )
                              )
               --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
             group by ctrnaccc,ctrncur,iACCotd, caccmail)
group by acc,ctrncur,iaccotd, caccmail);
DBMS_TRANSACTION.COMMIT;


----------------------------------------------------------------------------------------------------------------------------
-->> 22.06.2018 Пинаев Д. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)
/*
Ведение расчетного счета в режиме "Пакет Эконом с 01.07.18"
- с использованием системы удаленного доступа
*/
INSERT INTO SBS
   ( cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, cSBSdo ,iSBSdebdoc,mSBSdebob,iSBScreddoc,mSBScredob)
   (select to_char(sysdate,'HH24:MI:SS'), acc,ctrncur,
        /*    DECODE(iACCotd, 6264,650,6452,650,6487,700,6440,700,6245,750,6204,750,6935,700,6112,750,6473,750,6301,890,6303,890,6302,890,6213,890,6210,890,
                                          6216,890,6232,890,6240,890,6224,890,6208,890,6239,890,6220,890,6219,890,6217,890,6263,890,6269,890,6932,650,6428,700,6472,750,
                                          6489,750,6237,650,6257,650,6205,650,6482,690,6106,700,6412,700,6409,650,6933,750,6931,650,6485,650,6255,690,6254,650,6923,650,
                                          6927,650,6486,690,6427,690,6474,650,6105,850,6471,690,6253,690,6445,750,6201,700,6248,700,6250,650,6115,750,6464,750,6483,750,
                                          6925,650,6926,650,6921,650,6479,750,6417,700,6463,650,6246,750,6110,750,6422,750,6410,750,6460,750,6212,650,6453,650,6469,750,
                                          6116,850,6904,850,6442,700,6930,650,6922,650,6242,750,6418,650,6265,690,6222,650,6231,650,6470,700,6478,700,6261,700,6480,690,
                                          6109,750,6429,750,6413,750,6431,750,6488,750,6490,690,6107,750,6408,750,6406,750,6401,750,6403,750,6416,750,6937,750,6938,700,
                                          6939,750,6941,690,6948,850,6963,850,6967,850,6950,750,6951,750,6952,700,6953,750,6954,690,6955,750,6956,700,6968,750,6969,750,
                                          6970,750,6971,750,6973,750,6974,650,6975,750,6976,690,6981,650,6982,750,6983,750,6984,750,6985,700,6986,750,6988,750,6989,750,
                                          6990,700,6991,690,6992,650,6993,750,6994,750,6995,700,6996,650,6997,750,6998,750,6915,750,6905,700,6907,650,6910,650,6912,690,
                                          6913,750,6914,750,6942,700,6944,700,
                                          890),  -- 13.08.2020 Карачев А.А. План мероприятий по переводу Кировский в ВСП */
                          DECODE(iACCotd, 6948,950,6963,950,6967,950,6301,1000,6303,1000,6302,1000,6213,1000,6210,1000,6216,1000,6232,1000,6240,1000,
                                          6224,1000,6208,1000,6239,1000,6220,1000,6219,1000,6217,1000,6263,1000,6269,1000,6913,850,6915,850,6933,850,
                                          6986,850,6950,850,6951,850,6955,850,6953,850,6982,850,6984,850,6983,850,6988,850,6989,850,6993,850,6997,850,
                                          6994,850,6998,850,6914,850,6968,850,6973,850,6971,850,6969,850,6970,850,6975,850,6937,850,6939,850,6935,800,
                                          6956,800,6938,800,6985,800,6942,800,6201,800,6248,800,6995,800,6905,800,6990,800,6952,800,6261,800,6954,800,
                                          6255,800,6976,800,6912,800,6253,800,6265,800,6991,800,6490,800,6941,800,6925,800,6926,800,6264,800,6910,800,
                                          6932,800,6237,800,6257,800,6205,800,6974,800,6931,800,6254,800,6927,800,6981,800,6250,800,6463,800,6212,800,
                                          6907,800,6930,800,6996,800,6222,800,6231,800,6245,850,6204,850,6246,850,6242,850,6992,800,6923,800,6921,800,
                                        6922,800,9219,1000,9217,1000,6106,800,
                                          890),  -- 08.09.2020 Карачев А.А. СЗ, № 1122-05/078009 от 27.08.2020 Об изменении тарифов по ежемесячным комиссияим, по пакетам услуг
                     'REB_PE',
            sum(cd),sum(md),sum(cc),sum(mc)
       from (select ctrnaccd acc,ctrncur,count(1) c,iaccotd,count(1) cd,sum(mtrnsum) md ,0 cc,0 mc, caccmail
              from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v trn, acc a -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
             where ctrnaccd like acc_1
               and cTRNcur = 'RUR'
               and dtrntran between d1 and d2+86399/86400
               and substr(case when iTrnType in (5, 50, 53, 52, 55, 17, 41, 42, 43, 44) then nvl(cTrnClient_Acc, cTrnAccC) when cTrnMfoA is null then nvl(cTrnAccA, cTrnAccC) else cTrnAccA end, 1, 5) not in ('60309', '60322')
               AND caccacc NOT LIKE '40821________7%'
               and (   (    itrntype in (2,3,4,11,14,15,21,22,23,25,28)
                        and (   substr(itrnba2c,1,3) in (111,301,302,303,401,402,403,404,405,406,407,423,426)
                             or itrnba2c in (10000,40802,40807,40817,40818,40820,40911))
                        and exists (select 1
                                      from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v t -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                                     where t.ctrnaccd = trn.ctrnaccd
                                       and t.ctrncur = trn.ctrncur
                                       and dtrntran between d1 and d2+86399/86400
                                       /*and itrnsop=4*/))
                    or (    itrntype in (9,13)
                        and exists (select 1
                                      from gac
                                     where cgacacc = cTRNaccd
                                       and cgaccur = ctrncur
                                       and igaccat = 105
                                       and igacnum in (1,2,8,9,11))))
         and not (itrntype in (22,25) and regexp_like(ctrnpurp, '^ *(|! *)0406')
                  and exists (select 1 from xxi."smr" where csmrmfo8 = ctrnmfoa))
               and exists (select 1
                             from gac
                            where cgacacc = cACCacc
                              and cgaccur = cACCcur
                              and igaccat = 112
                              and igacnum = 97
                              and exists (select 1
                                            from xxi.au_attach_obg
                                           where cgacacc = caccacc
                                             and cgaccur = cacccur
                                             and trunc(d_create) <= d2
                                             and c_newdata ='112/97'))
               and not exists (select 1
                                 from gac
                                where cgacacc = a.cACCacc
                                  and cgaccur = a.cACCcur
                                  and igaccat = 333
                                  and igacnum = 2)
               and not exists (select 1
                                 from gac
                                where cgacacc = a.cACCacc
                                  and cgaccur = a.cACCcur
                                  and igaccat = 114
                                  and igacnum = 10
                                  and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = a.cACCacc
                                                and au.cacccur = a.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata = '114/10'))
                and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =a.CACCACC  and cacccur = a.CACCCUR
                                  and c_newdata = cg_112_72
                                  and d1 between trunc(d_create,'mm') and last_day(add_months (d_create,5))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum =72
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = cg_112_72
                                                        and a2.d_create> last_day(add_months (a1.d_create,5))
                                                )
                         )
              and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =a.CACCACC  and cacccur = a.CACCCUR
                                  and c_newdata = cg_112_35
                                  and d1 between trunc(d_create,'mm') and last_day(add_months (d_create,2))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum =35
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = cg_112_35
                                                        and a2.d_create> last_day(add_months (a1.d_create,2))
                                                )
                         )
              and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =a.CACCACC  and cacccur = a.CACCCUR
                                  and c_newdata = '112/93'
                                  and d1 between trunc(d_create,'mm') and last_day(add_months (d_create,2))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum = 93
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = '112/93'
                                                        and a2.d_create>last_day(add_months (a1.d_create,2))
                                                )
                         )
                AND NOT exists (SELECT 1
                                 FROM gac
                                WHERE cgacacc = a.cACCacc
                                  AND cgaccur = a.cACCcur
                                  AND igaccat = 112
                                  AND igacnum = 40
                                  AND exists (SELECT 1
                                                FROM xxi.au_attach_obg au
                                               WHERE au.caccacc = a.cACCacc
                                                 AND au.cacccur = a.cACCcur
                                                 AND au.i_table = 304
                                                 AND au.d_create <= d2
                                                 AND add_months(last_day(au.d_create),11) > d1
                                                 AND au.c_newdata = '112/40'))
                AND NOT exists (SELECT 1
                                 FROM xxi.au_attach_obg au_s
                                INNER JOIN xxi.au_attach_obg au_e
                                   ON au_e.caccacc = au_s.caccacc
                                  AND au_e.cacccur = au_s.cacccur
                                  AND au_e.i_table = 304
                                  AND au_e.C_OLDDATA = '112/40'
                                WHERE au_s.caccacc = a.cACCacc
                                  AND au_s.cacccur = a.cACCcur
                                  AND au_s.i_table = 304
                                  AND au_s.d_create <= d2
                                  AND au_e.d_create >= d1
                                  AND add_months(last_day(au_s.d_create),11) > d1
                                  AND au_s.c_newdata = '112/40')
               and not exists (select 1
                                 from xxi.au_attach_obg au
                                where au.caccacc = a.cACCacc
                                  and au.cacccur = a.cACCcur
                                  and d_create > d1
                                  and d_create < d2
                                  and i_table = 304
                                  and au.c_newdata in ('112/36','112/37','112/38','112/40','112/45'))
               and not exists (select 'x'
                                 from xxi.au_attach_obg au
                                where au.caccacc = a.cACCacc
                                  and au.cacccur = a.cACCcur
                                  and add_months(last_day(au.d_create),3) > d1
                                  and au.d_create <= d2
                                  and au.i_table = v_autab
                                  and au.c_newdata = cg_112_59
                                  and not exists
                                    (select 'x' from xxi.au_attach_obg au2
                                      where au2.caccacc = au.caccacc
                                        and au2.cacccur = au.cacccur
                                        and au2.c_olddata = cg_112_59
                                        and au2.d_create >= au.d_create
                                        and add_months(au2.d_create,1) <= d2) )
               and not exists (select 1
                                 from gac
                                where cgacacc = cACCacc
                                  and cgaccur = cACCcur
                                  and igaccat = 112
                                  and igacnum in (1,3,4,5,7,10,13,15,16,17,19,20,21,22,23,24,25,31,
                                                  36,37,38,39,40,45,57)
                              )
               and not exists (select 1
                                 from sbs
                                where csbsdo like 'RE%'
                                  and csbsacc=ctrnaccd)
              and not exists (select 1
                                from sbs
                               where csbsdo like 'R_Onl%'
                                 and csbsacc=ctrnaccd)
               and cACCacc = cTRNaccd
               and cACCcur = cTRNcur
               and cACCprizn <> 'З'
               -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
               and not exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                             UBRR_UNIQUE_ACC_COMMS uuac 
                                       where ctrnaccd = uutc.cacc 
                                         and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF 
                                         and lc_idsmr = uutc.idsmr 
                                         and uutc.status = 'N'
                                         and uutc.uuta_id = uuac.uuta_id
                                         and uuac.com_type in ('RKBP','RKBK','RKO')
                                )
               --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
               and not exists (select 1
                               from xxi.au_attach_obg au
                                 where     au.caccacc  = a.caccacc
                                        and au.cacccur = a.cacccur
                                        and c_newdata ='105/11'
                                        and trunc(au.d_create) <= to_date('18042013','dd.mm.yyyy')
                                        and exists (select 1
                                                     from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                                                      where     ctrnaccd   = a.caccacc
                                                            and ctrncurc   = a.cacccur
                                                            and dtrntran between d1 and d2+86399/86400
                                                            and ctrnidopen = 'CORREQTS')
                                        and d2<=to_date('31072013','dd.mm.yyyy hh24:mi:ss')
                              )
                and not exists (select 1
                                from gac
                                where cgacacc = a.cACCacc
                                and cgaccur = a.cACCcur
                                and igaccat = 112
                                and igacnum in (78,79,80,94
                                ,99,100,101,102,103 --27.12.2018 Баязитов [15-43]
                                ,104,105,106        -- Бизнес  Премиум  3, 6, 12  -- ubrr 31.05.2019 Ризанов Р.Т. [19-59153] АБС. Лимит платежей в пакеты услуг "Бизнес-Класс 3,6,12"
                                )
                                and exists (select 1
                                            from xxi.au_attach_obg au
                                            where au.caccacc = a.cACCacc
                                            and au.cacccur = a.cACCcur
                                            and i_table = 304
                                            and trunc(d_create) <= d2
                                            and au.c_newdata like '112/'||to_char(gac.igacnum)))
-->> 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
               and not exists (select 1
                                 from gac
                                 where cgacacc = a.cACCacc
                                   and cgaccur = a.cACCcur
                                   and igaccat = 114
                                   and igacnum = 16)
--<< 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
               -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
               and not exists ( select 1
                                  from gac g
                                      ,ubrr_rko_exinc_catgr e
                                 where g.igaccat   = e.icat
                                   and g.igacnum   = e.igrp
                                   and e.ccom_type = 'REB_PE'
                                   and e.exinc     = 0
                                   and g.cgacacc   = a.caccacc
                                   and g.cgaccur   = a.cACCcur
                                   and exists (select 1
                                                 from xxi.au_attach_obg au
                                                where au.caccacc = a.caccacc
                                                  and au.cacccur = a.cacccur
                                                  and au.i_table = 304
                                                  and trunc(au.d_create) <= d2
                                                  and au.c_newdata = g.igaccat||'/'||g.igacnum
                                                  and trunc(au.d_create) between nvl(e.date_start, dg_date_start) and nvl(e.date_end, dg_date_end) --<<22.01.2020 Баязитов [19-64846]
                                              )
                              )
               --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
             group by ctrnaccd,ctrncur,iACCotd, caccmail
             UNION ALL
            select ctrnaccc acc,ctrncur,count(1) c,iaccotd,0 cd,0 md,count(1) cc,sum(mtrnsum) mc, caccmail
              from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v, acc a -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
             where ctrnaccc like acc_1
               and cTRNcurc = 'RUR'
               and dtrntran between d1 and d2+86399/86400
               and not (ctrnaccd like '30232%' and lower(replace(ctrnpurp, ' ')) like 'возм%термин%')
               and substr(nvl(ctrnacca,0),1,5) not in ('47426', '70606')
               and substr(ctrnaccd,1,5) not in ('47426', '70606')
               AND caccacc NOT LIKE '40821________7%'
               and itrntype in (-7, 2, 5, 10, 12, 51, 53, 55)
               and not exists (select 1
                                 from gac
                                where cgacacc = cACCacc
                                  and cgaccur = cACCcur
                                  and igaccat = 112
                                  and igacnum in (1,3,4,5,7,10,13,15,16,17,19,20,21,22,23,24,25,31,
                                                  36,37,38,39,40,45,57)
                               )
               and exists (select 1
                             from gac
                            where cgacacc = cACCacc
                              and cgaccur = cACCcur
                              and igaccat = 112
                              and igacnum=97
                              and exists (select 1
                                            from xxi.au_attach_obg
                                           where cgacacc = caccacc
                                             and cgaccur = cacccur
                                             and trunc(d_create) <= d2
                                             and c_newdata ='112/97'))
               and exists (select 1
                             from gac
                            where cgacacc = cACCacc
                              and cgaccur = cACCcur
                              and igaccat = 105
                              and igacnum in (1,2,8,9,11))
               and not exists (select 1
                                 from gac
                                where cgacacc = a.cACCacc
                                  and igaccat = 333
                                  and igacnum = 2)
               and not exists (select 1
                                 from gac
                                where cgacacc = a.cACCacc
                                  and cgaccur = a.cACCcur
                                  and igaccat = 114
                                  and igacnum = 10
                                  and exists (select 1
                                               from xxi.au_attach_obg au
                                              where au.caccacc = a.cACCacc
                                                and au.cacccur = a.cACCcur
                                                and i_table = 304
                                                and d_create <= d2
                                                and au.c_newdata = '114/10'))
               and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =a.CACCACC  and cacccur = a.CACCCUR
                                  and c_newdata = cg_112_72
                                  and d1 between trunc(d_create,'mm') and last_day(add_months (d_create,5))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum =72
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = cg_112_72
                                                        and a2.d_create> last_day ( add_months (a1.d_create,5))
                                                )
                         )
               and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =a.CACCACC  and cacccur = a.CACCCUR
                                  and c_newdata = cg_112_35
                                  and d1 between trunc(d_create,'mm') and last_day(add_months (d_create,2))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum =35
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = cg_112_35
                                                        and a2.d_create>last_day(add_months (a1.d_create,2))
                                                )

                         )
              and not exists ( select 1
                          from au_attach_obg a1
                            where     caccacc =a.CACCACC  and cacccur = a.CACCCUR
                                  and c_newdata = '112/93'
                                  and d1 between trunc(d_create,'mm') and last_day(add_months (d_create,2))
                                  and exists ( select 1 from gac
                                                where     cgacacc =a1.caccacc and gac.CGACCUR=a1.cacccur and igaccat = 112 and igacnum = 93
                                               union
                                                select 1
                                                 from au_attach_obg a2
                                                  where     a2.caccacc   = a1.caccacc
                                                        and a2.cacccur   = a1.cacccur
                                                        and a2.i_table   = v_autab
                                                        and a2.c_olddata = '112/93'
                                                        and a2.d_create>last_day(add_months (a1.d_create,2))
                                                )

                         )
                AND NOT exists (SELECT 1
                                 FROM gac
                                WHERE cgacacc = a.cACCacc
                                  AND cgaccur = a.cACCcur
                                  AND igaccat = 112
                                  AND igacnum = 40
                                  AND exists (SELECT 1
                                                FROM xxi.au_attach_obg au
                                               WHERE au.caccacc = a.cACCacc
                                                 AND au.cacccur = a.cACCcur
                                                 AND au.i_table = 304
                                                 AND au.d_create <= d2
                                                 AND add_months(last_day(au.d_create),11) > d1
                                                 AND au.c_newdata = '112/40'))
                AND NOT exists (SELECT 1
                                 FROM xxi.au_attach_obg au_s
                                INNER JOIN xxi.au_attach_obg au_e
                                   ON au_e.caccacc = au_s.caccacc
                                  AND au_e.cacccur = au_s.cacccur
                                  AND au_e.i_table = 304
                                  AND au_e.C_OLDDATA = '112/40'
                                WHERE au_s.caccacc = a.cACCacc
                                  AND au_s.cacccur = a.cACCcur
                                  AND au_s.i_table = 304
                                  AND au_s.d_create <= d2
                                  AND au_e.d_create >= d1
                                  AND add_months(last_day(au_s.d_create),11) > d1
                                  AND au_s.c_newdata = '112/40')
               and not exists (select 1
                                 from xxi.au_attach_obg au
                                where au.caccacc = a.cACCacc
                                  and au.cacccur = a.cACCcur
                                  and d_create > d1
                                  and d_create < d2
                                  and i_table = 304
                                  and au.c_newdata in ('112/36','112/37','112/38','112/40','112/45'))
               and not exists (select 'x'
                                 from xxi.au_attach_obg au
                                where au.caccacc = a.cACCacc
                                  and au.cacccur = a.cACCcur
                                  and add_months(last_day(au.d_create),3) > d1
                                  and au.d_create <= d2
                                  and au.i_table = v_autab
                                  and au.c_newdata = cg_112_59
                                  and not exists
                                    (select 'x' from xxi.au_attach_obg au2
                                      where au2.caccacc = au.caccacc
                                        and au2.cacccur = au.cacccur
                                        and au2.c_olddata = cg_112_59
                                        and au2.d_create >= au.d_create
                                        and add_months(au2.d_create,1) <= d2) )
               and cACCacc = cTRNaccc
               and cACCcur = cTRNcurc
               and cACCprizn <> 'З'
               and not exists (select 1
                                 from sbs
                                where csbsdo like 'RE%'
                                  and csbsacc=ctrnaccc)
               and not exists (select 1
                                from sbs
                               where csbsdo like 'R_Onl%'
                                 and csbsacc=ctrnaccc)
               -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
               and not exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                             UBRR_UNIQUE_ACC_COMMS uuac 
                                       where ctrnaccc = uutc.cacc 
                                         and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF 
                                         and lc_idsmr = uutc.idsmr 
                                         and uutc.status = 'N'
                                         and uutc.uuta_id = uuac.uuta_id
                                         and uuac.com_type in ('RKBP','RKBK','RKO')
                                )               
               --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
               and not exists (select 1
                                from gac
                                where cgacacc = a.cACCacc
                                and cgaccur = a.cACCcur
                                and igaccat = 112
                                and igacnum in (78,79,80,94,
                                99,100,101,102,103 --27.12.2018 Баязитов [15-43]
                                ,104,105,106        -- Бизнес  Премиум  3, 6, 12  -- ubrr 31.05.2019 Ризанов Р.Т. [19-59153] АБС. Лимит платежей в пакеты услуг "Бизнес-Класс 3,6,12"
                                )
                                and exists (select 1
                                            from xxi.au_attach_obg au
                                            where au.caccacc = a.cACCacc
                                            and au.cacccur = a.cACCcur
                                            and i_table = 304
                                            and trunc(d_create) <= d2
                                            and au.c_newdata like '112/'||to_char(gac.igacnum)))
-->> 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
               and not exists (select 1
                                 from gac
                                 where cgacacc = a.cACCacc
                                   and cgaccur = a.cACCcur
                                   and igaccat = 114
                                   and igacnum = 16)
--<< 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
               -->>ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
               and not exists ( select 1
                                  from gac g
                                      ,ubrr_rko_exinc_catgr e
                                 where g.igaccat   = e.icat
                                   and g.igacnum   = e.igrp
                                   and e.ccom_type = 'REB_PE'
                                   and e.exinc     = 0
                                   and g.cgacacc   = a.caccacc
                                   and g.cgaccur   = a.cACCcur
                                   and exists (select 1
                                                 from xxi.au_attach_obg au
                                                where au.caccacc = a.caccacc
                                                  and au.cacccur = a.cacccur
                                                  and au.i_table = 304
                                                  and trunc(au.d_create) <= d2
                                                  and au.c_newdata = g.igaccat||'/'||g.igacnum
                                                  and trunc(au.d_create) between nvl(e.date_start, dg_date_start) and nvl(e.date_end, dg_date_end) --<<22.01.2020 Баязитов [19-64846]
                                              )
                              )
               --<<ubrr 13.12.2019  Ризанов Р.Т. [69650] Новый тарифный план - комиссия за зачисление
             group by ctrnaccc,ctrncur,iACCotd, caccmail)
group by acc,ctrncur,iaccotd, caccmail);
DBMS_TRANSACTION.COMMIT;
--<< 22.06.2018 Пинаев Д. [18-464] Доп к [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей)
-->>27.01.2020 Баязитов [19-70025] АБС: Тарифный план "Промо Online"
merge into xxi."sbs" r
using ( select s1.CSBSACC
              ,s1.CSBSCUR
              ,s1.MSBSTOLL_SUM
              ,s1.CSBSTOLL_CUR
              ,s1.CSBSPAYFROM_ACC
              ,s1.CSBSPAYFROM_CUR
              ,s1.CSBSDO
              ,s1.MSBSCOMM
              ,s1.ISBSDEBDOC
              ,s1.ISBSCREDDOC
              ,s1.MSBSDEBOB
              ,s1.MSBSCREDOB
              ,s1.IDSMR
              ,s1.CSBSACC_ZAM
              ,s1.CSBSCUR_ZAM
              ,s1.ISBSOTDNUM       -- замененный МВЗ НТК
          from ( select s.CSBSACC
                       ,s.CSBSCUR
                       ,s.MSBSTOLL_SUM
                       ,s.CSBSTOLL_CUR
                       ,s.CSBSPAYFROM_ACC
                       ,s.CSBSPAYFROM_CUR
                       ,s.CSBSDO
                       ,s.MSBSCOMM
                       ,s.ISBSDEBDOC
                       ,s.ISBSCREDDOC
                       ,s.MSBSDEBOB
                       ,s.MSBSCREDOB
                       ,s.IDSMR
                       ,s.CSBSACC_ZAM
                       ,s.CSBSCUR_ZAM
                       ,tar.cmvz ISBSOTDNUM
                       ,g.IGACNUM
                       ,row_number() over ( partition by g.cgacacc,g.cgaccur,g.idsmr order by null) rn
                   from xxi."sbs" s
                       ,gac       g
                       ,ubrr_comm_gacmvz_tarif tar
                  where s.idsmr   = lc_idsmr
                    and s.CSBSDO  = 'REB_PE'
                    and s.CSBSACC like acc_1
                    and g.cgacacc = s.csbsacc
                    and g.cgaccur = s.csbscur
                    and g.idsmr   = s.idsmr
                    and g.igaccat = tar.icat
                    and g.igacnum = tar.inum
                    and g.igaccat = 131
                    and exists (select 1
                                  from xxi.au_attach_obg au
                                 where au.caccacc = g.cgacacc
                                   and au.cacccur = g.cgaccur
                                   and i_table    = 304
                                   and d_create  <= d2
                                   and au.c_newdata like '131%')
               ) s1
          where s1.rn =1 -- защита от множественности 131 категории с разными значениями в gac
)  n
on (     r.csbsacc = n.csbsacc
     and r.csbscur = n.csbscur
     and r.csbsdo  = n.csbsdo
     and r.idsmr   = n.idsmr
)
when matched then
       update set msbstoll_sum = /*decode(n.isbsotdnum, 6105, 850, 6948, 850, 8481, 850, 8487, 850, 8488, 850, 8490, 850, 8492, 850, 8494, 850, 8486, 850, --Москва
8484, 850, 8544, 850, 8482, 850, 8543, 850, 6904, 850, 6967, 850, 6116, 850,6963, 850, 8485, 850, 8545, 850, --Санкт-Петербург
6483, 750, 8495, 750, 6115, 750, 6464, 750, --Новосибирск
6933, 750, 8519, 750, 6458, 750, 8560, 750, --Краснодар
6489, 750, 6472, 750, 8491, 750, 6915, 750, 6913, 750, --Казань
6445, 750, 8499, 750, 6986, 750, --Нижний Новгород
8493, 750, 6469, 750, 6989, 750, --Самара
6934, 750, 8518, 750, --Ростов-на-Дон
8090, 750, --Красноярск
6479, 750, 8496, 750, --Омск
6261, 700, 8501, 700,--Тюмень
8511, 700, --Владивосток
6487, 700, 8505, 700, --Барнаул
6935, 700, 8517, 700,--Волгоград
8509, 700, --Иркутск
6442, 700, 6454, 700, 8500, 700, 6908, 700, 6905, 700,--Саратов
8514, 700, --Сочи
6470, 700, 8502, 700, 6990, 700,--Тольятти
8510, 700, --Хабаровск
8044, 700, --Ярославль
8520, 700, --Ярославль, новое мвз
8512, 700, --Рязань
8516, 700, --Анапа
8515, 700, --Адлер
8066, 690, --Пенза
8504, 690, 6486, 690, 6941, 690,--Липецк
8306, 690, --Владимир
8216, 690, --Вологда
8542, 690, --Вологда, новое мвз
8243, 690, --Брянск
8483, 690, 6491, 690,--Улан-Удэ
6899, 690, --Новокузнецк
8129, 690, --Орел
8521, 690, --Орел, новое мвз
8234, 690, --Тамбов
8522, 690, --Тамбов, новое мвз
8114, 690, --Великий Новгород
8506, 690, 6480, 690, 6991, 690, --Ульяновск
8507, 690, 6471, 690, 6912, 690,--Набережные Челны
8220, 690, --Старый оскол
8523, 690, --Старый оскол, новое мвз
8009, 650, --Нефтекамск
8070, 650, --Октябрьский
8209, 650, --Белорецк
8558, 690, --Чебоксары
8557, 650, --Орск
8524,690,8525,690,8526,850,8527,850,8528,850,8529,850,8530,850,8531,850,8532,850,8533,690,8534,700,8535,690,8536,750,8537,690,8538,750,8539,750,8540,700,8541,700,
8546,650,8547,750,8548,750,8549,700,8550,700,8551,690,8552,690,8553,650,8554,650,8555,750,8556,690,6950,750,6951,750,6953,750,6955,750,6956,700,
8559,750, 8561,850, 8562,850, 8563,850, 8564,850, --Прочие города 
650
)  -- 12.05.2020 Карачев А.А. План мероприятий по переводу Пермский, Уфимский в ВСП */
decode(n.isbsotdnum,6948,950,6963,950,6967,950,6301,1000,6303,1000,6302,1000,6213,1000,6210,1000,6216,1000,6232,1000,6240,1000,
                    6224,1000,6208,1000,6239,1000,6220,1000,6219,1000,6217,1000,6263,1000,6269,1000,6913,850,6915,850,6933,850,
                    6986,850,6950,850,6951,850,6955,850,6953,850,6982,850,6984,850,6983,850,6988,850,6989,850,6993,850,6997,850,
                    6994,850,6998,850,6914,850,6968,850,6973,850,6971,850,6969,850,6970,850,6975,850,6937,850,6939,850,6935,800,
                    6956,800,6938,800,6985,800,6942,800,6201,800,6248,800,6995,800,6905,800,6990,800,6952,800,6261,800,6954,800,
                    6255,800,6976,800,6912,800,6253,800,6265,800,6991,800,6490,800,6941,800,6925,800,6926,800,6264,800,6910,800,
                    6932,800,6237,800,6257,800,6205,800,6974,800,6931,800,6254,800,6927,800,6981,800,6250,800,6463,800,6212,800,
                    6907,800,6930,800,6996,800,6222,800,6231,800,6245,850,6204,850,6246,850,6242,850,6992,800,6923,800,6921,800,
                    6922,800,
                    8526,950,8528,950,8529,950,8530,950,8532,950,8531,950,8527,950,8561,950,8562,950,8563,950,8564,950,8543,950,
                    8544,950,8545,950,8555,850,8519,850,8560,850,8536,850,8548,850,8538,850,8559,850,8539,850,8518,850,8547,850,
                    8515,800,8516,800,8540,800,8511,800,8517,800,8541,800,8534,800,8549,800,8514,800,8550,800,8501,800,8510,800,
                    8520,800,8524,800,8114,800,8525,800,8542,800,8533,800,8556,800,8535,800,8521,800,8552,800,8523,800,8522,800,
                    8537,800,8551,800,8558,800,8557,800,8554,800,8546,800,8553,800,6106,800,
                    650
)  -- 08.09.2020 Карачев А.А. СЗ, № 1122-05/078009 от 27.08.2020 Об изменении тарифов по ежемесячным комиссияим, по пакетам услуг
             ,isbsotdnum   = n.isbsotdnum;
DBMS_TRANSACTION.COMMIT;
--<<27.01.2020 Баязитов [19-70025] АБС: Тарифный план "Промо Online"




----------------------------------------------------------------------------------------------------------------------------
-- UBRR Pashevich AO 14-959
--ТП "Яблоко"
-- плата за платежи с 17:00 до 18:00 код '017'
--Проведение платежей текущей датой:
--с с 17-00 ч до 18-00 ч
-- межбанковский платеж
INSERT INTO SBS
   ( cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, msbscomm, cSBSdo, iSBSdebdoc,msbsdebob )
   (-->> UBRR Pashevich AO 14-1344 Переходим на лимит за день
    Select to_char(sysdate,'HH24:MI:SS'), ctrnaccd,ctrncur, sum(mSBStoll_sum), sum(msbscomm) , csbsdo , sum(iSBSdebdoc) , sum(msbsdebob)
    From
    (
    select  ctrnaccd,ctrncur,
          ubrr_rko.F_GetComSum( p_com         => '017_App',
                                 p_otd         => iACCotd,
                                 p_countpay    => sum(case when (quickly_pay=1 and substr (ctrnpurp,1,1)='!') or (quickly_pay=0 and substr (ctrnpurp,1,1)<>'!') or quickly_pay=3 then 1 else 0 end),
                                 p_quickly_pay => quickly_pay) mSBStoll_sum,
          ubrr_rko.F_GetComSum( p_com         => '017_App',
                                p_otd         => iACCotd,
                                p_countpay    =>  sum(case when (quickly_pay=1 and substr (ctrnpurp,1,1)='!') or (quickly_pay=0 and substr (ctrnpurp,1,1)<>'!') or quickly_pay=3 then 1 else 0 end),
                                p_quickly_pay => quickly_pay) msbscomm,
          '017_App_'||substr(quickly_pay,1,1) cSBSdo,
          sum(case when (quickly_pay=1 and substr (ctrnpurp,1,1)='!') or (quickly_pay=0 and substr (ctrnpurp,1,1)<>'!') or quickly_pay=3 then 1 else 0 end) iSBSdebdoc,
          sum(mtrnsum) msbsdebob from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v, acc a, ubrr_rko_comms c -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
    where ctrnaccd like acc_1
      and ctrncur = 'RUR'
      and dtrntran between d1 and d2+86399/86400
      and (   (    itrntype in (4,11,15,21,22,23)
               and not (   --itrnpriority in (3,4,5) and -- 01.09.2017 Макарова Л.Ю. [17-847] АБС: Некорректное списание комиссии за налоговые платежи # 46295
                         substr(ctrnacca,1,3) in ('401', '402', '403', '404')
                        and exists (select 1
                                      from trn_dept_info
                                     where inum = itrnnum
                                       and ianum = itrnanum
                                       and ccreatstatus is not null))
               )
            )
      and not (itrntype=4 and itrnsop=51 and ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
  -->> ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
         and not (itrntype = 22 and regexp_like(ctrnpurp, '^ *(|! *)0406')
                  and exists (select 1 from xxi."smr" where csmrmfo8 = ctrnmfoa))
         --<< ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
      and iTRNba2d not in (40813,40817,40818,40820,42309
                          ,40810,40811,40812,40823,40824 -->><<-- ubrr 12.07.2016 Арсланов Д.Ф. #30780
                          )
      and caccacc = ctrnaccd
      and cacccur = ctrncur
      and cACCprizn <> 'З'
      and substr(caccacc,1,3) not in ('401','402','403','404','409')
      and to_char(itrnbatnum) like '__10'
      -- >>MakarovaLU 14-959 аудит уст. кат. Яблоко
      and exists (select 1
                                from gac
                               where cgacacc = a.cACCacc
                                 and cgaccur = a.cACCcur
                                 and igaccat = 112
                                 and igacnum = 70
                                 and exists (select 1
                                              from xxi.au_attach_obg au
                                             where au.caccacc = gac.CGACACC
                                               and au.cacccur = gac.CGACCUR
                                               and i_table = 304
                                               and d_create <= d2
                                               and au.c_newdata like '112/70'))
      -- >>MakarovaLU 14-959 аудит уст. кат. Яблоко
      and not exists (select 1
                        from gac
                       where cgacacc = a.cACCacc
                         and igaccat = 333
                         and igacnum = 2)
      and not exists (select 1
                          from gac
                         where cgacacc = a.cACCacc
                           and cgaccur = a.cACCcur
                           and igaccat = 131
                           and exists (select 1
                                        from xxi.au_attach_obg au
                                       where au.caccacc = a.cACCacc
                                         and au.cacccur = a.cACCcur
                                         and i_table = 304
                                         and d_create <= d2
                                         and au.c_newdata like '131%'))
      -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
      and not exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                   UBRR_UNIQUE_ACC_COMMS uuac 
                             where ctrnaccd = uutc.cacc 
                               and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF 
                               and lc_idsmr = uutc.idsmr 
                               and uutc.status = 'N'
                               and uutc.uuta_id = uuac.uuta_id
                               and uuac.com_type = '017'     
                      )      
      --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
      and c.com_code like '017_App%' and c.count_pay=999999
     group by ctrnaccd,ctrncur,iACCotd,quickly_pay,DTRNCREATE
     having sum(case when (quickly_pay=1 and substr (ctrnpurp,1,1)='!') or (quickly_pay=0 and substr (ctrnpurp,1,1)<>'!') or quickly_pay=3 then 1 else 0 end)>0)
      group by ctrnaccd,ctrncur, csbsdo
    --<< UBRR Pashevich AO 14-1344
      );
DBMS_TRANSACTION.COMMIT;
-- UBRR Pashevich AO 14-959



----------------------------------------------------------------------------------------------------------------------------
/* UBRR Pashevich A. # 12-508
Проведение платежей текущей датой:
с с 17-00 ч до 18-00 ч
- межбанковский платеж
- крупные клиенты
*/

  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif := 'Y';          --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)
  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif_id_check := 'N'; --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)

INSERT INTO SBS
   ( cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, msbscomm, cSBSdo, iSBSdebdoc,msbsdebob )
   (select to_char(sysdate,'HH24:MI:SS'), ctrnaccd,ctrncur,
            count(1) * ubrr_xxi5.UBRR_UNIQ_ACC_SUM(ctrnaccd,ctrncur,iaccotd,d1,'017',sum(mtrnsum),0),  -- 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
            ubrr_xxi5.UBRR_UNIQ_ACC_SUM(ctrnaccd,ctrncur,iaccotd,d1,'017',sum(mtrnsum),0),  -- 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
            '017',count(1),sum(mtrnsum)
    from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v, acc a -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
    where ctrnaccd like acc_1
    and ctrncur = 'RUR'
    and dtrntran between d1 and d2+86399/86400
    and ( (itrntype in (4,11,15,21,22,23)
           and not (-->> 20.12.2013 ubrr korolkov 12-2288 (#11418)
                    -- itrnpriority in (3,4,5) and -- 01.09.2017 Макарова Л.Ю. [17-847] АБС: Некорректное списание комиссии за налоговые платежи # 46295
                    --<< 20.12.2013 ubrr korolkov 12-2288 (#11418)
                    substr(ctrnacca,1,3) in ('401', '402', '403', '404')
                    and exists (select 1
                                from trn_dept_info
                                where inum = itrnnum
                                and ianum = itrnanum
                                and ccreatstatus is not null))
           )
            /*or (    itrntype = 23
                and itrnpriority not in (3,4,5))*/ -- 20.12.2013 ubrr korolkov 12-2288 (#11418)
        )
    and not (itrntype=4 and itrnsop=51 and ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
    -->> ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
    and not (itrntype = 22 and regexp_like(ctrnpurp, '^ *(|! *)0406')
             and exists (select 1 from xxi."smr" where csmrmfo8 = ctrnmfoa))
    --<< ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
    and iTRNba2d not in (40813,40817,40818,40820,
                         -- UBRR Pashevich A. 12-101
                         42309
                         -- UBRR Pashevich A. 12-101
                         )
    and caccacc = ctrnaccd
    and cacccur = ctrncur
    and cACCprizn <> 'З'
    and substr(caccacc,1,3) not in ('401','402','403','404','409')
    and to_char(itrnbatnum) like '__10'
    -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
    and exists (select 1
                from UBRR_UNIQUE_TARIF_ACC uutc,
                     UBRR_UNIQUE_ACC_COMMS uuac
                where ctrnaccd = uutc.cacc
                  and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF
                  and lc_idsmr = uutc.idsmr
                  and uutc.status = 'N'
                  and uutc.uuta_id = uuac.uuta_id
                  and uuac.daily = 'N'
                  and uuac.com_type = '017')  
    --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
    group by ctrnaccd,ctrncur,iACCotd);
  
  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif := 'N';          --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)
  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif_id_check := 'Y'; --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)
    
DBMS_TRANSACTION.COMMIT;

----------------------------------------------------------------------------------------------------------------------------
  -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ  
  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif := 'Y';          --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)
  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif_id_check := 'N'; --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)

  --Комиссия за межбанковские платежи, проводимые текущей датой после 18:00 
  --для Крупных клиентов
  INSERT INTO SBS
  (cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, msbscomm, cSBSdo, iSBSdebdoc,msbsdebob )
  (select to_char(sysdate,'HH24:MI:SS'), 
          ctrnaccd,
          ctrncur,
          count(1) * ubrr_xxi5.UBRR_UNIQ_ACC_SUM(ctrnaccd,ctrncur,iaccotd,d1,'018',sum(mtrnsum),0), 
         ubrr_xxi5.UBRR_UNIQ_ACC_SUM(ctrnaccd,ctrncur,iaccotd,d1,'018',sum(mtrnsum),0),
          '018',
          count(1),
          sum(mtrnsum)
     from ubrr_trn_old_new_v, acc a 
    where ctrnaccd like acc_1
      and ctrncur = 'RUR'
      and dtrntran between d1 and d2+86399/86400
      and ( (itrntype in (4,11,15,21,22,23)
             and not (
                      substr(ctrnacca,1,3) in ('401', '402', '403', '404')
                      and exists (select 1
                                  from trn_dept_info
                                  where inum = itrnnum
                                  and ianum = itrnanum
                                  and ccreatstatus is not null))
             )
          )
      and not (itrntype=4 and itrnsop=51 and ctrnpurp like '0450%')
      and not (itrntype = 22 and regexp_like(ctrnpurp, '^ *(|! *)0406')
               and exists (select 1 from xxi."smr" where csmrmfo8 = ctrnmfoa))
      and iTRNba2d not in (40813,40817,40818,40820,42309)
      and caccacc = ctrnaccd
      and cacccur = ctrncur
      and cACCprizn <> 'З'
      and substr(caccacc,1,3) not in ('401','402','403','404','409')
      and to_char(itrnbatnum) like '__13'
      and exists (select 1
                  from UBRR_UNIQUE_TARIF_ACC uutc,
                       UBRR_UNIQUE_ACC_COMMS uuac
                  where ctrnaccd = uutc.cacc
                    and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF
                    and lc_idsmr = uutc.idsmr
                    and uutc.status = 'N'
                    and uutc.uuta_id = uuac.uuta_id
                    and uuac.daily = 'N'
                    and uuac.com_type = '018')    
      group by ctrnaccd,ctrncur,iACCotd);
  
  DBMS_TRANSACTION.COMMIT;

  --Комиссия за внутрибанковские платежи на бумаге 
  --для Крупных клиентов
  INSERT INTO SBS
  (cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, msbscomm, cSBSdo, iSBSdebdoc,msbsdebob )
   select to_char(sysdate,'HH24:MI:SS'), 
          ctrnaccd,
          ctrncur,
          count(1) * ubrr_xxi5.UBRR_UNIQ_ACC_SUM(ctrnaccd,ctrncur,iaccotd,d1,'PP3',sum(mtrnsum),0), 
          ubrr_xxi5.UBRR_UNIQ_ACC_SUM(ctrnaccd,ctrncur,iaccotd,d1,'PP3',sum(mtrnsum),0),
          'PP3',
          count(1),
          sum(mtrnsum)
    from ubrr_trn_old_new_v t,
         acc a,
         otd o
   where t.ctrnaccd like acc_1
     and t.ctrncur = 'RUR'
     and t.dtrntran between d1 and d2+86399/86400
     and a.caccacc = t.ctrnaccd
     and a.cacccur = t.ctrncur
     and a.caccprizn <> 'З'
     and o.iotdnum = a.iaccotd
     and ((((itrntype in (2, 3, 14) and itrnpriority not in (3, 4) and nvl(iTRNsop, 0) <> 4)
         or  (itrntype in (25, 28)
              and nvl(iTRNsop, 0) not in (5, 7)
              and itrnpriority not in (3, 4)
              and nvl(iTRNsop, 0) <> 4  -- 01.06.18 Макарова Л.Ю. https://redmine.lan.ubrr.ru/issues/52982
              and not (itrntype = 25
                   and regexp_like(ctrnpurp, '^ *(|! *)0406')
                   and exists
                           (select 1
                            from xxi."smr"
                            where csmrmfo8 = ctrnmfoa))))
           and (substr(itrnba2c, 1, 3) in (303, 405, 406, 407, 423, 426)
             or  itrnba2c in (40802, 40807, 40817, 40818, 40820)))
           or  (itrntype in (4, 11, 15, 21, 23)
            and not (substr(ctrnacca, 1, 3) in ('401', '402', '403', '404')
                 and exists
                         (select 1
                          from trn_dept_info
                          where inum = itrnnum and ianum = itrnanum and ccreatstatus is not null))
            and nvl(iTRNsop, 0) <> 4
            and ctrnmfoa in (select cfilmfo
                             from xxi."fil"
                             where idsmr = ubrr_xxi5.ubrr_util.GetBankIdSmr)
            and not (itrntype=4 and itrnsop=51 and ctrnpurp like '0450%') )) -->><<--17.09.2019 Баязитов испр. начисления        
     and iTRNba2d not in (40813, 40817, 40818, 40820, 42309, 40810, 40811, 40812, 40823, 40824)
     and cACCacc <> '40703810100080000005'
     and substr(caccacc, 1, 3) not in ('401', '402', '403', '404', '409')
     and not exists
             (select 1
              from gac
              where cgacacc = ctrnaccC and cgaccur = a.cacccur and igaccat = 333 and igacnum = 2)
     and not exists
                 (select 1
                  from gac
                  where cgacacc = cACCacc
                    and cgaccur = cACCcur
                    and igaccat = 112
                    and igacnum in (1, 3, 4, 5, 7, 9, 10, 11, 13, 15, 16, 17, 19, 20, 21, 22, 23, 25, 31))
    and exists
             (select 1
              from UBRR_UNIQUE_TARIF_ACC uutc,
                   UBRR_UNIQUE_ACC_COMMS uuac
              where ctrnaccd = uutc.cacc
                and dtrncreate between uutc.dopentarif and uutc.dcanceltarif
                and lc_idsmr = uutc.idsmr
                and uutc.status = 'N'
                and uutc.uuta_id = uuac.uuta_id
                and uuac.daily = 'N'
                and uuac.com_type = 'PP3')        
     and not exists
                 (select 1
                  from gac
                  where cgacacc = a.cACCacc and cgaccur = a.cACCcur and igaccat = 112 and igacnum in (78, 79, 80, 94
                  ,99,100,101,102,103 --27.12.2018 Баязитов [15-43]  АБС: Новый пакет услуг с авансовой оплатой за пакет платежей
                  ,104,105,106 -- Бизнес  Премиум  3, 6, 12  -- ubrr 31.05.2019 Ризанов Р.Т. [19-59153] АБС. Лимит платежей в пакеты услуг "Бизнес-Класс 3,6,12"
                  )
                    and exists
                            (select 1
                             from xxi.au_attach_obg au
                             where au.caccacc = a.cACCacc
                               and au.cacccur = a.cACCcur
                               and i_table = 304
                               and trunc(d_create) <= d2
                               and au.c_newdata like '112/' || to_char(gac.igacnum)))
     and not exists
                 (select 1
                  from gac
                  where cgacacc = a.cACCacc
                    and cgaccur = a.cACCcur
                    and igaccat = 112
                    and igacnum in (73, 74)
                    and exists
                            (select 1
                             from gac
                             where cgacacc = a.cACCacc and cgaccur = a.cACCcur and igaccat = 333 and igacnum = 4)
                    and exists
                            (select 1
                             from xxi.au_attach_obg au
                             where au.caccacc = a.cACCacc
                               and au.cacccur = a.cACCcur
                               and i_table = 304
                               and d_create <= d2
                               and au.c_newdata in ('112/73', '112/74'))
                    and exists
                            (select 1
                             from xxi.au_attach_obg au
                             where au.caccacc = a.cACCacc
                               and au.cacccur = a.cACCcur
                               and i_table = 304
                               and d_create <= d2
                               and au.c_newdata = '333/4'))
  group by ctrnaccd,ctrncur,iaccotd;
  
  DBMS_TRANSACTION.COMMIT;

  --Комиссия за внутрибанковские платежи в электронном виде 
  --для Крупных клиентов
  INSERT INTO SBS
  (cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, msbscomm, cSBSdo, iSBSdebdoc,msbsdebob )  
   select to_char(sysdate,'HH24:MI:SS'), 
          ctrnaccd,
          ctrncur,
          count(1) * ubrr_xxi5.UBRR_UNIQ_ACC_SUM(ctrnaccd,ctrncur,iaccotd,d1,'PP3E',sum(mtrnsum),0), 
          ubrr_xxi5.UBRR_UNIQ_ACC_SUM(ctrnaccd,ctrncur,iaccotd,d1,'PP3E',sum(mtrnsum),0),
          'PP3E',
          count(1),
          sum(mtrnsum)
     from ubrr_trn_old_new_v,
          acc a,
          otd o
     where ctrnaccd like acc_1
       and ctrncur = 'RUR'
       and dtrntran between d1 and d2+86399/86400
       and caccacc = ctrnaccd
       and cacccur = ctrncur
       and caccprizn <> 'З'
       and o.iotdnum = a.iaccotd
       and ((((itrntype in (2, 3, 14) and itrnpriority not in (3, 4) and nvl(iTRNsop, 0) = 4)
           or  (itrntype in (25, 28)
            and nvl(iTRNsop, 0) not in (5, 7)
            and itrnpriority not in (3, 4)
            and not (itrntype = 25
                 and regexp_like(ctrnpurp, '^ *(|! *)0406')
                 and exists
                         (select 1
                          from xxi."smr"
                          where csmrmfo8 = ctrnmfoa))))
           and (substr(itrnba2c, 1, 3) in (303, 405, 406, 407, 423, 426)
             or  itrnba2c in (40802, 40807, 40817, 40818, 40820)))
           or  (itrntype in (4, 11, 15, 21, 23)
            and not (substr(ctrnacca, 1, 3) in ('401', '402', '403', '404'))
            and nvl(iTRNsop, 0) = 4
            and ctrnmfoa in (select cfilmfo
                             from xxi."fil"
                             where idsmr = ubrr_xxi5.ubrr_util.GetBankIdSmr)))
       and itrntype <> 25
       and (ctrnaccc like '40702%' or ctrnaccc like '40802%')
       and iTRNba2d not in (40813, 40817, 40818, 40820)
       and cACCacc <> '40703810100080000005'
       and substr(caccacc, 1, 3) not in ('401', '402', '403', '404', '409')
       and not exists
               (select 1
                from gac
                where cgacacc = ctrnaccC and cgaccur = a.cacccur and igaccat = 333 and igacnum = 2)
       and exists
               (select 1
                from UBRR_UNIQUE_TARIF_ACC uutc,
                     UBRR_UNIQUE_ACC_COMMS uuac
                where ctrnaccd = uutc.cacc
                  and dtrncreate between uutc.dopentarif and uutc.dcanceltarif
                  and lc_idsmr = uutc.idsmr
                  and uutc.status = 'N'
                  and uutc.uuta_id = uuac.uuta_id
                  and uuac.daily = 'N'
                  and uuac.com_type = 'PP3E')
       and not exists
                   (select 1
                    from gac
                    where cgacacc = a.cACCacc and cgaccur = a.cACCcur and igaccat = 112 and igacnum in (78, 79, 80, 94
                    ,99,100,101,102,103 --27.12.2018 Баязитов [15-43]  АБС: Новый пакет услуг с авансовой оплатой за пакет платежей
                    ,104,105,106 -- Бизнес  Премиум  3, 6, 12  -- ubrr 31.05.2019 Ризанов Р.Т. [19-59153] АБС. Лимит платежей в пакеты услуг "Бизнес-Класс 3,6,12"
                    )
                      and exists
                              (select 1
                               from xxi.au_attach_obg au
                               where au.caccacc = a.cACCacc
                                 and au.cacccur = a.cACCcur
                                 and i_table = 304
                                 and trunc(d_create) <= d2
                                 and au.c_newdata like '112/' || to_char(gac.igacnum)))
 group by ctrnaccd,ctrncur,iaccotd;
  
  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif := 'N';          --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)
  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif_id_check := 'Y'; --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)
 
 DBMS_TRANSACTION.COMMIT;                         
 --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ

----------------------------------------------------------------------------------------------------------------------------
-- UBRR Pashevich AO 14-959
-- ТП "Яблоко"
--Проведение платежей текущей датой:
--с 18-00 ч до 20-00 ч
-- межбанковский платеж
 INSERT INTO SBS( cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, msbscomm, cSBSdo ,iSBSdebdoc,msbsdebob)
 -->> UBRR Pashevich AO 14-1344 Переходим на расчет лимита за день
 select to_char(sysdate,'HH24:MI:SS'), ctrnaccd,ctrncur, sum(mSBStoll_sum), sum(msbscomm) , '018_App_'||csbsdo , sum(iSBSdebdoc) , sum(msbsdebob)
 From
(
 select ctrnaccd,ctrncur,
          ubrr_rko.F_GetComSum( p_com         => '018_App',
                                p_otd         => iACCotd,
                                p_countpay    => sum(case when (quickly_pay=1 and substr (ctrnpurp,1,1)='!') or (quickly_pay=0 and substr (ctrnpurp,1,1)<>'!') or quickly_pay=3 then 1 else 0 end),
                                p_quickly_pay => quickly_pay) mSBStoll_sum,
          ubrr_rko.F_GetComSum( p_com      => '018_App',
                                p_otd      => iACCotd,
                                p_countpay => sum(case when (quickly_pay=1 and substr (ctrnpurp,1,1)='!') or (quickly_pay=0 and substr (ctrnpurp,1,1)<>'!') or quickly_pay=3 then 1 else 0 end),
                                p_quickly_pay => quickly_pay) msbscomm,
          /*'018_App_'||*/substr(quickly_pay,1,1) csbsdo,
          sum(case when (quickly_pay=1 and substr (ctrnpurp,1,1)='!') or (quickly_pay=0 and substr (ctrnpurp,1,1)<>'!') or quickly_pay=3 then 1 else 0 end) iSBSdebdoc ,
          sum(mtrnsum) msbsdebob
     from /*xxi.V_TRN_PART_CURRENT*/ ubrr_trn_old_new_v, acc,ubrr_rko_comms c -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
    where ctrnaccd like acc_1
      and ctrncur = 'RUR'
      and dtrntran between d1 and d2+86399/86400
      and (   (    itrntype in (4,11,15,21,22,23)
               and not (  --  itrnpriority in (3,4,5) and -- 01.09.2017 Макарова Л.Ю. [17-847] АБС: Некорректное списание комиссии за налоговые платежи # 46295
                         substr(ctrnacca,1,3) in ('401', '402', '403', '404')
                        and exists (select 1
                                      from trn_dept_info
                                     where inum = itrnnum
                                       and ianum = itrnanum
                                       and ccreatstatus is not null))
               )
            )
      and not (itrntype=4 and itrnsop=51 and ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
  -->> ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
         and not (itrntype = 22 and regexp_like(ctrnpurp, '^ *(|! *)0406')
                  and exists (select 1 from xxi."smr" where csmrmfo8 = ctrnmfoa))
         --<< ubrr 03.12.2016 Макарова Л.Ю. 16-2817 АБС Бухгалтерия: Корректное взимание комиссии
      and iTRNba2d not in (40813,40817,40818,40820,42309
                          ,40810,40811,40812,40823,40824 -->><<-- ubrr 12.07.2016 Арсланов Д.Ф. #30780
                          )
      and caccacc = ctrnaccd
      and cacccur = ctrncur
      and cACCprizn <> 'З'
      and substr(caccacc,1,3) not in ('401','402','403','404','409')
      and to_char(itrnbatnum) like '__13'
    /*  and exists (select 1
                   from gac
                         where cgacacc = cACCacc
                           and cgaccur = cACCcur
                           and igaccat = 112
                           and igacnum = 70
                 )*/

     -- >>MakarovaLU 14-959 аудит уст. кат. Яблоко
      and exists (select 1
                          from gac
                         where cgacacc = cACCacc
                           and cgaccur = cACCcur
                           and igaccat = 112
                           and igacnum = 70
                           and exists (select 1
                                        from xxi.au_attach_obg au
                                       where au.caccacc = gac.CGACACC
                                         and au.cacccur = gac.CGACcur
                                         and i_table = 304
                                         and d_create <= d2
                                         and au.c_newdata like '112/70'))
  -- >>MakarovaLU 14-959 аудит уст. кат. Яблоко
      and not exists (select 1
                        from gac
                       where cgacacc = acc.cACCacc
                         and cgaccur = acc.cACCcur
                         and igaccat = 333
                         and igacnum = 2)

      and not exists (select 1
                        from gac
                       where cgacacc = acc.cACCacc
                         and cgaccur = acc.cACCcur
                         and igaccat = 131
                         and exists (select 1
                                       from xxi.au_attach_obg au
                                      where au.caccacc = acc.cACCacc
                                        and au.cacccur = acc.cACCcur
                                        and i_table = 304
                                        and d_create <= d2
                                        and au.c_newdata like '131%'))
      -->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
      and not exists (select 1 from UBRR_UNIQUE_TARIF_ACC uutc,
                                   UBRR_UNIQUE_ACC_COMMS uuac 
                             where ctrnaccd = uutc.cacc 
                               and dtrncreate between uutc.DOPENTARIF and uutc.DCANCELTARIF 
                               and lc_idsmr = uutc.idsmr 
                               and uutc.status = 'N'
                               and uutc.uuta_id = uuac.uuta_id
                               and uuac.com_type = '018'     
                      )      
      --<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
      and c.com_code like '018_App%' and c.count_pay=999999
    group by ctrnaccd,ctrncur,iACCotd,quickly_pay, DTRNCREATE
     having sum(case when (quickly_pay=1 and substr (ctrnpurp,1,1)='!') or (quickly_pay=0 and substr (ctrnpurp,1,1)<>'!') or quickly_pay=3 then 1 else 0 end)>0
     )
Group By ctrnaccd,ctrncur, csbsdo;
--<< UBRR Pashevich AO 14-1344

DBMS_TRANSACTION.COMMIT;



-- Зуев А.А. Комиссия за ЦФК
    INSERT INTO SBS
          (cSBSpayfrom_acc, cSBSacc, cSBScur,
           mSBStoll_sum, cSBSdo ,iSBSdebdoc)
    SELECT to_char(sysdate,'HH24:MI:SS'), accm.caccacc, accm.cacccur,
         -- count(unique accm2.iacccus)*50, 'CFK', count(unique accm2.iacccus)--- Галиева Н.А. 25.05.2017 г.
             count(unique accm2.iacccus)*0, 'CFK', count(unique accm2.iacccus) --- Распоряжения № 7006-574 от 13.04.2017
      FROM ibank2.mclients m,
           acc accm,
           ibank2.m2clients m2,
           ibank2.c2accounts c2a,
           ibank2.accounts a,
           xxi."acc" accm2
     where accm.caccacc = replace(replace(trim(m.note),chr(13)),chr(10))
       and accm.caccacc like acc_1
       and accm.caccprizn <> 'З'
       and m2.mclient_id = m.client_id
       and c2a.client_id = m2.client_id
       and a.id = c2a.account_id
       and accm2.caccacc = a.account
       and ubrr_zaa_mclients.Check_M(m.client_id, m.client_id, d1, d2) = 1
       and ubrr_zaa_mclients.Check_M2(m2.client_id, m2.mclient_id, d1, d2) = 1
       and accm.iacccus <> accm2.iacccus
     group by accm.caccacc, accm.cacccur;
    DBMS_TRANSACTION.COMMIT;


----------------------------------------------------------------------------------------------------------------------------
/*
    расчёт комиссий "За перечисление на корпоративный расчетный счет (КРС)".
*/
   INSERT INTO SBS
   (cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, cSBSdo ,iSBSdebdoc,msbsdebob)
   (
        select to_char(sysdate,'HH24:MI:SS'), ctrnaccd, ctrncur, sum(summ), 'KRS', sum(cnt), sum(summtrn)
        from
        (
            select /*+ index(trn I_TRN_OLD_NEW_DAC)*/ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                   trn.ctrnaccd as ctrnaccd
                  ,trn.ctrncur as ctrncur
                  ,sum(xxi.comms.Get_ScaleSumm(3000, trn.mtrnsum, ctrncur, sysdate, 'D','RUR')) as summ
                  ,count(1) as cnt
                  ,sum(trn.mtrnsum) as summtrn
             from  xxi.acc accd
                  ,ubrr_trn_old_new_v trn --xxi.V_TRN_PART_CURRENT -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
            where
                accd.caccacc like '40___810%'
                and accd.caccacc like acc_1
                and accd.cacccur='RUR'
                and accd.caccprizn<>'З'
                and trn.ctrnaccd=accd.caccacc
                and trn.ctrncur=accd.cacccur
                and trn.ITRNTYPE in (2,4) --  БО1= 2 и 4 (внутрибанк и межфилиальные платежи).
                and not (itrntype=4 and itrnsop=51 and ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
                and trn.dtrntran between d1 and d2+0.99999
                and trn.cTRNstate1 = 4 -- со статусом "Проведён".
                and trn.ctrnacca like '40___810%'
                AND EXISTS (
                          SELECT '1'
                            FROM xxi."acc" acca, xxi."gac" g
                           WHERE acca.iacccus = accd.iacccus
                             AND acca.caccacc = trn.ctrnacca
                             AND acca.cacccur = trn.ctrncurc
                             and g.cgacacc = acca.caccacc
                             AND g.cgaccur = acca.cacccur
                             and g.idsmr = acca.idsmr
                             AND g.igaccat = 333
                             AND g.igacnum = 2
                            )
---<<<UBRR Pashevich A. #12-508

--->>>UBRR Pashevich A. #12-508
                -- UBRR Pashevich  A. 12-1750
                and not exists (select 1
                                 from gac
                                  where     cgacacc = cACCacc
                                        and cgaccur = cACCcur
                                        and igaccat = 112
                                        and igacnum =57)
                -- UBRR Pashevich  A. 12-1750
            group by trn.ctrnaccd, trn.ctrncur
            union
            select /*+ index(trn I_TRN_OLD_NEW_ACDT)*/
                 trn.ctrnaccd as ctrnaccd
                , trn.ctrncur as ctrncur
                , sum(xxi.comms.Get_ScaleSumm(3000, trn.mtrnsum, ctrncur, sysdate, 'D','RUR')) as summ
                , count(1) as cnt
                , sum(trn.mtrnsum) as summtrn
            from xxi.acc accd
                ,ubrr_trn_old_new_v trn --xxi.V_TRN_PART_CURRENT -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
            where
                accd.caccacc like '40___810%'
                and accd.caccacc like acc_1
                and accd.cacccur='RUR'
                and accd.caccprizn<>'З'
                and trn.ctrnaccd=accd.caccacc
                and trn.ctrncur=accd.cacccur
                and trn.ITRNTYPE = 2
                and not (trn.itrntype=4 and trn.itrnsop=51 and trn.ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
                and trn.dtrntran between d1 and d2+0.99999
                and trn.ctrnaccc like '303%9000'
                and trn.cTRNstate1 = 4 -- со статусом "Проведён".
                and exists (
                          SELECT 'x'
                            FROM ubrr_acc_v accc,xxi."gac" g  -- 15.05.2016 Клейн А.М. ВУЗ: Изменение xxi."acc" на ubrr_acc_v
                           WHERE accc.iacccus = accd.iacccus
                             AND accc.caccacc LIKE '40%'
                             AND accc.cacccur = 'RUR'
                             AND accc.caccprizn <> 'З'
                             and g.cgacacc = accc.caccacc
                             AND g.cgaccur = accc.cacccur
                             and g.idsmr=accc.idsmr
                             AND g.igaccat = 333
                             AND g.igacnum = 2
                             AND trn.ctrnowna LIKE '%' || accc.caccacc || '%'
                           )
---<<<UBRR Pashevich A. #12-508

--->>>UBRR Pashevich A. #12-508
                -- UBRR Pashevich  A. 12-1750
                and not exists (select 1
                                 from gac
                                  where     cgacacc = cACCacc
                                        and cgaccur = cACCcur
                                        and igaccat = 112
                                        and igacnum =57
                                 group by trn.ctrnaccd, trn.ctrncur)
                -- UBRR Pashevich  A. 12-1750
         group by trn.ctrnaccd,trn.ctrncur
        )
        /*where not exists (select 1
                            from xxi.au_attach_obg au
                           where au.caccacc = ctrnaccd
                             and au.cacccur = ctrncur
                             and d_create > d1
                             and d_create < d2
                             and i_table = 304
                             and au.c_newdata in ('112/35','112/36','112/37','112/39','112/45'))
          and not exists (select 1
                            from gac
                           where cgacacc = ctrnaccd
                             and cgaccur = ctrncur
                             and igaccat = 112
                             and igacnum in (35,36,37,39,45))*/
        group by ctrnaccd, ctrncur
    );
  dbms_transaction.commit;

   commit;
---<<< Pashevich A. #12-508

----------------------------------------------------------------------------------------------------------------------------
-->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ 
/*
      -- корпоративный расчетный счет
       -- крупные клиенты
   INSERT INTO SBS
   (cSBSpayfrom_acc,cSBSacc, cSBScur, mSBStoll_sum, cSBSdo ,iSBSdebdoc,msbsdebob)
   (
        select to_char(sysdate,'HH24:MI:SS'), ctrnaccd, ctrncur, sum(summ), 'KRS', sum(cnt), sum(summtrn)
        from
        (
            select \*+ index(trn I_TRN_OLD_NEW_DAC)*\ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                   trn.ctrnaccd as ctrnaccd
                  ,trn.ctrncur as ctrncur
                  ,greatest(round(sum(trn.mtrnsum)*u.comvnbnkcoraccpr/100,2),u.comvnbnkcoracc) as summ
                  ,count(1) as cnt
                  ,sum(trn.mtrnsum) as summtrn
             from  ubrr_unique_tarif      u
                  ,xxi.acc                accd
                  ,ubrr_trn_old_new_v trn --xxi.V_TRN_PART_CURRENT -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
            where
                accd.caccacc like '40___810%'
                and SYS_CONTEXT ('B21', 'IDSmr') = u.idsmr           -->><<-- ubrr Арсланов Д.Ф. #29736 Доработки по РКО для ВУЗ
                and accd.caccacc like acc_1
                and accd.cacccur='RUR'
                and accd.caccprizn<>'З'
                and trn.ctrnaccd=accd.caccacc
                and trn.ctrncur=accd.cacccur
                and trn.ITRNTYPE in (2,4) --  БО1= 2 и 4 (внутрибанк и межфилиальные платежи).
                and not (trn.itrntype=4 and trn.itrnsop=51 and trn.ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
                and trn.dtrntran between d1 and d2+0.99999
                and trn.cTRNstate1 = 4 -- со статусом "Проведён".
                and trn.ctrnacca like '40___810%'
                AND EXISTS (
                          SELECT '1'
                            FROM xxi."acc" acca, xxi."gac" g
                           WHERE acca.iacccus = accd.iacccus
                             AND acca.caccacc = trn.ctrnacca
                             AND acca.cacccur = trn.ctrncurc
                             and g.cgacacc = acca.caccacc
                             AND g.cgaccur = acca.cacccur
                             and g.idsmr = acca.idsmr
                             AND g.igaccat = 333
                             AND g.igacnum = 2
                            )
---<<<UBRR Pashevich A. #12-508
                and accd.caccacc =cacc and dtrncreate between DOPENTARIF and DCANCELTARIF
--->>>UBRR Pashevich A. #12-508
            group by trn.ctrnaccd, trn.ctrncur,u.comvnbnkcoraccpr,u.comvnbnkcoracc
            union
            select \*+ index(trn I_TRN_OLD_NEW_ACDT)*\ -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
                 trn.ctrnaccd as ctrnaccd
                , trn.ctrncur as ctrncur
                , greatest(round(sum(trn.mtrnsum)*u.comvnbnkcoraccpr/100,2),u.comvnbnkcoracc) as summ
                , count(1) as cnt
                , sum(trn.mtrnsum) as summtrn
            from   ubrr_unique_tarif      u
                  ,xxi.acc                accd
                  ,ubrr_trn_old_new_v trn --xxi.V_TRN_PART_CURRENT -->><<--18.10.2019 Баязитов [19-62184] Ежемесячные комиссии
            where
                accd.caccacc like '40___810%'
                and SYS_CONTEXT ('B21', 'IDSmr') = u.idsmr           -->><<-- ubrr Арсланов Д.Ф. #29736 Доработки по РКО для ВУЗ
                and accd.caccacc like acc_1
                and accd.cacccur='RUR'
                and accd.caccprizn<>'З'
                and trn.ctrnaccd=accd.caccacc
                and trn.ctrncur=accd.cacccur
                and trn.ITRNTYPE = 2
                and not (trn.itrntype=4 and trn.itrnsop=51 and trn.ctrnpurp like '0450%') -->><<--22.10.2019 Баязитов [19-67950] Устранение ошибок ввода ОЭ доработок по комиссиям за РКО с 01.09.19 (#62808,#62974,#62262)
                and trn.dtrntran between d1 and d2+0.99999
                and trn.ctrnaccc like '303%9000'
                and trn.cTRNstate1 = 4 -- со статусом "Проведён".
                and exists (
                          SELECT 'x'
                            FROM ubrr_acc_v accc,xxi."gac" g  -- 15.05.2016 Клейн А.М. ВУЗ: Изменение xxi."acc" на ubrr_acc_v
                           WHERE accc.iacccus = accd.iacccus
                             AND accc.caccacc LIKE '40%'
                             AND accc.cacccur = 'RUR'
                             AND accc.caccprizn <> 'З'
                             and g.cgacacc = accc.caccacc
                             AND g.cgaccur = accc.cacccur
                             and g.idsmr=accc.idsmr
                             AND g.igaccat = 333
                             AND g.igacnum = 2
                             AND trn.ctrnowna LIKE '%' || accc.caccacc || '%'
                           )
---<<<UBRR Pashevich A. #12-508
                and accd.caccacc =cacc and dtrncreate between DOPENTARIF and DCANCELTARIF
--->>>UBRR Pashevich A. #12-508
         group by trn.ctrnaccd,trn.ctrncur,u.comvnbnkcoraccpr,u.comvnbnkcoracc
        )
        \*where not exists (select 1
                            from xxi.au_attach_obg au
                           where au.caccacc = ctrnaccd
                             and au.cacccur = ctrncur
                             and d_create > d1
                             and d_create < d2
                             and i_table = 304
                             and au.c_newdata in ('112/35','112/36','112/37','112/39','112/45'))
          and not exists (select 1
                            from gac
                           where cgacacc = ctrnaccd
                             and cgaccur = ctrncur
                             and igaccat = 112
                             and igacnum in (35,36,37,39,45))*\
        group by ctrnaccd, ctrncur
    );
  dbms_transaction.commit;
*/
--<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ  

--->>> Pashevich A. #12-508



-- >> 24.07.2019 Ризанов Р.Т. [19-62974] III ЭТАП УБРИР. Распространение Пакетов услуг УБРиР на ВУЗ
 if ( trunc(portion_date1) >= nvl( to_date( xxi.pref.get_preference(pref.c_universuser, 'UBRR_BNKSERV_START_ANALIZE_ACCOUNTS'),'dd.mm.yyyy' ),util.dnulldate ) ) then
    l_cnt_rko := ubrr_bnkserv_calc_new_lib.Analize_Accounts_For_RKO( portion_date1 => portion_date1
                                                                    ,portion_date2 => portion_date2
                                                                    ,dtran         => dtran
                                                                    ,p_ls          => acc_1
                                                                    ,p_calc_table  => ubrr_bnkserv_calc_new_lib.gc_calc_table_sbs );
end if;
-- << 24.07.2019 Ризанов Р.Т. [19-62974] III ЭТАП УБРИР. Распространение Пакетов услуг УБРиР на ВУЗ

-->>> ubrr rizanov 03.07.2018 18-465 Комиссия за ведение счета КРС
-- заполняем sbs
 ubrr_bnkserv_krc.fill_sbs( p_portion_date1 => d1
                           ,p_portion_date2 => d2
                           ,p_dtran         => d3
                           ,p_idsmr         => sys_context ('B21', 'IDSmr') );
--<<< ubrr rizanov 03.07.2018 18-465 Комиссия за ведение счета КРС


-->> 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов
/*
-->>12.12.2018 Баязитов [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей
declare
    type t_tSbs Is record (
        cSBSpayfrom_acc    sbs.cSBSpayfrom_acc%TYPE,
        cSBSacc            sbs.cSBSacc%TYPE,
        cSBScur            sbs.cSBScur%TYPE,
        mSBStoll_sum       sbs.mSBStoll_sum%TYPE,
        cSBSdo             sbs.cSBSdo%TYPE,
        mSBScomm           sbs.mSBScomm%TYPE,
        iSBSdebdoc         sbs.iSBSdebdoc%TYPE,
        iACCotd            acc.iACCotd%TYPE,
        mSBSdebob          sbs.mSBSdebob%TYPE
    );
    type t_tSbs_Table is Table of t_tSbs index by binary_integer;
    tSbsList t_tSbs_Table;
    vErr       varchar2(2000);
    cityname   ubrr_data.ubrr_comm_mvz.ccity%type;
    inum112    number;
    inum131    number;
    imvz       number;
    comiss     number;
begin
    tSbsList.delete;

    select to_char(sysdate,'HH24:MI:SS'), caccacc, cacccur, 0, 0, 0, 0, iACCotd, 0
     Bulk Collect Into tSbsList
     from acc a
    where caccacc like acc_1
      and cacccur = 'RUR'
      and cACCprizn <> 'З'
      and substr(caccacc,1,3) not in ('401','402','403','404','409')
      and exists (select 1
                  from gac
                  where cgacacc = a.cACCacc
                  and cgaccur = a.cACCcur
                  and igaccat = 112
                  and igacnum in (78,79,80,
                  99,100,101,102,103) -->><<--12.12.2018 Баязитов [15-43]
                  and exists (select 1
                                from xxi.au_attach_obg au
                               where au.caccacc = a.cACCacc
                                 and au.cacccur = a.cACCcur
                                 and i_table = 304
                                 and trunc(d_create) <= d2
                                 and add_months(first_day(au.d_create), decode(igacnum,  99, 1,
                                                                                        103, 1,
                                                                                         78, 3,
                                                                                        100, 3,
                                                                                         79, 6,
                                                                                        101, 6,
                                                                                         80, 12,
                                                                                        102, 12
                                                                                        )

                                 ) = first_day(sysdate)
                                 and au.c_newdata like '112/'||to_char(gac.igacnum)
                                 and au.d_create = (select max(au1.d_Create)
                                                      from xxi.au_attach_obg au1
                                                     where au1.Caccacc = au.Caccacc
                                                       and au1.Cacccur = au.Cacccur
                                                       and i_table = 304
                                                       and au1.c_type in ('I', 'U')
                                                       and au1.c_newdata like '112/'||to_char(gac.igacnum))
                             )
                 )
      and not exists (select 1 from ubrr_unique_tarif where caccacc =cacc and d3 between DOPENTARIF and DCANCELTARIF and SYS_CONTEXT ('B21', 'IDSmr') = idsmr);


    if nvl(tSbsList.count, 0) > 0 then
      for i in tSbsList.first..tSbsList.last Loop
        vErr := null;

        select g1.igacnum
          into inum112
          from gac g1
         where g1.cgacacc = tSbsList(i).cSBSacc
           and g1.cgaccur = tSbsList(i).cSBScur
           and g1.igaccat = 112
           and g1.igacnum in (78,79,80,99,100,101,102,103);

        if inum112 not in (99,100,101,102) then
          begin
            select igacnum
              into inum131
              from gac
             where cgacacc = tSbsList(i).cSBSacc
               and cgaccur = tSbsList(i).cSBScur
               and igaccat = 131;
          exception
            when no_data_found then
              vErr := 'Для категории 131 группа не найдена';
          end;

          begin
            select cmvz
              into imvz
              from ubrr_comm_gacmvz_tarif
             where icat = 131
               and inum = inum131;
          exception
            when no_data_found then
              imvz := 0;
          end;

          begin
            select ccity
              into cityname
              from ubrr_comm_mvz
             where cmvz = imvz;
          exception
            when no_data_found then
              cityname := 'Город не определен';
          end;

          if cityname = 'Город не определен' then
            vErr := 'Город не определен';
            imvz := null;
          elsif cityname = 'Прочие города' then
            imvz := 0;
          end if;

        else
          imvz := tSbsList(i).iACCotd;
        end if;

        begin
          select msum, tarif_text
            into comiss, tSbsList(i).cSBSdo
            from ubrr_comm_mvz_tarif
           where cmvz = imvz
             and tarif = '112/'||inum112;
        exception
          when no_data_found then
            vErr := 'Комиссия не найдена';
            comiss := null;
        end;

        if comiss is null or vErr is not null then
          tSbsList(i).cSBSdo := vErr;
        else
          tSbsList(i).mSBScomm := comiss;
          tSbsList(i).mSBStoll_sum := comiss;
        end if;

        --if inum112 in (78,79,80,99,100,101,102,103) then
          INSERT INTO SBS
            (cSBSpayfrom_acc, cSBSacc, cSBScur, mSBStoll_sum, cSBSdo, mSBScomm, iSBSdebdoc, mSBSdebob)
          values
            (tSbsList(i).cSBSpayfrom_acc,
             tSbsList(i).cSBSacc,
             tSbsList(i).cSBScur,
             tSbsList(i).mSBStoll_sum,
             tSbsList(i).cSBSdo,
             tSbsList(i).mSBScomm,
             tSbsList(i).iSBSdebdoc,
             tSbsList(i).mSBSdebob);
        --end if;

      end loop;
    end if;
    dbms_transaction.commit;
end;
--<<12.12.2018 Баязитов [15-43] АБС: Новый пакет услуг с авансовой оплатой за пакет платежей
*/
--<< 01.02.2019 Фридьев П.В.  [19-58770] Изменение даты запуска пролонгации пакетов

-->> 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ
/*
-->>07.02.2020 Баязитов [20-71580] Перенос старых комиссий до 01.02.2018 в процедуру UBRR_BNKSERV https://redmine.lan.ubrr.ru/issues/71582#note-5
if gc_calc then
  ubrr_bnkserv_old(portion_date1, portion_date2, dtran, ls);
end if;
--<<-07.02.2020 Баязитов [20-71580] Перенос старых комиссий до 01.02.2018 в процедуру UBRR_BNKSERV https://redmine.lan.ubrr.ru/issues/71582#note-5
*/
--<< 31.08.2020 Зеленко С.А. [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ

-- >> 24.07.2019 Ризанов Р.Т.19-62974 III ЭТАП УБРИР. Распространение Пакетов услуг УБРиР на ВУЗ

  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif := 'N';          --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)
  ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif_id_check := 'Y'; --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)

   write_det_log('Окончание заполнения SBS для ежемесячных комиссий УБРиР');
exception when others then
      
      ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif := 'N';          --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)
      ubrr_bnkserv_calc_new_lib.gc_sbs_uniq_taif_id_check := 'Y'; --09.09.2020  Зеленко С.А.     [20-73382] Индивидуальные тарифы по кассовым операциям, по переводам в пользу ФЛ (доработка расчета суммы для индивидуальных тарифов)

       ubrr_bnkserv_calc_new_lib.writeprotocol('Error in     UBRR_BNKSERV ['                          ||
                                               'portion_date1=' ||to_char(portion_date1,'dd.mm.yyyy') ||';'||
                                               'portion_date2=' ||to_char(portion_date2,'dd.mm.yyyy') ||';'||
                                               'dtran='         ||to_char(dtran  ,'dd.mm.yyyy')       ||';'||
                                               'ls='            ||ls                                  ||';'||
                                               ')'||
                                               dbms_utility.format_error_backtrace || ' ' ||sqlerrm );
       raise_application_error(-20006,dbms_utility.format_error_backtrace||' '||sqlerrm);

-- << 24.07.2019 Ризанов Р.Т.19-62974 III ЭТАП УБРИР. Распространение Пакетов услуг УБРиР на ВУЗ
END ubrr_bnkserv;
/
